{
  "productDetails": [
    {
      "title": "USANOOKS Microfiber Cleaning Cloth - Turq - 12Pcs (12.5x12.5 inch) High Performance - 1200 Washes, Ultra Absorbent Car Towel Traps Grime & Liquid for Streak-Free Mirror Shine - car Washing Cloth",
      "imagesCSV": "916oU5v8omS.jpg,61r424cJ+FL.jpg,919EE3CY5dL.jpg,91halmREKfL.jpg,9128XzflaUL.jpg,913UeDhZbfL.jpg,91LOZTkW0aL.jpg",
      "manufacturer": "USANOOKS",
      "asin": "B08BRB6K9N",
      "brand": "USANOOKS",
      "features": [
        "10x GRIP-ROOT WEAVE - TRAP MORE, WORK LESS: Ultra-absorbent kitchen towels Grip Root weave works like PLANT ROOT FOLLICLES, sucking up & LOCKING AWAY 8x to 10x its weight in liquid, particulates, moisture, grime and dirt in far LESS TIME than traditional ‘Heavy Duty’ Cleaning Rags.",
        "PERFORMANCE OPTIMIZED - WON’T LINT, SCRATCH, PILL, SWIRL, SHED or BLEED like a thin, cheaply made microfiber towels for cars. RAPID DRY release layers make these the ideal microfiber towels for cars, creating that spectacular, SWIRL FREE MIRROR SHINE with our cleaning rags.",
        "LASTS 1200+ WASHES - That’s 3.27 YEARS worth of use in this 12 pack of COMMERCIAL GRADE 300 GSM microfiber towels. OVERLOCK BRAIDED STITCHING make the ideal SUSTAINABLE SOLUTION for cleaning every SURFACE, CRACK & CREVICE in your home, garage or office. MACHINE WASHABLE, Tumble Dry.",
        "SOAK IT UP FASTER - 4X’s MORE ABSORBENT than COTTON cloths, these are the microfiber cleaning cloth for cars to get if you want an ALL PURPOSE cleaning towels that scoops up your messes, oils and liquids FASTER than a SPONGE, more SANITARILY than your mop and with ZERO DANGEROUS WET SPOTS like your WET VAC.",
        "UNRIVALED POWER - TEST THIS GRIP-ROOT technology risk free for 30 full days. Love how it LOCKS AWAY dirt, dust, grime, spills and messes better than any other high performance cleaning rags you’ve tried, for a mirror shine finish. No hassle, gimmicks or questions asked."
      ],
      "description": "N/A",
      "parentTitle": "USANOOKS Microfiber Cleaning Cloth - 12Pcs (12.5x12.5 inch) High Performance - 1200 Washes, Ultra Absorbent Car Towel Traps Grime & Liquid for Streak-Free Mirror Shine, Washing Cloth and Applicator",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Drift Car Air Freshener - Wood Fragrance - Automotive Odor Eliminator - Car Fresheners Long Lasting - Open Air Scent Refill - Pack of 3 - NO CLIP INCLUDED",
      "imagesCSV": "81TYf03obTL.jpg,41c-P9w6cHL.jpg,81SwkEB4iQL.jpg,71b8GpYWOTL.jpg,81nzlLf9YRL.jpg,81WjO6ensIL.jpg,71MDBvzTgaL.jpg",
      "manufacturer": "drift",
      "asin": "B0D463HXK5",
      "brand": "drift",
      "features": [
        "WOOD CAR FRESHENERS: Drift car air fresheners are made to uproot your typical air freshener. We've combined sophisticated, functional design with real, designer and luxury grade scents.",
        "MADE IN THE USA: Our wood freshener is made right here in the USA from sustainably sourced wood, and magnetized to fit perfectly on your car visor with our metal clip. Our Open Air scent has notes of fresh air, crisp linen, morning dew.",
        "LONG LASTING: Crafted with our natural essential and fragrance oil blends to deliver a great scent free of harmful chemicals all day. Looks good, smells good, all good.",
        "SIMPLE DESIGN: Attach metal clip to visor so the ledge faces down when closed. Open one side of bag until scent dissipates and freshener doesn't have any visible oil on surface. Attach the scent block to the clip, it will magnetically snap in, make sure there is no overhang on either side of the clip.",
        "REFILLABLE SCENTS: Keep scent sealed in bag and out of the sun until ready for use. Replace the scent block at minimum every 30 days. Do not use on any other surface than provided metal visor clip."
      ],
      "description": "meet wood, made to uproot your typical air freshener. we've combined sophisticated, functional design with real, designer grade scents. our wood freshener is made right here in the usa from sustainably sourced wood, and magnetized to fit perfectly on your visor with our metal clip. soaked in our drift essential fragrance oil blends to deliver a great scent free of harmful chemicals. looks good, smells good, all good.",
      "parentTitle": "Wood Air Freshener Refill - Variety Pack",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "USANOOKS Microfiber Cleaning Cloth - Turq - 12Pcs (12.5x12.5 inch) High Performance - 1200 Washes, Ultra Absorbent Car Towel Traps Grime & Liquid for Streak-Free Mirror Shine - car Washing Cloth",
      "imagesCSV": "916oU5v8omS.jpg,61r424cJ+FL.jpg,919EE3CY5dL.jpg,91halmREKfL.jpg,9128XzflaUL.jpg,913UeDhZbfL.jpg,91LOZTkW0aL.jpg",
      "manufacturer": "USANOOKS",
      "asin": "B08BRB6K9N",
      "brand": "USANOOKS",
      "features": [
        "10x GRIP-ROOT WEAVE - TRAP MORE, WORK LESS: Ultra-absorbent kitchen towels Grip Root weave works like PLANT ROOT FOLLICLES, sucking up & LOCKING AWAY 8x to 10x its weight in liquid, particulates, moisture, grime and dirt in far LESS TIME than traditional ‘Heavy Duty’ Cleaning Rags.",
        "PERFORMANCE OPTIMIZED - WON’T LINT, SCRATCH, PILL, SWIRL, SHED or BLEED like a thin, cheaply made microfiber towels for cars. RAPID DRY release layers make these the ideal microfiber towels for cars, creating that spectacular, SWIRL FREE MIRROR SHINE with our cleaning rags.",
        "LASTS 1200+ WASHES - That’s 3.27 YEARS worth of use in this 12 pack of COMMERCIAL GRADE 300 GSM microfiber towels. OVERLOCK BRAIDED STITCHING make the ideal SUSTAINABLE SOLUTION for cleaning every SURFACE, CRACK & CREVICE in your home, garage or office. MACHINE WASHABLE, Tumble Dry.",
        "SOAK IT UP FASTER - 4X’s MORE ABSORBENT than COTTON cloths, these are the microfiber cleaning cloth for cars to get if you want an ALL PURPOSE cleaning towels that scoops up your messes, oils and liquids FASTER than a SPONGE, more SANITARILY than your mop and with ZERO DANGEROUS WET SPOTS like your WET VAC.",
        "UNRIVALED POWER - TEST THIS GRIP-ROOT technology risk free for 30 full days. Love how it LOCKS AWAY dirt, dust, grime, spills and messes better than any other high performance cleaning rags you’ve tried, for a mirror shine finish. No hassle, gimmicks or questions asked."
      ],
      "description": "N/A",
      "parentTitle": "USANOOKS Microfiber Cleaning Cloth - 12Pcs (12.5x12.5 inch) High Performance - 1200 Washes, Ultra Absorbent Car Towel Traps Grime & Liquid for Streak-Free Mirror Shine, Washing Cloth and Applicator",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Drift Car Air Freshener - Wood Fragrance - Automotive Odor Eliminator - Car Fresheners Long Lasting - Open Air Scent Refill - Pack of 3 - NO CLIP INCLUDED",
      "imagesCSV": "81TYf03obTL.jpg,41c-P9w6cHL.jpg,81SwkEB4iQL.jpg,71b8GpYWOTL.jpg,81nzlLf9YRL.jpg,81WjO6ensIL.jpg,71MDBvzTgaL.jpg",
      "manufacturer": "drift",
      "asin": "B0D463HXK5",
      "brand": "drift",
      "features": [
        "WOOD CAR FRESHENERS: Drift car air fresheners are made to uproot your typical air freshener. We've combined sophisticated, functional design with real, designer and luxury grade scents.",
        "MADE IN THE USA: Our wood freshener is made right here in the USA from sustainably sourced wood, and magnetized to fit perfectly on your car visor with our metal clip. Our Open Air scent has notes of fresh air, crisp linen, morning dew.",
        "LONG LASTING: Crafted with our natural essential and fragrance oil blends to deliver a great scent free of harmful chemicals all day. Looks good, smells good, all good.",
        "SIMPLE DESIGN: Attach metal clip to visor so the ledge faces down when closed. Open one side of bag until scent dissipates and freshener doesn't have any visible oil on surface. Attach the scent block to the clip, it will magnetically snap in, make sure there is no overhang on either side of the clip.",
        "REFILLABLE SCENTS: Keep scent sealed in bag and out of the sun until ready for use. Replace the scent block at minimum every 30 days. Do not use on any other surface than provided metal visor clip."
      ],
      "description": "meet wood, made to uproot your typical air freshener. we've combined sophisticated, functional design with real, designer grade scents. our wood freshener is made right here in the usa from sustainably sourced wood, and magnetized to fit perfectly on your visor with our metal clip. soaked in our drift essential fragrance oil blends to deliver a great scent free of harmful chemicals. looks good, smells good, all good.",
      "parentTitle": "Wood Air Freshener Refill - Variety Pack",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Mobil 1 FS European Car Formula Full Synthetic Motor Oil 0W-40, 5 Quart",
      "imagesCSV": "61fZFMnctkL.jpg,415MZuoUB-L.jpg,411AC8H7FLS.jpg,61YS-vSdNxL.jpg,61acx9awfRL.jpg,71UVFahNxBL.jpg,61c9N8FH+NL.jpg,61eAjv6Y0kL.jpg",
      "manufacturer": "Mobil 1",
      "asin": "B00HG76A9A",
      "brand": "Mobil",
      "features": [
        "Mobil 1 FS European Car Formula full synthetic motor oil 0W-40 helps to extend engine life even in severe conditions",
        "Helps to control oxidation to prevent oil breakdown and maintain excellent viscosity for up to 10,000 miles between oil changes*",
        "Provides outstanding engine wear protection and performance with uniform synthetic oil molecules for better friction reduction",
        "Keeps your engine running like new by working to prevent damaging deposits and sludge buildup",
        "Provides excellent internal engine heat protection (up to 500 degrees F) and low temperature protection (up to -40 degrees F)",
        "This product has the following approvals: AVTOVAZ (LADA cars); MB-Appoval 229.5; MB-Approval 229.3; Nissan Genuine Performances; Porsche A40; VW 502 00; VW 505 00; BMW Longlife 01"
      ],
      "description": "Mobil 1 FS European Car Formula 0W-40 helps to extend engine life, even in severe conditions, and protects critical engine parts for up to 10,000 miles between oil changes*. Its uniform synthetic oil molecules reduce friction, helping to prevent deposits and sludge buildup. This technologically advanced formulation provides excellent internal engine heat protection (up to 500 degrees Fahrenheit), and low-temperature protection (to -40 degrees Fahrenheit), supporting quick cold-weather starting and ultra-fast protection. Mobil 1 FS European Car Formula 0W-40 also helps control oxidation to prevent oil breakdown. Approved for many Mercedes-Benz, VW, Audi and Porsche vehicles, this formula provides excellent turbocharged engine protection. Mobil 1 is America’s leading synthetic motor oil brand at retail**, recommended by car builders and experienced mechanics, and is the Official Motor Oil of NASCAR®. (*Protects for 10,000 miles or 1 year, whichever comes first. To learn more about the Mobil 1 Limited Warranty, visit Mobil.US. **Source: The NPD Group/ Retail Tracking Service/ Dollar Sales/ PCMO Full Synthetic/ 52 weeks ending September 30, 2023)",
      "parentTitle": "Mobil 1 Extended Performance Full Synthetic Motor Oil",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Rain-X 5079282-2 Latitude 2-In-1 Water Repellent Wiper Blades, 28 Inch Windshield Wipers (Pack Of 1), Automotive Replacement Windshield Wiper Blades With Patented Repellency Formula",
      "imagesCSV": "61w6uyAmoBL.jpg,51bQLtb4t0L.jpg,41X+HLNVrdL.jpg,51FhqQwlMCL.jpg,81WKAQHaJhL.jpg,81q1Hl6lktL.jpg,811c-mRtGSL.jpg,81PEaNARB-L.jpg,610tWwkDEOL.jpg,41hpjGqXuGL.jpg",
      "manufacturer": "Rain-X",
      "asin": "B016NAA0J6",
      "brand": "Rain-X",
      "features": [
        "Patented Water Repellent Formula - This 2-In-1 Wiper Blade Plus Rain Repellent Applies Patented Rain X Water Repellent Directly To Your Windshield, Both Clearing And Repelling The Elements",
        "Superior Driving Visibility And Safety - Watch Water Magically Bead Up And Roll Off Your Windshield While You Drive, Providing You With Superior All-Weather Driving Visibility, Safety, And Comfort",
        "Easy Installation And Universal Fit - The Rain-X Universal Adapter Is Easy To Use And Fits 96% Of Vehicles. Scan The QR Code On The Back Of The Package For Installation Videos",
        "Advanced Beam Wiper Blade Technology - Provides Uniform Pressure Points Along The Length Of The Blade, Allowing It To Hug The Curvature Of The Windshield For A Smooth, Clean Wipe",
        "Ultimate All-Weather Performance - Designed To Clear Your Windshield In Extreme Weather Conditions, Such As Ice, Snow, And Sleet Delivering Longer-Lasting, Superior Wipe Performance",
        "DISCLAIMER: Please remove the yellow squeegee cover after installation to ensure optimal performance. Failure to do so will prevent the wiper blades from working properly."
      ],
      "description": "Outsmart the Elements with Rain-X! No other wipers deliver the innovation and technology that is offered by Rain-X Latitude Water Repellency Wiper Blades. These unique blades apply a patented Rain-X water repellent directly onto your windshield for you. The repellent is transferred from the squeegee to the glass – and the magic of Rain-X is activated! Rain-X Latitude Water Repellency Wiper Blades feature advanced beam technology designed to hug your windshield for maximum contact and superior wipe quality. These 2-in-1 wiper blades both clear and repel the elements to provide superior driving visibility. Compared to traditional wiper blades, the difference is amazing! For optimal water repellency activation, run your wiper blades on a clean, dry windshield for 2 minutes. Once activated, the water repelling action will last for months! If you need additional help with determining the right wiper blade size for your car, reference our Blade Finder or Amazon's Confirmed Fit program. If you need help with installing your new wiper blades, installation videos can be found by scanning the QR code on the back of your wiper blade’s packaging.",
      "parentTitle": "Rain-X Wiper Blades",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "GOOACC 238Pcs Trim Removal Tool, Auto Push Pin Bumper Retainer Clip Set Fastener Terminal Remover Tool Adhesive Cable Clips Pry Kit Car Panel Radio Removal Auto Clip Pliers (GRC-207)",
      "imagesCSV": "71O8fn6WZ2L.jpg,61UScVqyGKL.jpg,71hVI46I5aL.jpg,71dpFkhw8XL.jpg,71sQWNxMNFL.jpg,71gsc-19mTL.jpg,716RgQQwpKL.jpg,71ZfNwsxwBL.jpg,817AXUPbEGL.jpg",
      "manufacturer": "GOOACC",
      "asin": "B0BLCH1HZL",
      "brand": "GOOACC",
      "features": [
        "12 Most Popular Sizes : There are 12 most common sizes of clips which will meet your needs, sturdy and reusable, compatible for GM, Chrysler, Ford, Toyota, Mazda. Hyundai, Kia, AMC, Jeep, etc…",
        "Multifunctional: Different kinds of door panel removal tools are available for you, excellent for Automotive, Marine, Furniture or Aircraft Trim removal and installation, including Door Panels, Moldings, Window Trims, Clips, Fasteners, Emblems, Panels, Radios, etc...",
        "Upgraded Material: Made of impacted resistant nylon fiber material with high-level craftsmanship, it’s non-toxic and durable, would be an excellent choice for you",
        "Easy Storage: Come with a portable bag helps you carry all kits and is less prone to loosing, would greatly save your time and space",
        "Package Include: 238Pcs Trim Removal Tool"
      ],
      "description": "GOOACC 238Pcs Trim Removal Tool, Auto Push Pin Bumper Retainer Clip Set Fastener Terminal Remover Tool Adhesive Cable Clips Pry Kit Car Panel Radio Removal Auto Clip Pliers",
      "parentTitle": "GOOACC Trim Removal Tool",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Camco TastePURE RV Water Filter - New Advanced 6-Step Patent-Protected Filtration - Camping Essentials for Fresh Drinking Water - RV Inline Water Filter w/Flexible Hose Protector, Made in USA (40043)",
      "imagesCSV": "51YyyNTSDHL.jpg,812JOi6w00L.jpg,919AT7PY14L.jpg,819CDZA5aYL.jpg,81Jp6llv5yL.jpg,91jBeocBH2L.jpg,91E9kN3UM-L.jpg,910IFruCj0L.jpg",
      "manufacturer": "Camco",
      "asin": "B0CYN45SQP",
      "brand": "Camco",
      "features": [
        "The information below is per-pack only",
        "6-Step Water Filtration System: Filter hose washer, pre-filtration layer for debris, premium activated carbon filter, superior KDF formulation protecting against bacteria, a post-filtration layer, and spun polypropylene for 20-micron particle removal.",
        "Superior Filtration Standard: Boost your water's purity with Granular Activated Carbon and Kinetic Degradation Fluxion (KDF). More than just odor and taste; our water filters are bacteriostatic and remove sediment, ensuring cleaner water for consumption.",
        "Versatile and Essential: An indispensable tool for camping and a must-have among boat accessories. Ensure clean water wherever you go, making it a top choice for your camping accessories and a vital component in your list of travel must haves.",
        "Top Industry Certifications: Our water filter system surpasses industry standards with top-tier certifications. Certified lead-free, it uses KDF/Carbon media for bacteria protection and meets NSF/ANSI standards for chlorine and health-effect contaminant reduction.",
        "Proud American Quality: Made in the USA, our RV water filters showcase superior craftsmanship. Every Camco RV filter boasts a robust carbon core, ensuring reliable water filtration for your travels. Travel with confidence and a clear conscience."
      ],
      "description": "Camco TastePURE KDF/Carbon RV Water Filter: Experience pure hydration on the go with our freshwater travel accessories!\nQuench your thirst with confidence wherever adventure takes you. Camco's drinking water filter ensures every sip of water is sparkling clean. It's a reliable travel essential, delivering filtered water wherever your adventures take you.\n\nPure, Filtered Water On-the-Go\nCamco’s RV & Camping Water Filter provides robust reduction of a spectrum of contaminants, including aluminum, cadmium, chlorine, fungus, heavy metals, hydrogen sulfide, iron, lead, mercury, mold, odor, turbidity, and sediment. Just connect your Camco Water Filter to your RV water hose — your tastebuds will thank you for the taste of pure, filter water on your travels.\n\nTruly Enjoy the Outdoors with Camco Water Filters for RV & Campers\nEmbrace the freshness of nature in every drop; the TastePURE portable water filter is a testament to Camco's dedication to quality. Built to last and made in USA, our Camco Filter is one of the most important camper essentials, providing superior water filtration so that the in line water filter is the last thing you'll need to stress about. Savor the freshwater, unblemished by sediments or odors, as you unwind outside your RV.\n\nGear Up for the Ultimate Road Trip with Camco TastePURE Camper/RV Water Filter\nHit the road prepared with Camco's TastePURE RV Water Filter system — essential Camco RV accessories for outside. Perfect for your travel trailer accessories checklist, this Camco RV water filter camping companion fits seamlessly into your camping gear, not just ensuring filtered water readiness but also enhancing your RV lifestyle continually.\n\nAbout us\nAt Camco Manufacturing, we pour heart into crafting premium RV and outdoor gear. Enhancing your adventures with quality, innovation, and the joy of unforgettable journeys.",
      "parentTitle": "Camco TastePURE RV Water Filter, First Stage of Water Filtration/RV Inline Water Filter",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Drift Car Air Freshener - Wood Fragrance - Automotive Odor Eliminator - Car Fresheners Long Lasting - Open Air Scent Refill - Pack of 3 - NO CLIP INCLUDED",
      "imagesCSV": "81TYf03obTL.jpg,41c-P9w6cHL.jpg,81SwkEB4iQL.jpg,71b8GpYWOTL.jpg,81nzlLf9YRL.jpg,81WjO6ensIL.jpg,71MDBvzTgaL.jpg",
      "manufacturer": "drift",
      "asin": "B0D463HXK5",
      "brand": "drift",
      "features": [
        "WOOD CAR FRESHENERS: Drift car air fresheners are made to uproot your typical air freshener. We've combined sophisticated, functional design with real, designer and luxury grade scents.",
        "MADE IN THE USA: Our wood freshener is made right here in the USA from sustainably sourced wood, and magnetized to fit perfectly on your car visor with our metal clip. Our Open Air scent has notes of fresh air, crisp linen, morning dew.",
        "LONG LASTING: Crafted with our natural essential and fragrance oil blends to deliver a great scent free of harmful chemicals all day. Looks good, smells good, all good.",
        "SIMPLE DESIGN: Attach metal clip to visor so the ledge faces down when closed. Open one side of bag until scent dissipates and freshener doesn't have any visible oil on surface. Attach the scent block to the clip, it will magnetically snap in, make sure there is no overhang on either side of the clip.",
        "REFILLABLE SCENTS: Keep scent sealed in bag and out of the sun until ready for use. Replace the scent block at minimum every 30 days. Do not use on any other surface than provided metal visor clip."
      ],
      "description": "meet wood, made to uproot your typical air freshener. we've combined sophisticated, functional design with real, designer grade scents. our wood freshener is made right here in the usa from sustainably sourced wood, and magnetized to fit perfectly on your visor with our metal clip. soaked in our drift essential fragrance oil blends to deliver a great scent free of harmful chemicals. looks good, smells good, all good.",
      "parentTitle": "Wood Air Freshener Refill - Variety Pack",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Rain-X 5079282-2 Latitude 2-In-1 Water Repellent Wiper Blades, 28 Inch Windshield Wipers (Pack Of 1), Automotive Replacement Windshield Wiper Blades With Patented Repellency Formula",
      "imagesCSV": "61w6uyAmoBL.jpg,51bQLtb4t0L.jpg,41X+HLNVrdL.jpg,51FhqQwlMCL.jpg,81WKAQHaJhL.jpg,81q1Hl6lktL.jpg,811c-mRtGSL.jpg,81PEaNARB-L.jpg,610tWwkDEOL.jpg,41hpjGqXuGL.jpg",
      "manufacturer": "Rain-X",
      "asin": "B016NAA0J6",
      "brand": "Rain-X",
      "features": [
        "Patented Water Repellent Formula - This 2-In-1 Wiper Blade Plus Rain Repellent Applies Patented Rain X Water Repellent Directly To Your Windshield, Both Clearing And Repelling The Elements",
        "Superior Driving Visibility And Safety - Watch Water Magically Bead Up And Roll Off Your Windshield While You Drive, Providing You With Superior All-Weather Driving Visibility, Safety, And Comfort",
        "Easy Installation And Universal Fit - The Rain-X Universal Adapter Is Easy To Use And Fits 96% Of Vehicles. Scan The QR Code On The Back Of The Package For Installation Videos",
        "Advanced Beam Wiper Blade Technology - Provides Uniform Pressure Points Along The Length Of The Blade, Allowing It To Hug The Curvature Of The Windshield For A Smooth, Clean Wipe",
        "Ultimate All-Weather Performance - Designed To Clear Your Windshield In Extreme Weather Conditions, Such As Ice, Snow, And Sleet Delivering Longer-Lasting, Superior Wipe Performance",
        "DISCLAIMER: Please remove the yellow squeegee cover after installation to ensure optimal performance. Failure to do so will prevent the wiper blades from working properly."
      ],
      "description": "Outsmart the Elements with Rain-X! No other wipers deliver the innovation and technology that is offered by Rain-X Latitude Water Repellency Wiper Blades. These unique blades apply a patented Rain-X water repellent directly onto your windshield for you. The repellent is transferred from the squeegee to the glass – and the magic of Rain-X is activated! Rain-X Latitude Water Repellency Wiper Blades feature advanced beam technology designed to hug your windshield for maximum contact and superior wipe quality. These 2-in-1 wiper blades both clear and repel the elements to provide superior driving visibility. Compared to traditional wiper blades, the difference is amazing! For optimal water repellency activation, run your wiper blades on a clean, dry windshield for 2 minutes. Once activated, the water repelling action will last for months! If you need additional help with determining the right wiper blade size for your car, reference our Blade Finder or Amazon's Confirmed Fit program. If you need help with installing your new wiper blades, installation videos can be found by scanning the QR code on the back of your wiper blade’s packaging.",
      "parentTitle": "Rain-X Wiper Blades",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Mobil 1 Extended Performance Full Synthetic Motor Oil 5W-30, 5 Quart (Pack of 2)",
      "imagesCSV": "51bKViLaxWL.jpg,41AN6Qhq-yL.jpg,71Lk-AGboKL.jpg,71cDuWQcnWL.jpg,71vsiUAsyDL.jpg,71V7lX04s6L.jpg,71XQifiDXTL.jpg,718XoFwUmKL.jpg,61vRbSB9qjL.jpg",
      "manufacturer": "Mobil 1",
      "asin": "B0CXQ1H9WH",
      "brand": "Mobil",
      "features": [
        "The information below is per-pack only",
        "Mobil 1 Extended Performance full-synthetic motor oil 5W-30 helps protect critical engine parts for up to 20,000 miles between oil changes,* controlling oxidation to prevent oil breakdown and maintaining excellent viscosity.",
        "Utilizes Mobil 1’s Triple Action+ Formula to combine outstanding engine performance, protection, and cleanliness with the added benefit of power",
        "Meets ILSAC GF-6 standards to help provide low-speed pre-ignition (LSPI) and timing chain wear protection while keeping your engine clean and helping to improve your fuel economy",
        "Helps extend engine life by working to prevent damaging deposits and sludge buildup",
        "Provides excellent internal engine heat protection (up to 500 degrees F) and low temperature protection (to -40 degrees F)"
      ],
      "description": "If you trust your vehicle to be there for you, you need to be there for its engine—with Mobil 1 Extended Performance full-synthetic motor oil 5W-30. Our ultimate full-synthetic motor oil meets or exceeds the industry’s toughest standards to help you get the most from your engine for up to 20,000 miles between oil changes—guaranteed.* Mobil 1 Extended Performance utilizes Mobil 1’s Triple Action+ Formula to combine outstanding engine performance, protection, and cleanliness with the added benefit of maximized engine power. Specialty components in synthetic oil reduce friction, helping to prevent and remove sludge buildup in just one oil change. This technologically advanced formulation provides 20X better** internal engine heat protection than industry standards (up to 500 degrees Fahrenheit) as well as excellent low-temperature protection (to -40 degrees Fahrenheit)—bringing quick cold-weather starting and ultra-fast protection to your engine. Mobil 1 Extended Performance meets ILSAC GF-6 standards to help provide low-speed pre-ignition (LSPI) and timing chain wear protection while keeping your engine clean and helping to improve your fuel economy. Mobil 1 Extended Performance full-synthetic motor oil 5W-30 also helps control oxidation to prevent oil breakdown. This cutting-edge formula is recommended by ExxonMobil for all types of modern vehicles, including high-performance, turbo-charged, and supercharged gasoline and diesel multi-valve fuel-injected engines found in passenger cars, SUVs, light vans, and light trucks. Mobil 1 is America’s #1 synthetic motor oil brand at retail,*** trusted and recommended by car builders and experienced mechanics, and is the Official Motor Oil of NASCAR®. (*Protects for up to 20,000 miles or 1 year, whichever comes first. To learn more about the Mobil 1 Limited Warranty, visit Mobil.US. **Based on Seq IIIH vs industry limits. ***Source: The NPD Group/ Retail Tracking Service/ Dollar Sales/ PCMO full-synthetic/ 52 weeks ending September 30, 2023)",
      "parentTitle": "Mobil 1 Extended Performance Full Synthetic Motor Oil",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "USANOOKS Microfiber Cleaning Cloth - Turq - 12Pcs (12.5x12.5 inch) High Performance - 1200 Washes, Ultra Absorbent Car Towel Traps Grime & Liquid for Streak-Free Mirror Shine - car Washing Cloth",
      "imagesCSV": "916oU5v8omS.jpg,61r424cJ+FL.jpg,919EE3CY5dL.jpg,91halmREKfL.jpg,9128XzflaUL.jpg,913UeDhZbfL.jpg,91LOZTkW0aL.jpg",
      "manufacturer": "USANOOKS",
      "asin": "B08BRB6K9N",
      "brand": "USANOOKS",
      "features": [
        "10x GRIP-ROOT WEAVE - TRAP MORE, WORK LESS: Ultra-absorbent kitchen towels Grip Root weave works like PLANT ROOT FOLLICLES, sucking up & LOCKING AWAY 8x to 10x its weight in liquid, particulates, moisture, grime and dirt in far LESS TIME than traditional ‘Heavy Duty’ Cleaning Rags.",
        "PERFORMANCE OPTIMIZED - WON’T LINT, SCRATCH, PILL, SWIRL, SHED or BLEED like a thin, cheaply made microfiber towels for cars. RAPID DRY release layers make these the ideal microfiber towels for cars, creating that spectacular, SWIRL FREE MIRROR SHINE with our cleaning rags.",
        "LASTS 1200+ WASHES - That’s 3.27 YEARS worth of use in this 12 pack of COMMERCIAL GRADE 300 GSM microfiber towels. OVERLOCK BRAIDED STITCHING make the ideal SUSTAINABLE SOLUTION for cleaning every SURFACE, CRACK & CREVICE in your home, garage or office. MACHINE WASHABLE, Tumble Dry.",
        "SOAK IT UP FASTER - 4X’s MORE ABSORBENT than COTTON cloths, these are the microfiber cleaning cloth for cars to get if you want an ALL PURPOSE cleaning towels that scoops up your messes, oils and liquids FASTER than a SPONGE, more SANITARILY than your mop and with ZERO DANGEROUS WET SPOTS like your WET VAC.",
        "UNRIVALED POWER - TEST THIS GRIP-ROOT technology risk free for 30 full days. Love how it LOCKS AWAY dirt, dust, grime, spills and messes better than any other high performance cleaning rags you’ve tried, for a mirror shine finish. No hassle, gimmicks or questions asked."
      ],
      "description": "N/A",
      "parentTitle": "USANOOKS Microfiber Cleaning Cloth - 12Pcs (12.5x12.5 inch) High Performance - 1200 Washes, Ultra Absorbent Car Towel Traps Grime & Liquid for Streak-Free Mirror Shine, Washing Cloth and Applicator",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "EcoNour Windshield Sun Shade for Tesla Model 3/Y Cars (2016-2025) - Foldable Sun Shield - Upgraded Windshield Fits for Both Tesla Model Y Sunshade and Tesla Model 3 Sunshade",
      "imagesCSV": "71BHsSPLwhL.jpg,81keosED3GL.jpg,81n3fm31pqL.jpg,81mQG+oeSKL.jpg,71m+BdtD6TL.jpg,814TQvberaL.jpg,71qZ+IgChoL.jpg",
      "manufacturer": "EcoNour",
      "asin": "B08RJSWRDV",
      "brand": "EcoNour",
      "features": [
        "Double Layer Light Blocking Fabric: Enjoy enhanced insulation and coverage with our Tesla car window shades featuring two layers of premium light-blocking fabric. This sunshade effectively reduces heat buildup, ensuring a cooler and more comfortable interior even on the hottest days.",
        "Perfect Fit for Tesla Models: Specifically designed for Tesla Model 3 sunshade and Tesla Model Y sunshade, EcoNour’s tailored design offers a snug fit with its shape memory frame, outperforming generic sunshades for improved coverage.",
        "Durable Reflective 240T Material: Crafted from robust 240T polyester fabric with reinforced flexible wire, our Tesla sunshade design withstands frequent folding and usage. This durable material ensures long-lasting coverage for your Tesla’s interior.",
        "Complimentary Storage Pouch: Each Tesla car windshield sun shade includes a free storage pouch for easy and compact storage in your trunk or under your seat, ensuring your sunshade is always within reach.",
        "Preserves Your Tesla Interior: Maintain your Tesla's dashboard, seats, and interior accessories with our premium sunshade. It helps reduce fading, cracks, and wear caused by prolonged sun exposure, keeping your vehicle looking fresh."
      ],
      "description": "N/A",
      "parentTitle": "EcoNour Car Circle Sun Shade",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "GOOACC 238Pcs Trim Removal Tool, Auto Push Pin Bumper Retainer Clip Set Fastener Terminal Remover Tool Adhesive Cable Clips Pry Kit Car Panel Radio Removal Auto Clip Pliers (GRC-207)",
      "imagesCSV": "71O8fn6WZ2L.jpg,61UScVqyGKL.jpg,71hVI46I5aL.jpg,71dpFkhw8XL.jpg,71sQWNxMNFL.jpg,71gsc-19mTL.jpg,716RgQQwpKL.jpg,71ZfNwsxwBL.jpg,817AXUPbEGL.jpg",
      "manufacturer": "GOOACC",
      "asin": "B0BLCH1HZL",
      "brand": "GOOACC",
      "features": [
        "12 Most Popular Sizes : There are 12 most common sizes of clips which will meet your needs, sturdy and reusable, compatible for GM, Chrysler, Ford, Toyota, Mazda. Hyundai, Kia, AMC, Jeep, etc…",
        "Multifunctional: Different kinds of door panel removal tools are available for you, excellent for Automotive, Marine, Furniture or Aircraft Trim removal and installation, including Door Panels, Moldings, Window Trims, Clips, Fasteners, Emblems, Panels, Radios, etc...",
        "Upgraded Material: Made of impacted resistant nylon fiber material with high-level craftsmanship, it’s non-toxic and durable, would be an excellent choice for you",
        "Easy Storage: Come with a portable bag helps you carry all kits and is less prone to loosing, would greatly save your time and space",
        "Package Include: 238Pcs Trim Removal Tool"
      ],
      "description": "GOOACC 238Pcs Trim Removal Tool, Auto Push Pin Bumper Retainer Clip Set Fastener Terminal Remover Tool Adhesive Cable Clips Pry Kit Car Panel Radio Removal Auto Clip Pliers",
      "parentTitle": "GOOACC Trim Removal Tool",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "All-Purpose Stainless Steel Shower Squeegee for Shower Glass Door with 2 Adhesive Hooks, Bathroom Cleaner Tool Household Window Mirror Squeegee , Cleaning Tile Wall, Car, 10 Inch Silver",
      "imagesCSV": "5102UAfkhjL.jpg,61EdUp+RaJL.jpg,814rGbdtbBL.jpg,812LuNAieGL.jpg,81Rrv0whUfL.jpg,713ESq7x86L.jpg,71u+lwK2gOL.jpg",
      "manufacturer": "Docrok",
      "asin": "B0BZZDPPRX",
      "brand": "Docrok",
      "features": [
        "【Streak Free & Squeak Free】: Docrok squeegee for shower glass door will effortless remove the water drops, soap scum and other sources of buildup of your shower glass door cleaner and other surfaces with just a few wipes. Getting your cleaning activities done fast and easy with no streak and squeak.",
        "【Sturdy & Durable】: Made of 100% rust-resistant stainless steel and premium silicon blade, our shower squeegeee, shower door squiggy with exquisite craft ensure the durability and long lasting use for your daily household cleaning activities. A must have window squeegee for window cleaning, bathroom squeegee for shower glass doors.",
        "【Ergonomic Design】: Features an ergonomic structure and precise cut silicone blade, this shower glass squeegee car squeegee provides you a comfortable anti-slip grip to efficiently clean your tile show walls with minimum time and effort.",
        "【All-Purpose Squeegee】: This all-purpose squeegee is great for shower glass doors, tile shower walls, car windows, mirrors and any other smooth and flat surfaces. A must have cleaning tool for indoor and outdoor use.",
        "【Easy Storage & Use】: Comes with 2 kinds of waterproof adhesive hooks which can be attached to any smooth surface, you can hang the squeegee on the shower walls, kitchen and any other places for easy reach and use."
      ],
      "description": "N/A",
      "parentTitle": "All-Purpose Stainless Steel Shower Squeegee for Shower Doors with 2 Adhesive Hooks",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Rain-X RX30213 WeatherBeater Wiper Blades, 13\" Windshield Wipers (Pack Of 1), Automotive Replacement Windshield Wiper Blades That Meet Or Exceed OEM Quality And Durability Standards",
      "imagesCSV": "61QOuh9AT0L.jpg,21Vxt0Az4yL.jpg,41BwiQy3YFL.jpg,813WSZTjn7L.jpg,61lukNzAewL.jpg,51s94K8PupL.jpg,51FrXesWilL.jpg,51ZMUNXZ8XL.jpg,516GkXvbmHL.jpg",
      "manufacturer": "Rain-X",
      "asin": "B000F4D076",
      "brand": "Rain-X",
      "features": [
        "Over 15 Years Of Trusted Quality - Conventional wiper blades that have stood the test of time, meeting or exceeding all original equipment manufacturers' standards for quality and durability",
        "Ease Of Installation - Comes equipped with a pre-installed multi-adapter for easy installation on most vehicles that require different wiper blade arm types",
        "All Natural Rubber Squeegee - Resists cracking, splitting, and tearing caused by various hot and cold weather conditions, windshield wiper fluid, and road salt",
        "Traditional Blade Structure - Built with a galvanized steel frame that provides long-lasting strength and durability and prevents rust and corrosion",
        "Improved Driving Visibility And Safety - Multiple pressure points and embedded friction reducers enable even pressure distribution across the length of the blade helping to deliver a clean wipe",
        "Enter vehicle Type, Year, Make, and Model into \"Amazon confirmed fit\" above to ensure compatibility - due to wiper arm variations, it is no longer possible to choose replacement wiper blades by length only"
      ],
      "description": "Rain-X, a recognized and respected name in wiper blades for almost 20 years, is committed to providing you with the confidence of improved driving visibility. For over 15 years, Rain-X WeatherBeater (the original WeatherBeater wiper blade) is still known and trusted for its quality, durability, and value. WeatherBeater has been designed to be a high-quality traditional wiper blade that meets or exceeds all original equipment manufacturers' standards for quality, durability, and construction. This conventional blade features a natural rubber squeegee, a classic galvanized steel frame, multiple pressure points, and embedded friction reducers. The natural rubber squeegee provides resistance to cracking and splitting caused by weather, windshield wiper fluid, and road salt. The galvanized steel frame provides long-lasting strength and durability while also preventing rust and corrosion. Multiple pressure points and embedded friction reducers enable even pressure distribution across the length of the blade and help provide a clean wipe. If you need additional help with determining the right wiper blade size for your car, reference our Blade Finder or Amazon's Confirmed Fit program. If you need help with installing your new wiper blades, installation videos can be found by scanning the QR code on the back of your wiper blade’s packaging.",
      "parentTitle": "Rain-X 820250 WeatherBeater Wiper Blades",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Camco Tastepure Sediment Pre-Filter for RV Water Filter - Features 20-Micron Water Filter System & Provides First Stage of Water Filtration - Extends The Life of Inline Water Filters (40048)",
      "imagesCSV": "71eTcAWPBmL.jpg,81EtWVzBdbL.jpg,81O99FfLsSL.jpg,8123W9vwkRL.jpg,81TeNXsfQ4L.jpg,91OwuVoWLdL.jpg",
      "manufacturer": "CAMCO MANUFACTURING INC",
      "asin": "B0BXBKHCBK",
      "brand": "Camco",
      "features": [
        "First Line of Defense: Enjoy cleaner water on every adventure! The Camco Tastepure RV Sediment Pre-Filter safeguards your RV water filter system by effectively trapping dirt, silt, sand, and debris for superior filtration performance.",
        "Precise 20-Micron Filtration: Captures particles larger than 20-microns, improving water quality and ensuring a reliable, long-lasting RV water filtration system.",
        "Extends Filter Life: The pre-filter protects your inline water filter for camping by trapping dirt and debris, reducing clogs, & boosting efficiency. This helps your camping water filter last longer and perform at its peak.",
        "Compatibility: This RV accessory easily fits Camco standard water filters for RVing and other standard inline RV water filter models, providing flexible setup options for your drinking water filter. The pre-filter does not fit the XL water filters.",
        "Space-Saving Convenience: With its lightweight design, the pre-filter fits effortlessly into your camping gear, making it perfect for limited RV storage.",
        "Reliable Performance: Built to last, this durable single-use pre-filter is designed to match the full lifespan of your inline RV drinking water filter.",
        "Certified Lead-Free: This camper accessory is independently tested & listed to standards NSF/ANSI 42. It’s CSA lead-free content certified to NSF/ANSI 372 & compliant with all federal & state-level lead-free laws."
      ],
      "description": "Take your water filtration to the next level with the Camco Tastepure RV Sediment Pre-Filter. This essential camping gear is your fresh water system’s first line of defense, expertly capturing dirt, silt, sand, and debris. Equipped with 20-micron filtration, it prevents clogs and extends the lifespan of your in line water filter, ensuring clean and dependable water throughout your adventures. Designed for versatility, this camping essential effortlessly works with Camco standard camping water filters as well as other standard hose filter brands. Built to last as long as your inline RV water filter, this pre-filter delivers performance you can trust. Its compact, space-saving design fits perfectly in RV storage, making it as practical as it is effective. Upgrade your filtration setup with the Camco Tastepure Sediment Pre-Filter. Enjoy cleaner water, fewer clogs, and peace of mind on every trip. Add it to your camping supplies today!",
      "parentTitle": "Camco TastePURE RV Water Filter, First Stage of Water Filtration/RV Inline Water Filter",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Amazon Basics Microfiber Cleaning Cloths, Ultra Absorbent, Lint Free, Streak Free, Non-Abrasive, Reusable and Washable, 16\" x 12\", Blue/White/Yellow, Pack of 24",
      "imagesCSV": "91WjG1lqmLL.jpg,71tJ4-NhnnL.jpg,81zroTORvPL.jpg,71BbEHDMGzL.jpg,51C38skuUaL.jpg,41IFWC47NAL.jpg",
      "manufacturer": "Amazon",
      "asin": "B009FUF6DM",
      "brand": "Amazon Basics",
      "features": [
        "Microfiber 16 x 12-inch cleaning cloth (24-pack); ideal for cleaning cars, trucks, boats, and more",
        "Ultra-soft and non-abrasive car drying towels; will not scratch paints, vinyl, glass, finishes, or other surfaces",
        "Effectively cleans either dry or with liquid cleaners for streak-free results and a lint-free shine",
        "Durable and absorbent; soak up 8 times their own weight",
        "Can be reused hundreds of times",
        "Machine washable for easy care",
        "Wash separately before first use. Wash with like colors"
      ],
      "description": "Product Description\n\nAmazon Basics Microfiber Cleaning Cloths, Non-Abrasive, Reusable and Washable - Pack of 24, 12 x16-Inch, Blue, White and Yellow\n\nFrom the Manufacturer\n\nAmazon Basics",
      "parentTitle": "Amazon Basics Cleaning Cloths Microfiber Solid Rectangular Towel",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "CERAKOTE® Ceramic Headlight Restoration Professional Detailer Pack (50 Step 1 Oxidation Removing Wipes) - Easily Remove Oxidation from Old and Faded Headlights",
      "imagesCSV": "610WExxLsnL.jpg,61LLF2Mb7lL.jpg,71ueFZWYYsL.jpg,71I-IqvIXjL.jpg,71YYvt47CsL.jpg,717pvL78qqL.jpg,7179G4SklxL.jpg",
      "manufacturer": "CERAKOTE",
      "asin": "B08DDJ49X7",
      "brand": "CERAKOTE",
      "features": [
        "BY POPULAR DEMAND! - The Cerakote Headlight Step 1 Professional Detailer Pack was designed by popular demand for detailing professionals and car lots that need quick and easy access to multiple headlight restoration applications.",
        "REVIVE OLD HEADLIGHTS - Our industry leading technology removes hard stuck oxidation from your vehicle's old and faded headlights to provide a fresh surface for coating prep and application.",
        "QUICK AND EASY - Removing oxidation has never been easier, as the removal process takes only minutes and doesn't require any power tools!",
        "CONTENTS - Each kit comes with 50 of our Step 1 Oxidation Remover Wipes, which is enough wipes for 6+ vehicles worth of oxidation removal. This kit does not include any sanding materials or Step 3 Ceramic wipes."
      ],
      "description": "N/A",
      "parentTitle": "CERAKOTE Ceramic Headlight Restoration Kit",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "ANCEL AD310 Classic Enhanced Universal OBD II Scanner Car Engine Fault Code Reader CAN Diagnostic Scan Tool, Read and Clear Error Codes for 1996 or Newer OBD2 Protocol Vehicle (Black)",
      "imagesCSV": "61KElcCN4BL.jpg,71qAu3yHMXL.jpg,71PX-eqLqEL.jpg,71xTvCkpQ0L.jpg,717IL5Df7sL.jpg,71PF-FbdHGL.jpg,61dzsd365SL.jpg,616J2qVXR8L.jpg",
      "manufacturer": "ANCEL",
      "asin": "B01G5EA74I",
      "brand": "ANCEL",
      "features": [
        "CEL Doctor: The ANCEL AD310 is one of the best-selling OBD II scanners on the market and is recommended by Scotty Kilmer, a YouTuber and auto mechanic. It can easily determine the cause of the check engine light coming on, quickly read and clear diagnostic trouble codes, read live data & hard memory data, view freeze frame, I/M monitor readiness and collect vehicle information. Instead of taking car to mechanic shop, you can use it to check the trouble code and show code definition by yourself.",
        "Sturdy and Compact: Equipped with a 2.5 foot cable made of very thick, flexible insulation. It is important to have a sturdy scanner as it can easily fall to the ground when working in a car. The AD310 OBD2 scanner is a well-constructed mechanic tool with a sleek design. It weighs 12 ounces and measures 8.9 x 6.9 x 1.4 inches. Thanks to its compact design and light weight, transporting the device is not a problem. The buttons are clearly labelled and the screen is large and displays results clearly.",
        "Accurate Fast and Easy to Use: The AD310 scanner can help you or your mechanic understand if your car is in good condition, provides exceptionally accurate and fast results, reads and clears engine trouble codes in seconds. If you want to find out the cause of the check engine light, this device will let you know immediately and fix the problem right away without any car knowledge. No need for batteries or a charger, get power directly from the OBDII Data Link Connector in your vehicle.",
        "OBDII Protocols and Car Compatibility: Many cheap scan tools do not really support all OBD2 protocols. This is not the case with the AD310 scanner as it can support all OBDII protocols such as KWP2000, J1850 VPW, ISO9141, J1850 PWM and CAN. This device also has extensive vehicle compatibility with 1996 US-based, 2000 EU-based and Asian cars, light trucks, SUVs, as well as newer OBD2 and CAN vehicles both domestic and foreign. Check compatibility with your vehicle model before purchasing.",
        "Home Necessity and Worthy to Own: This is an excellent code reader to travel or home with as it weighs less and it is compact in design. You can easily slide it in your backpack as you head to the garage, or put it on the dashboard, this will be a great fit for you. The AD310 is not only portable, but also accurate and fast in performance. Moreover, it covers various car brands and is suitable for people who just need a code reader to check their car."
      ],
      "description": "N/A",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "NOCO Boost Plus GB40 1000A UltraSafe Car Battery Jump Starter, 12V Jump Starter Battery Pack, Battery Booster, Jump Box, Portable Charger and Jumper Cables for 6.0L Gasoline and 3.0L Diesel Engines",
      "imagesCSV": "71hJgp07X1L.jpg,91PF8cxu2ML.jpg,71ept54vL6L.jpg,71QO5lSXHEL.jpg,91Cwo91tl6L.jpg,81aMeMPr4IL.jpg",
      "manufacturer": "NOCO",
      "asin": "B015TKUPIC",
      "brand": "NOCO",
      "features": [
        "Start Dead Batteries - Safely jump start a dead battery in seconds with this compact, yet powerful, 1000-amp lithium battery jump starter - up to 20 jump starts on a single charge - and rated for gasoline engines up to 6.0-liters and diesel engines up to 3.0-liters.",
        "UltraSafe - Safe and easy-to-use car jumper starter and jump pack without worrying about incorrect connections or sparks. Safely connect to any 12-volt vehicle with our mistake-proof design featuring spark-proof technology and reverse polarity protection.",
        "Multi-Function - It's a car jump starter, portable power bank, and LED flashlight. Recharge smartphones, tablets, and other USB-C devices. It's easily rechargeable from any powered USB-C port in 3-hours at 2.1-amps. Plus, an integrated 100-lumen LED flashlight with seven light modes, including emergency strobe and SOS.",
        "Advanced Design - Our most advanced car battery charger jump starter ever. Featuring high-discharge lithium technology for safe operation in any climate. A rugged and water-resistant enclosure rated at IP65. A rubberized over-molded casing to prevent scratching or marring of surfaces. And an ultra-compact and lightweight design weighing just 2.5 lb.",
        "In The Box - GB40 UltraSafe Portable Car Jump Starter, Heavy Duty Booster Clamps, USB-C Charging Cable, Microfiber Storage Bag, 1-Year Warranty, and Designed in the USA."
      ],
      "description": "The GB40 is a portable, lightweight, and compact lithium-ion car battery charger jump starter pack for 12-volt batteries. With it, you can safely jump start a dead battery in seconds - up to 20 times on a single charge. It's a mistake-proof battery jumper starter and battery booster pack, making it safe for anyone to use, and it features spark-proof technology and reverse polarity protection. The GB40 is a battery jump pack with an integrated high-output 100-lumen LED flashlight with seven light modes - low, medium, high, flashing, strobe, and emergency SOS. It holds its charge for up to one year without being recharged. An internal battery pack can recharge any personal mobile device, like smartphones, tablets, or other USB devices, or be recharged by any powered USB port. It's rated at 1,000-amps and suitable for gasoline engines up to 6.0-liters and diesel engines up to 3.0-liters, such as cars, automobiles, motorcycles, ATVs, boats, trucks, RVs, SUVs, lawnmowers, and more.\n\nEn español (ES): El GB40 es un cargador de batería de iones de litio para automóvil portátil, liviano y compacto para baterías de 12 voltios. Con él, puede arrancar con seguridad una batería agotada en segundos, hasta 20 veces con una sola carga. Es un arrancador de batería a prueba de errores y un paquete de refuerzo de batería, lo que lo hace seguro para que cualquiera lo use, y cuenta con tecnología a prueba de chispas y protección contra polaridad inversa. El GB40 es un paquete de batería con una linterna LED integrada de alto rendimiento de 100 lúmenes con siete modos de luz: bajo, medio, alto, intermitente, estroboscópico y SOS de emergencia. Mantiene su carga hasta por un año sin ser recargada. Un paquete de batería interno puede recargar cualquier dispositivo móvil personal, como teléfonos inteligentes, tabletas u otros dispositivos USB, o recargarse mediante cualquier puerto USB con alimentación. Tiene una capacidad nominal de 1000 amperios y es adecuado para motores de gasolina de hasta 6,0 litros y motores diésel de hasta 3,0 litros, como automóviles, motocicletas, vehículos todo terreno, barcos, camiones, vehículos recreativos, vehículos deportivos utilitarios (SUV), cortadoras de césped y más.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "AstroAI Tire Inflator Portable Air Compressor Tire Air Pump for Car Tires - Car Accessories, 12V DC Auto Pump with Digital Pressure Gauge, Emergency LED Light for Bicycle, Balloons, Orange",
      "imagesCSV": "71BqK44un9L.jpg,81-w5+iKalL.jpg,81bnJAsTGtL.jpg,81qmes658RL.jpg,81uyhEBXtNL.jpg,81uRGYXo+wL.jpg,712l0WDDkxL.jpg,81EcW00wP7L.jpg",
      "manufacturer": "AstroAI",
      "asin": "B08TWCJ2YN",
      "brand": "AstroAI",
      "features": [
        "TOUGHULTRA TECHNOLOGY, ENHANCED DURABILITY: This tire inflator is manufactured with AstroAI’s unique ToughUltra technology, so all of its core parts, including its cylinder, motor gears, and connection rod, are built using a powder metallurgy integrated molding technique. This revolutionary manufacturing process greatly enhances the inflator’s durability and increases its service life by 30%.",
        "PROGRAMMABLE INFLATION: Use the \"M\" button to set your desired pressure unit, and then press the \"+\" and \"-\" buttons to set the desired pressure. The air compressor will automatically shut off when it reaches the pre-set pressure (Please make sure the pressure you set is higher than the current pressure of your tire).",
        "COMPACT SIZE & EASY TO STORE: Featuring a lightweight and compact design, this handy and portable tire inflator can easily fit into glove compartments, seats, trunks, and more. When it isn’t being used, it’s almost unnoticeable.",
        "SMART PRESET & AUTO OFF: The tire inflator’s digital screen provides accurate readouts and 4 pressure units to choose from while its independent buttons allow for intuitive control. You can easily preset the tire pressure and not worry about constantly monitoring it, this smart inflator will automatically shut off once it reaches the desired pressure.",
        "EASY NIGHTTIME USE: Equipped with a backlit screen and a flashlight, this tire inflator brings convenient use, even in dim environments. Its independent LED Button enables one-press flashlight operation. Great gifts for men and women."
      ],
      "description": "N/A",
      "parentTitle": "AstroAI Tire Inflator Portable Air Compressor Tire Air Pump for Car Tires - Car Accessories, 12V DC Auto Pump with Digital Pressure Gauge, Emergency LED Light for Bicycle, Balloons",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "PULIDIKI Car Cleaning Gel Car Clean Putty, Universal Car Interior Cleaner Slime, Perfect Cleaning Kit Supplies, Auto Detailing Tools Accessories, Dust Remover Gifts for Men Women",
      "imagesCSV": "71YLxhnPUxL.jpg,71BJRNrj8XL.jpg,814zYP2slHL.jpg,71mnjyH5UeL.jpg,71M-113WmYL.jpg,71uJQUi2grL.jpg,71a1fNMok6L.jpg",
      "manufacturer": "ANanCrog",
      "asin": "B081T7N948",
      "brand": "PULIDIKI",
      "features": [
        "PERFECT CAR CLEANING TOOL: PULIDIKI cleaning gel for car detailing is designed to clean car air vents, steering wheel, console panel, storage bins, cup holder, door handles, dashboard and other hard to reach places. Car slime for cleaning is car essentials for women and men to clean your car, it is great car cleaning supplies",
        "EASY TO USE: Push car cleaning gel into little cracks, press car cleaner slime on and the dust would be carried away. You can also press the car cleaning putty slightly on the keyboard surface and then pull out slowly, the dust would be picked up with the car putty cleaner (NOTE: don’t wash the universal cleaning gel with water)",
        "FRIENDLY TO CAR: Car gel cleaning putty is a high-tech cleaning compound gel for cars. Car goop cleaner is made from natural materials. The car cleaning kit can easily pick up dust. Cleaning putty for car interior is friendly to your car. The cute car accessories for women and men is car must haves for your car detailing",
        "REUSABLE: Car detailing putty auto cleaning gel can be used for multiple times until the car duster interior turns to black. Please put the car gel cleaner putty back in jar after use and store it in a cool dry place. DO NOT use car cleaning slime reusable to wipe the cellphone screen or computer monitor",
        "MULTIPLE USES: Automotive dust cleaning gel can not only clean car nooks and crannies, but also for home and office use, cleaning putty for electronics, computer keyboard, laptops, cell phone, calculator, TV remote and furniture. The suitable surface must be water resistant, or the dust removal for car would stick to it",
        "Brand New Package：All PULIDIKI cleaning gel are sold brand new. If you find the package is opened or damaged, the car putty dirty or any other issues when you receive the cleaning car gel, please message us immediately and we will solve your problem as soon as possible",
        "Best stocking stuffers for men and women: The car accessories for men and women is car essentials for car decor. The cool stuff is perfect Christmas gifts for men, car necessities is great Christmas gifts for women. The stocking stuffers for women is also great white elephant gifts for adults funny. Car gadgets is ideal gifts for mom, gifts for dad, gifts for him and gifts for her."
      ],
      "description": "N/A",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Valvoline High Mileage with MaxLife Technology SAE 5W-20 Synthetic Blend Motor Oil 5 QT",
      "imagesCSV": "61gZJT-2uLL.jpg,41brDvYDmaL.jpg,61mJOkCc-bL.jpg,61G73PqBIRL.jpg,71QvST5yHKL.jpg,71-XL6hPCkL.jpg,71rRybWIl7L.jpg",
      "manufacturer": "Valvoline",
      "asin": "B00GZKC36I",
      "brand": "Valvoline",
      "features": [
        "MaxLife Technology prevents engine breakdown with 40% better wear protection than the industry standard",
        "Includes seal conditioners to reduce oil consumption and oil leaks in high mileage engines.",
        "Added detergents reduce sludge, corrosion, rust and deposits to help keep motors clean inside and ensure a smooth-running engine.",
        "Advanced friction-fighting additives help maximize performance and improve fuel efficiency.",
        "Meets or exceeds all requirements of ILSAC GF-6A, API SP, API SN with SN Plus, API SN",
        "American made and formulated, from the Original Motor Oil brand trusted for more than 150 years"
      ],
      "description": "Maybe you’re spending extra money to top off oil between changes. Or maybe you’re noticing oil leaks in your driveway. Either way, it’s an obvious sign your vehicle needs a high mileage motor oil. If left untreated, the issues could eventually lead to engine breakdown. Other problems with aging engines may be less obvious but can still be just as harmful. After 75,000 miles, your vehicle deserves Valvoline High Mileage Motor Oil with premium seal conditioners seal conditioners to rejuvenate aging seals and prevent oil leaks. Our synthetic blend formula and superior-quality additives protect against engine deposits, wear, friction and extreme heat, the four leading causes of engine failure. Plus, added detergents reduce sludge, corrosion and deposits. Toyota, Ford, Chevy, Dodge, Honda, Hyundai – cars, SUVs, trucks – no matter the make or model, Valvoline High Mileage with MaxLife Technology helps curb contaminants to keep high-mileage engines from burning and consuming oil. Valvoline Synthetic Blend High Mileage with MaxLife Technology, America’s first motor oil to specifically address the needs of higher mileage vehicles.",
      "parentTitle": "Stoner Car Care Wax",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Camco TST MAX RV Toilet Treatment Drop-INs - Control Unwanted Odors & Break Down Waste and Tissue - Safe Septic Tank Treatment - Lemon Scent - 30-Count (41577)",
      "imagesCSV": "71DpuW0N7gL.jpg,817W6uBVeEL.jpg,81RakIiQqcL.jpg,81-BzouKawL.jpg,81BRVgeZ5fL.jpg",
      "manufacturer": "Camco",
      "asin": "B07GZ2KN9P",
      "brand": "Camco",
      "features": [
        "Toilet Deodorizer with Reactive Odor-Eliminating Technology: Experience a powerful RV odor eliminator that stops RV black tank odors for up to 7 days. Just (1) toilet drop in treats camper toilets with up to a 40-gallon tank.",
        "Superior Formulation, Unmatched Performance: Get exceptional results with TST MAX RV tank treatments. The advanced chemistry is safe for septic systems.",
        "Powerful RV Black Tank Treatment: Eliminate clogs & odors in your camper/marine black water tank with TST MAX. This powerful solution breaks down waste & RV toilet paper, while also aiding in waste digestion for optimal sensor performance.",
        "Multi-Purpose: This RV accessory is great for boating, full-time/occasional camping, boondocking, & portable camping toilets. Be sure to have this camper must-have with the rest of your camping supplies.",
        "Made in the USA: Camco’s TST RV toilet chemicals are proudly made in the USA & trusted by RVers and boaters for their holding tank treatment needs.",
        "Refreshing Scent: Enjoy a pleasant, long-lasting lemon scent as you're RVing without worrying about septic tank odors ruining your experience.",
        "Quantity: Each bucket includes (30) Drop-INs."
      ],
      "description": "Keep your black tank fresh and clean with Camco's TST MAX Lemon Drop-INs. These Drop-INs are specially designed to eliminate odors, break down waste, and ensure top performance in RV and marine tanks. TST Max RV toilet pods are designed to be safe for your septic tank and the environment. The ultra-concentrated formula offers a sustainable solution for your toilet treatment needs. Convenient and powerful, each Drop-IN treats up to a 40-gallon tank for seven days of odor prevention with just one application. Trust Camco's USA-made TST MAX Lemon Drop-INs for a fresh and odor-free tank on all your travels.",
      "parentTitle": "Camco TST PRO RV Toilet Treatment Drop-INs - New & Innovative Bio-Enzymatic Formula for Rapid RV Sewer Break Down -",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Lamicall Bike Phone Holder, Motorcycle Phone Mount - Motorcycle Handlebar Cell Phone Clamp, Scooter Phone Clip for iPhone 14 Plus/Pro Max, 13 Pro Max, S9, S10 and More 4.7\" - 6.8\" Smartphone, Orange",
      "imagesCSV": "71Gz8o0bd6L.jpg,61rL7o9VjlL.jpg,71hZBJIHo1L.jpg,71-11EpNzJL.jpg,710UDLHGeIL.jpg,71cM23LGbSL.jpg,71K3JboFkWL.jpg",
      "manufacturer": "Lamicall",
      "asin": "B0CLL86Q4J",
      "brand": "Lamicall",
      "features": [
        "【 Sturdy and Safe】 A special shape of this motorcycle & bike phone holder grips each corner of your phone tightly. It ensures the safety of your cell phone attached to the bike handlebar even on a bumpy road. Phone clip must be locked by the red switch on the back so that phone doesn't fall off while riding!",
        "【 Shockproof Protection】 This bicycle accessories - adjustable bike phone mount comes with silicone pads that keep your phone from scratches and vibration. The motorcycle phone mount holds your phone perfectly when cycling.",
        "【 Wide Compatibility】 These universal bike accessories bike cell phone holder for 4.7 and 6.8 inches with thickness up to 15mm (including phone case), like iPhone 16, iPhone 16 Plus, iPhone 16 Pro, iPhone 16 Pro Max, iPhone 15, iPhone 15 Plus, iPhone 15 Pro, iPhone 15 Pro Max, iPhone 14 13 Pro Max, 12 Mini, Xs XR X 8 Plus 7 6s 6, Galaxy S10 + S10e S9 S8, Note 9, LG and other cell phones.",
        "【 Adjustable Features】 Easy to adjust the cellphone to horizontal or vertical screen. It is convenient to answer the phone, play music, GPS positioning during the riding.",
        "【 Easy Installation】 This motorcycle accessories - one hand operation motorcycle phone mount is easy to install without tool. The extra 4 silicone pads make your phone fit better with handlebar, can add or remove the silicone pad according to the diameter of handlebar. Suit well with various types of bicycles, motorcycles, stroller, shopping cart, electric scooter, indoor treadmill, indoor bike. Handlebar diameter: 0.59 - 1.57\" (15-40mm)"
      ],
      "description": "N/A",
      "parentTitle": "Lamicall Motorcycle and Bike Phone Mount for 4.7-6.8\" Phone",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Spearhead Odor Defense Breathe Easy AC & Heater Cabin Filter | Fits Various 2006-22 Audi/VW Like OEM | Up to 25% Longer Lasting w/Activated Carbon (BE-373)",
      "imagesCSV": "91ZIh-y2vBL.jpg,819kFsVNYhL.jpg,71h5LH0H2cL.jpg,712wA64X2bL.jpg,715PtN4lG6L.jpg,61zuYyzYTDL.jpg,61tlu+V7pJL.jpg",
      "manufacturer": "Spearhead",
      "asin": "B07M6SHB43",
      "brand": "SPEARHEAD",
      "features": [
        "Up to 25% Longer Life: Precision woven and infused with real coconut shell activated carbon, our Breathe Easy cabin air filters are engineered to last up to 15,000 miles, 25% longer than the standard performance of 12,000 miles",
        "2X Heavier vs. Standard Cabin Filters: We use thick, industrial strength electrostatic media to attract even the tiniest of particles while densely packed activated carbon prevents gases and odors from entering the cabin; use the comparison chart found in the product images to see how much filtration power you’re giving up by purchasing generic cabin filters with or without activated carbon",
        "Enjoy Crisp, Clean Countryside Air: Road debris, exhaust fumes, nasty odors and common irritants must fight through multiple layers of protection before reaching your vehicle’s cabin: (1) Dust Filter (2) Anti-Inflammatory Filter (3) Adsorption Filter (4) Coconut Shell Activated Carbon Weave Filter",
        "Verify Fitment First, Do it Yourself: Make sure to enter your vehicle's year, make and model above using 'Filter results by your vehicle' tool to accurately verify vehicle fitment; the cabin filter is an easy replacement that can save you money at the repair shop; installation manual included w/every order",
        "Better Filter than Your Last One: We know it’s hard to choose from so many different brands carrying the same product; we make it easier for our customers to decide with a simple promise"
      ],
      "description": "N/A",
      "parentTitle": "Spearhead Odor Defense Breathe Easy AC & Heater Cabin Filter, Fits Like OEM, Up to 25% Longer Lasting w/Activated Carbon",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "SINGARO Car Cup Holder Coaster, Silicone Cup Holder Insert, Universal Non-Slip Cup Holders, Car Accessories Interior for Women and Man 4 Pack Gray",
      "imagesCSV": "71pl6vAuQhL.jpg,71VpUCbEyhL.jpg,71eXOmmiccL.jpg,71slsmnRi7L.jpg,81EPcJYyyUL.jpg,819fFlJmQQL.jpg",
      "manufacturer": "SINGARO",
      "asin": "B0CWQ78C9F",
      "brand": "SINGARO",
      "features": [
        "High Quality Material: The coaster is made of environmentally friendly silicone, safe, non-toxic and odorless. Soft with toughness, easily embedded in the cup holder. Very durable, wear-resistant, long service life. High temperature resistance, can withstand 100 ℃ high temperature water cups.",
        "Wide Compatibility: The coaster has a diameter of 3.15 inches and a height of 1.18 inches, which is widely used in most vehicles, such as SUV, sedan, MPV, etc., as long as the size fits your car cup holder.",
        "Protection Function: Our car cup holder coaster has a carry handle design and a stand-up ring edge on its edge to effectively prevent food crumbs, drinks and water from leaking out and preventing the car cup holder from getting dirty.Meanwhile,Thickened design effectively prevents the cup holder from being scratched by the cup when driving on bumpy roads and eliminates the annoying thumping sound, making your journey more enjoyable.",
        "Easy to Use and Clean: With embedded installation, you just need to put it flat on the car cupholder. It is also very quick to remove, there is a small bump on the coaster, pinch it and you can easily remove the coaster. It is very easy to clean, rinse with water or wipe with a wet towel (be careful not to clean with sharp tools).",
        "100% Satisfaction: Our products have quality assurance, if you have questions or are not satisfied after receiving the product, don't worry, please contact us as soon as possible, we provide after-sales service."
      ],
      "description": "Car Cup Holder Coaster",
      "parentTitle": "SINGARO Car Cup Coaster, 4PCS Universal Non-Slip Cup Holders",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Armor All Protectant, Glass and Cleaning Wipes, Wipes for Car Interior and Car Exterior, 90 Count Each (Pack of 3)",
      "imagesCSV": "71PEt0IpZ-L.jpg,71xN8PoBQOL.jpg,71P3tDI+ZCL.jpg,81WSAXnOiQL.jpg,81WrMKlG3NL.jpg,71gR8bMXvXL.jpg",
      "manufacturer": "N/A",
      "asin": "B0D1JJYXFR",
      "brand": "Armor All",
      "features": [
        "You will receive (1) 90 Count Pack of Cleaning Wipes, (1) 90 Count Pack of Protectant Wipes, and (1) 90 Count Pack of Glass Wipes",
        "Interior car cleaner in convenient lint free wipes for easy cleanup as a dust remover and upholstery cleaner wipes",
        "Glass cleaning wipes easily wipe away road grime, filmy residue, fingerprints, bugs and more",
        "A convenient wipe with the proven protection of Armor All Original Protectant",
        "Car detailing wipes won't dry out, damage or fade your car's interior",
        "Safely cleans automotive interiors, including vinyl, plastic and rubber"
      ],
      "description": "Armor All Car Wipes Multi-Pack includes a variety of car wipes that clean your vehicle’s interior surfaces and exterior glass surfaces to provide a “just-detailed” look. Start with Armor All Cleaning Wipes to lift away dirt and debris and reveal your car’s rich, natural beauty without harming delicate automotive surfaces. These multi-surface car cleaning wipes are effective on vehicle dashboards, vinyl, fabric, carpet, consoles, leather and more. Additionally, cleaning wipes won’t dry out, damage or fade automotive surfaces. Follow up with Armor All Original Protectant Wipes to help preserve your vehicle’s rich look by protecting the interior from harmful elements like UV rays and oxidation. These protectant wipes also function as a preventive measure against cracking, fading, discoloration and premature aging. Both the protectant wipes and cleaning wipes are lint-free and will not leave a greasy residue on your hands. End with Armor All Glass Wipes, which leave a crystal clear, streak-free shine on your car’s glass surfaces by easily removing filmy residue, road grime, bugs, fingerprints and more. All these car cleaning wipes provide effective cleaning in convenient, disposable wipes. Help keep your vehicle looking and feeling like new with Armor All.",
      "parentTitle": "Armor All Car Cleaning Wipes - 90 Wipes Each for Interior and Exterior",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "HOMEXCEL Microfiber Cleaning Cloth 12 Pack, 12.5 x 12.5 Inch Microfiber Towels for Cars, Ultra Absorbent Cleaning Rags, Lint Free Cleaning Towels for Household, Kitchen, Window, and Car, Multicolor",
      "imagesCSV": "71PnQe7kL6L.jpg,71KgLWHz1jL.jpg,61-c032YlDL.jpg,61GLP0qgfoL.jpg,61EOP0U7CxL.jpg,61Nav5ID7cL.jpg,7103dWG6FZL.jpg",
      "manufacturer": "HOMEXCEL",
      "asin": "B0DGXKGYTT",
      "brand": "HOMEXCEL",
      "features": [
        "Unparalleled Cleaning Performance: Our microfiber cleaning cloths provide outstanding water absorption and adhesion; effortlessly absorb dirt and liquid, delivering exceptional cleaning results that will leave your home looking brand new",
        "No Scratching: Made from incredibly soft fabric; it provides gentle care for your home; and delicately wipes surfaces without scratching or damaging",
        "Super Absorbent: It can quickly dry water-stained areas; designed to rapidly soak up water and moisture; perfect for wiping down tables and ensuring a streak-free, spotless finish after wiping",
        "Versatile Applications: Suitable for various applications; ideal for household cleaning, such as wiping furniture, kitchen utensils, and glass surfaces; also effective for exterior car care",
        "Easy to Clean and Long-lasting: Designed to withstand repeated use and washing; maintains performance and quality after multiple washes; machine washable and quick-drying for convenient and efficient cleaning"
      ],
      "description": "N/A",
      "parentTitle": "HOMEXCEL Microfiber Towels for Cars, All-Purpose Cleaning Cloths,Lint Free,Scratch Free,Highly Absorbent Washing Towels Cleaning Rags for Kitchen,Car,Window,Glass",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "LITTLE TREES Air Fresheners Car Air Freshener. Hanging Tree Provides Long Lasting Scent for Auto or Home. Gold, 24 Air Fresheners",
      "imagesCSV": "918fROVve5L.jpg,71Weop7CDiL.jpg,71iTBoEOBLL.jpg,91ry5gCHEvL.jpg,61D-+sCyNlL.jpg,61JJSirH8eL.jpg,71ISsj3BxTL.jpg,61DAQpTdiIL.jpg",
      "manufacturer": "Little Trees",
      "asin": "B09JPL7D4C",
      "brand": "LITTLE TREES",
      "features": [
        "Inspired by the opulence of the Roaring 20s, Gold is a luxurious combination of sparking ginger, gold apples, honey-dipped florals and glowing amber woods",
        "THE ORIGINAL CAR AIR FRESHENER: LITTLE TREES is the original car air freshener that freshens at home and on the road",
        "LONG-LASTING FRAGRANCE EXPERIENCE: Specialized proprietary technologies combined with exceptional fragrances deliver long-lasting quality results",
        "MORE THAN JUST A CAR AIR FRESHENER: Freshen up at home or on the road with the original car air freshener. Great to use in laundry rooms, garages, bathrooms, and pet odor areas",
        "FRESHEN YOUR LIFE: LITTLE TREES air fresheners come in a wide range of product styles and fragrances, making it easy to find one you love!",
        "MADE IN THE USA: Rigorous testing and high quality standards ensures a premium fragrance experience made from only the best ingredients.",
        "CAR-FRESHNER CORPORATION strives to create the best car air fresheners for both consumers and the environment. All fragrances meet or exceed the international fragrance association guidelines as well as our stringent internal safety standards."
      ],
      "description": "As the global symbol of freshness and quality, LITTLE TREES has been making life smell better since 1952. With our wide range of high quality, long-lasting products and fragrances, you’re sure to find one you love. At home or on the road, let LITTLE TREES freshen your life.",
      "parentTitle": "LITTLE TREES Air Fresheners",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Rain-X 600001 Windshield Repair Kit - Quick and Easy Durable Resin Based Windshield Repair Kit for Chips and Cracks, Good for Round Damage Below 1\" in Diameter and Cracks Smaller Than 12\" in Length",
      "imagesCSV": "710MC25TZaL.jpg,41NAwlMk6VL.jpg,81kZStFK2kL.jpg,91K-ULreXJL.jpg,81vyhbX4ERL.jpg,81pq4s-qkCL.jpg,81u6HzCnK8L.jpg,61sKZilFfEL.jpg",
      "manufacturer": "Rain-X",
      "asin": "B00IPS4APU",
      "brand": "Rain-X",
      "features": [
        "Stops The Spread of Chips and Cracks - Rain-X Windshield Repair Kit Helps You Minimize The Appearance And Stop The Spread Of Chips And Cracks In Your Windshield.Fit Type: Universal Fit",
        "Easy To Use - Everything You Need Is Included, Takes Only Minutes With Minimal Steps. For Cracks Simply Apply Resin To Crack Then Curing Strips, Move Windshield Into Direct Sunlight And Remove Excess. Good for multiple repairs",
        "Durable Resin Formula - Use Durable Resin To Make Windshields Stronger Than Before, Repairing All Types Of Laminated Windshields Up To First Layer Of Windshield Glass",
        "For Best Results - Repairs Should Be Made As Soon As Possible After The Damage Occurs And Before The Break Has Had A Chance To Be Contaminated By Dirt Or Water",
        "Pro-Tip To Avoid Poor Results - Refrain From Applying Resin Too Quickly, Air Pockets Forming During The Repair Or Repairing On A Contaminated Crack As This May Compromise Your Results"
      ],
      "description": "Rain-X Car Windshield Repair Kit helps you minimize the appearance and stop the spread of chips and cracks in your windshield, helping you save time and money, avoiding a full windshield replacement. Rain-X Windshield Repair Kit is easy to use, and only takes minutes to apply. It removes air from the break, fills it with durable resin and makes it even stronger than before. For best results, repairs should be made as soon as possible after the damage occurs and before the break is contaminated by dirt or water. In addition, avoid the use of glass treatments after the crack has formed and prior to repair. However, glass treatments can be applied one (1) week after repair. The kit works best on round damage not more than one inch in diameter, and cracks not longer than 12 inches. It will not repair damage to more than one layer of glass. Pro-tip to avoid poor results - refrain from applying resin too quickly, air pockets forming during the application or repairing a contaminated crack as this may compromise your results.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Amooca Car Seat Headrest Hook 4 Pack Hanger Universal Vehicle Car Storage Organizer for Handbag Purse Coat S Type Checkered Orange",
      "imagesCSV": "81f+BRrYz0L.jpg,81Iedp6+pvL.jpg,81rt0Zib68L.jpg,81PWUEX9DNL.jpg,81KNx8uyXtL.jpg,814XdBDzWXL.jpg,81NOvlbMraL.jpg,91CnEO54BkL.jpg",
      "manufacturer": "Amooca",
      "asin": "B0CYGNZGHQ",
      "brand": "Amooca",
      "features": [
        "Material: this good is made of premium quality material. This item is wide & deep enough for your purse, backpack and so on. Installation size: 0.32-0.55 inch diameter of the headrest bar. Each item can hold up to 55 lb (25kg).",
        "Organize car space: it converts your car’s headrest into a storage space, help you keep your car interior perfectly clean and organized. The car headrest hook is great for hanging groceries, clothes, umbrella, handbags, water bottles, kid's toys, baby supplies and so on.",
        "Convenient: Contains 4 hangers, meet your multiple uses. The hooks can be rotated 360 degrees horizontally after installing. You can hide the hook when not use, space saving and perfect compatible with your car.",
        "Easy to install: easy for removal and installation. The S type car headrest hook with simple design do not need to take off the headrest, no tools required.",
        "Car Storage Helper: Rotate hook around to either the front or back of the seat to use as desired, help you keep your car interior perfectly clean and organized, don't worry your shopping bags be placed on the floor or seat rolling around and spilling."
      ],
      "description": "N/A",
      "parentTitle": "Amooca Car Seat Headrest Hook 4 Pack Hanger Storage Organizer Universal for Handbag Purse Coat fit Universal Vehicle Car",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "NOCO GENIUS1, 1A Smart Car Battery Charger, 6V and 12V Automotive Charger, Battery Maintainer, Trickle Charger, Float Charger and Desulfator for Motorcycle, ATV, Lithium and Deep Cycle Batteries",
      "imagesCSV": "81xccMDEjkL.jpg,81b61xR8UHL.jpg,81si95rH5yL.jpg,81zrrLyyE5L.jpg,81Tp1VOYpbL.jpg,81UYtiY+8OL.jpg,81SsCc1KrcL.jpg",
      "manufacturer": "NOCO",
      "asin": "B07W46BX31",
      "brand": "NOCO",
      "features": [
        "MEET THE GENIUS1 — Similar to our G750, just better. It's 35% smaller and delivers over 35% more power. It's the all-in-one charging solution - battery charger, battery maintainer, trickle charger, plus desulfator.",
        "DO MORE WITH GENIUS — Designed for 6-volt and 12-volt lead-acid (AGM, Gel, SLA, VRLA) and lithium-ion (LiFePO4) batteries, including flooded, maintenance-free, deep-cycle, marine and powersport batteries.",
        "ENJOY PRECISION CHARGING — An integrated thermal sensor dynamically adjusts the charge based on ambient temperature, preventing overcharging in hot weather and undercharging in cold, ensuring optimal battery performance.",
        "CHARGE DEAD BATTERIES — Charge batteries from as low as 1 volt, or use Force Mode to manually charge completely dead batteries down to zero volts. Perfect for recovering deeply discharged or neglected batteries.",
        "BEYOND MAINTENANCE — Keep your battery fully charged without worrying about overcharging. Our smart charger constantly monitors the battery, allowing you to leave it connected safely - indefinitely - for worry-free maintenance.",
        "RESTORE YOUR BATTERY — Precision pulse charging automatically detects and reverses battery sulfation and acid stratification, restoring your battery's health for improved performance and extended lifespan.",
        "COMPATIBLE — Charges and maintains all types of vehicles, including cars, automobiles, motorcycles, mopeds, lawn mowers, ATVs, UTVs, tractors, trucks, SUVs, RVs, campers, trailers, boats, PWCs, jet skis, classic cars, and more.",
        "WHAT'S IN THE BOX — Includes a 1A charger, a direct wall plug-in, 110-inch DC cable with battery clamps, and integrated eyelet terminals, and 3-year warranty. Proudly designed in the USA."
      ],
      "description": "The GENIUS1 is the ultimate all-in-one solution for battery charging, maintenance, and restoration, delivering 35% more power in a 35% smaller design compared to its predecessor, the G750. Designed for 6-volt and 12-volt lead-acid (AGM, gel, flooded, and deep-cycle) and lithium-ion (LiFePO4) batteries (up to 30 amp-hours), it is compatible with a vast array of vehicles, such as cars, automobiles, motorcycles, dirt bikes, scooters, mopeds, lawn mowers, ATVs, UTVs, tractors, trucks, SUVs, RVs, campers, trailers, boats, PWCs, jet skis, snowmobiles, golf carts, classic cars, and more; including automotive brands like BMW, Mercedes-Benz, Porsche, Bentley, Maserati, Lexus, Audi, Ford, Chevrolet, Corvette, Cadillac, Prius, Toyota, Subaru, Nissan, powersport vehicles such as Harley-Davidson, Honda, Yamaha, Kawasaki, Ducati, Indian, KTM, Husqvarna, Vespa, Polaris, Seadoo, as well as lawn and garden vehicles such as John Deere, Kubota, Toro and more. Featuring an integrated thermal sensor, the GENIUS1 adjusts its charging profile based on ambient temperature, ensuring optimal performance by eliminating the risk of overcharging in hot climates and undercharging in cold ones. It's capable of charging batteries as low as 1 volt and offers a Force Mode for manually charging completely dead batteries (as low as zero volts). With precision pulse charging, the GENIUS1 restores battery health by reversing sulfation and acid stratification, improving performance and extending battery life. Its advanced monitoring system allows for safe, indefinite connection, making it perfect for long-term maintenance. The package includes a 1A charger (120-240VAC), a direct wall plug-in, 110-inch DC cable with battery clamps and integrated eyelet terminals, all backed by a three-year warranty. Proudly designed in the USA, the GENIUS1 combines power, reliability, and convenience in a compact design to keep your batteries ready for whatever lies ahead.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "240T Thickened Automotive Glass Sunshade and Comes with Storage Bag,Keep Car Interior Cool,Universal Windshield Sun Shade Fit for Cars,Trucks,SUVs (L(57.08 * 31.5 inch))",
      "imagesCSV": "610Z2IVvvKL.jpg,513SG5ETx7L.jpg,61aCMEXdH6L.jpg,61Aw8BBcpQL.jpg,61mcQ7XIB2L.jpg,61W0nC-eJXL.jpg",
      "manufacturer": "Aokdom",
      "asin": "B0C1YFF2JJ",
      "brand": "Aokdom",
      "features": [
        "【Thicker design】: the latest thicker car window shades in 2025! More sun shades! More sun protection! Our car sunshade is designed with 240T thickened titanium silver coating, which can greatly block the sunlight and heat, so you can enjoy the cool and quiet time alone in your car in the hot summer sun!",
        "【Blocking UV rays and heat insulation】: this car sunshade has powerful sun shading and heat insulation functions! It can block and reflect 99% of UV rays. Its heat insulation and cooling effect is 60 times more effective than old-fashioned sun visors! Create a cool and comfortable driving atmosphere for you!",
        "【FOLDABLE STORAGE】: The front windshield of the car sunshade is designed with \"memory steel ring\" which can be twisted and folded freely, when you want to store it, just fold it up, twist it along the steel ring into an \"8\" shape and put it into the storage bag that comes with the product, it can be easily placed in the car door or passenger compartment.",
        "Our car sunshade is compatible with most vehicle models and comes in three sizes: M: 55.12 x 27.6 inches – Fits compact cars. L: 57.08 x 31.5 inches – Best for SUVs. XL: 59 x 31.5 inches – Ideal for midsize/large SUVs and small trucks. Please note! Before purchasing, carefully measure your windshield dimensions to ensure the best fit. Thank you!",
        "【Installation】: The installation of this windshield visor is very simple. Method 1: You can use the elasticity of the visor and put it directly in front of the car windshield. Method 2: You can also use the two sunshades that come with the original car to press and fix it. It takes you only a few seconds to install and is truly easy to use."
      ],
      "description": "N/A",
      "parentTitle": "240T Thickened Automotive Glass Sunshade and Comes with Storage Bag,Keep Car Interior Cool,Universal Windshield Sun Shade Fit for Cars,Trucks,SUVs",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Loctite Threadlocker Blue 242 & Red 271 - Medium & High Strength Thread Lock Glue for Nuts, Bolts, & Fasteners, Prevents Loosening & Corrosion - 6 ml, 1 Pack Each",
      "imagesCSV": "51pNsg9V6TL.jpg,910GUz2SiuL.jpg,614Bm6G3u+L.jpg,81pVQdr9E6L.jpg,61FEF5WtcQL.jpg,91EumfPCOiL.jpg,81X14GVPGML.jpg",
      "manufacturer": "N/A",
      "asin": "B08XLC6RL4",
      "brand": "Loctite",
      "features": [
        "Lock and Seal Fasteners: Prevents loosening of metal fasteners caused by vibration on small motors, mowers, power equipment, engines, machinery, and vehicles",
        "Prevents Rust and Corrosion: Moisture-resistant formula protects from leaks, rusting, and corrosion, eliminating the need to stock up on expensive lock nuts and washers",
        "Removable/Permanent Fix: Can be removed with hand tools. Permanent seal prevents tampering and is only removable once cured by heating parts up to 500°F (260°C)",
        "Easy and Quick: Sets in 10 minutes and fully cures in 24 hours",
        "For 6-25mm Fasteners: Medium and high-strength formulas for use on threads for nuts and bolts from 6mm to 25mm (up to 1 inch)"
      ],
      "description": "Loctite Threadlocker Blue 242 & Red 271**: Designed to lock and seal threaded fasteners, preventing loosening from vibration. Blue 242 is ideal for 6-19mm fasteners, perfect for small motors, mowers, and power equipment, offering medium strength and easy disassembly. Red 271 is suited for fasteners up to 25mm (1 inch), ideal for engines, machinery, and vehicles, providing a permanent, high-strength solution. Both formulas protect threads from leaks, rusting, and corrosion, eliminating the need for expensive lock nuts and washers. They set in 10 minutes and fully cure in 24 hours, with Red 271 being removable only by heating parts to 500°F (260°C).",
      "parentTitle": "Loctite Threadlocker",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "CKAuto Tire Valve Stem Caps, Golden Yellow, 4 pcs/Pack, Anodized Aluminum Tire Valve Cap Set, Corrosion Resistant, Universal Stem Covers for Cars Trucks Motorcycles SUVs and Bikes",
      "imagesCSV": "71Iuf78q3vL.jpg,716bxl8qEGL.jpg,710-ELHEFWL.jpg,71Yfi0TpUQL.jpg,712b6JD5RmL.jpg,81jQ4QilHIL.jpg",
      "manufacturer": "CKAuto",
      "asin": "B071JNF4DM",
      "brand": "CKAuto",
      "features": [
        "Special Design – Metal materials are prone to rust in the presence of water and oxygen, which may lead to corrosion on valve body. The plastic inner valve caps design combines the attribution of corrosion resistance of plastic and the stylish look of metal",
        "Premium Material – CKAuto Valve Stem Caps are made of high-grade light-weight aluminum alloy, anodized & powder coated finish for maximum strength and durability, surface anodic oxidation treatment makes the color brighter.",
        "Easy to install – The design of the tire valve cap rotating thread makes it easy to twist when install or remove.",
        "Wide Application – The inner diameter of tire valve caps is 7mm, and the inner height is 13.8mm, so the valve caps universal fit most cars, bicycles, SUVs, trucks, RVs, and other motor vehicles, etc.",
        "Why Choose CKAuto – CKAuto Valve Stem Caps address the challenge that some materials that may be desirable for an exterior of the valve cap can react with the materials commonly used for valve threads, and materials that do not react with the valve thread material may be undesirable for the exterior of the cap for aesthetics or performance reasons."
      ],
      "description": "N/A",
      "parentTitle": "CKAuto Tire Valve Stem Caps, Anodized Aluminum Tire Valve Cap Set, Corrosion Resistant, Universal Stem Covers for Cars Trucks Motorcycles SUVs and Bikes",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Camco TastePURE 50-Ft Water Hose - RV Drinking Water Hose Contains No Lead, No BPA & No Phthalate - Features Reinforced Design & Crafted of PVC - 1/2” Inside Diameter, Made in the USA (22753)",
      "imagesCSV": "71peOgyOLvL.jpg,71jxAuz+N4L.jpg,71X7dqm+LYL.jpg,71ZkudJDqYL.jpg,71K3S+wo2TL.jpg,71YZf3ADjOL.jpg,91JquiyBwXL.jpg,81NFoYW1UML.jpg",
      "manufacturer": "Camco",
      "asin": "B00480BUZW",
      "brand": "Camco",
      "features": [
        "Premium Grade Drinking Water Hose: Camco's premium-grade RV fresh water hose is constructed with NSF/ANSI 61 certified hose for drinking water. Lead, BPA, & phthalate-free, this quality PVC hose prioritizes your health with every use.",
        "Certified Lead-Free: Enjoy Camco's CSA lead-free certified RV hose! It meets the highest standards, is CSA lead-free content certified to NSF/ANSI 372, and fully complies with all federal and state lead-free laws.",
        "Versatile Applications: Tackle outdoor tasks with this 50' drinking hose, featuring a 1/2\" ID. It's perfect for RVing, camping, boating, gardening, pet cleaning, car washing, & lawncare. The easy-on grip connect makes handling a breeze.",
        "Diamond-Hatch Reinforcement for Kink-Resistance: Made from reinforced, quality PVC, this UV-stabilized flexible drinking hose is designed for maximum kink resistance & durability.",
        "Made in the USA: Experience superior quality and reliability with Camco's potable water hose, proudly made in the USA. Camco prioritizes practicality and excellence for every consumer."
      ],
      "description": "Enjoy clean drinking water wherever you go with Camco's Drinking Water Hose. Designed with your health and convenience in mind, this drinking hose is perfect for a variety of uses, whether you're camping, using it with your camper, or simply need a trustworthy potable water hose in your backyard. Crafted from quality materials, Camco's water hose is built to withstand the demands of outdoor adventures. Rain or shine, this RV essential is ready to serve your clean water needs. The sturdy construction also protects against the sun's harmful rays, ensuring its longevity for years to come. This camper water hose goes beyond durability. Its premium design and adherence to the highest standards provides peace of mind with every sip. With maximum kink-resistance, it ensures uninterrupted water flow for a no hassle experience! Proudly made in the USA, Camco’s Drinking Water Hose embodies reliability, durability, and practicality. It's your assurance of having cleaner drinking water wherever your adventures take you!",
      "parentTitle": "Camco TastePURE Water Hose - Drinking Water Safe",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Munchkin Brica Sun Safety Car Window Shade with Heat Alert, Helps Block UVA/UVB Rays, 2 Pack, Black",
      "imagesCSV": "91i+p2KJMzL.jpg,81ZPoCRSoOL.jpg,A1HrL+-i1ML.jpg,9175eRF56lL.jpg,713f8AOvIyL.jpg,71fNHSTYWxL.jpg",
      "manufacturer": "Munchkin",
      "asin": "B00WH7Y7TY",
      "brand": "Munchkin",
      "features": [
        "Optimal Coverage: Includes two auto shades, each measuring 15 x 19 inches (35.6 x 43.2 cm), for maximum sun protection",
        "White Hot Indicator: Turns white when the car becomes too hot, providing a safety warning for added peace of mind",
        "Versatile Attachment: Dual installation options—choose between adjustable clips or suction cups for a secure fit",
        "Easy Retraction: One-push retract button allows for effortless rolling up when not in use",
        "Enhanced Visibility: Made with Safe-View premium mesh to maintain superior visibility while blocking the sun",
        "Strong Suction Hold: Clean the window surface before application for optimal suction; occasional reapplication may be needed due to temperature fluctuations",
        "Baby Registry Favorite: Makes a great gift for new parents",
        "Fits a variety of vehicles"
      ],
      "description": "An easy to use, retractable car shade that blocks the sun and features a White Hot patented heat alert system that turns white when car is too hot.",
      "parentTitle": "Munchkin® Brica® Sun Safety™ Car Window Roller Shade with White Hot® Heat Alert, Black, 2 Count (Pack of 1)",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Meguiar's Gold Class Car Wash - Get Professional Results in a Foam Cannon or as a Bucket Wash - Get a Clean and Glossy Finish That's Safe for All Paint Types - 64 Oz",
      "imagesCSV": "81EDkiZ2ZdL.jpg,917KoLFyRsL.jpg,91d2vI9yCIL.jpg,71JUv+60mfL.jpg,91X8-IOda7L.jpg,91hymCVOp4L.jpg,91APVj5cjAL.jpg,817Z4hZoBFL.jpg",
      "manufacturer": "Meguiar's",
      "asin": "B0009IQXFO",
      "brand": "Meguiar's",
      "features": [
        "ONLY ONE STEP: Meguiar's Gold Class foaming car wash soap simplifies your car cleaning routine by combining cleaning and conditioning into one easy step. Save time and effort while achieving a flawless, factory-looking finish.",
        "CLEAN AND PRESERVE: Featuring an advanced formula, this powerful car shampoo and conditioner not only cleans your car, but it’s also gentle enough to preserve any existing wax protection. No more sacrificing protection for cleanliness!",
        "THE PERFECT PROFESSIONAL CLEAN: Experience the ultimate clean with this eco friendly car wash soap. Its biodegradable formula forms powerful suds that easily pick up and foam away even the toughest dirt, road grime, and contaminants.",
        "LONG-LASTING RADIANT LOOK: Say goodbye to dull and faded paint and hello to the ultra-rich paint conditioners Meguiar's Gold Class foam car wash uses to leave the surface looking radiant, renewed, and ready for car show season.",
        "FOAM CANNON READY: Meguiar's Gold Class car wash is versatile enough to be used in either a bucket or in a car wash kit with foam gun. Simply dilute the soap 5:1 before using it with a foam cannon for a professional-level clean."
      ],
      "description": "Indulge your vehicle in the ultimate car wash experience with Meguiar's Gold Class Car Wash Shampoo and Conditioner. Specially formulated to deliver exceptional cleaning and conditioning in a single step, this high-quality car wash ensures your vehicle receives the best care possible. Experience the power of its advanced formula as it effortlessly eliminates tough dirt, road grime, and stubborn contaminants from your car's paintwork. The superior foaming action creates a thick lather that clings to the surface, maximizing cleaning effectiveness without compromising the protective wax layer. Say goodbye to dullness and hello to a radiant look. Meguiar's Gold Class Car Wash goes beyond mere cleanliness. Its ultra-rich paint conditioners work diligently to remove impurities, unveiling the true color and clarity of your vehicle's paint. Witness the transformation as your car's exterior radiates a deep, lustrous shine. Caring for your vehicle shouldn't come at the expense of the environment. That's why Meguiar's Gold Class Car Wash is proud to be compliant with Regulation (EC) No 648/2004. Enjoy the peace of mind that comes with using a biodegradable car wash soap. Versatility is key, and Meguiar's Gold Class Car Wash delivers. Whether you prefer using a foam cannon for a luxurious foaming experience, a car wash brush, or a traditional bucket-and-sponge method, this car wash shampoo and conditioner adapts to your preferred washing technique. It's the perfect choice for car enthusiasts who demand nothing but the best. Elevate your car detailing routine with Meguiar's Gold Class Car Wash Shampoo and Conditioner. Revel in the exceptional cleaning, the captivating shine, and the rejuvenated paintwork. Pamper your vehicle with the car essentials it deserves and experience the gold standard in car wash products.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "AIDEA Microfiber Cleaning Cloth, 50PK, Blue Shop Rags, Microfiber Towels for Cars, Dusting Cloth Lint Free Rags, Absorbent Towels for SUVs, House, Kitchen, Mechanic, Workshops, 12\"×12\"",
      "imagesCSV": "91vm8qw-7iL.jpg,71EvfTCsBwL.jpg,61Sh+ztNDrL.jpg,614jIJkAbHL.jpg,71fkkhYDzcL.jpg,71dZ9+AkzJL.jpg,61S+wF6BQGL.jpg",
      "manufacturer": "AIDEA",
      "asin": "B0DHVJ5HTJ",
      "brand": "AIDEA",
      "features": [
        "Super Absorbent: Experience the excellent quality of AIDEA all-purpose microfiber cleaning cloths; made from 87% polyester and 13% polyamide; offering exceptional absorbency and quickly wicking away water to keep you dry; ideal for swiftly and safely removing dirt, grime, and liquids",
        "Soft & Lint-Free: Our ultra-soft and non-abrasive microfiber towels ensure a scratch-free cleaning experience on surfaces, paint, glass, and coatings; effective in tackling the toughest grease, grime, and dirt; suitable for cleaning kitchens or cars; leaving surfaces shiny and pristine",
        "Remarkable Durability and Reusability: These microfiber dusting cloths can be washed and reused hundreds of times; resistant to shrinking, falling apart, or losing cleaning power; designed for long-term use",
        "Easy Care and Use: Available in five different colors for easy color coding of cleaning tasks; designed with premium fabrics that prevent scratching; ideal for polishing and drying without damaging surfaces; keeps your car shiny and intact",
        "Versatile: AIDEA cleaning rags are perfect for a variety of tasks; effective with just plain water; suitable for use in kitchens, bathrooms, and for dusting; an essential tool for any cleaning routine"
      ],
      "description": "N/A",
      "parentTitle": "AIDEA Microfiber Cleaning Cloths, Microfiber Towels for Cars, Premium All-Purpose Car Cloth, Dusting Cloth Cleaning Rags",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "FRAM Fresh Breeze Cabin Air Filter Replacement for Car Passenger Compartment w/ Arm and Hammer Baking Soda, Easy Install, CF10744 for Mitsubishi Vehicles",
      "imagesCSV": "81i1ViLnqtL.jpg,81rG7RvxuhL.jpg,91Wm1kG3ORL.jpg,81iiXcdccdL.jpg,91NsKuWcTdL.jpg,61aYqEWab4L.jpg",
      "manufacturer": "FRAM",
      "asin": "B009OA3PJK",
      "brand": "Fram",
      "features": [
        "VEHICLE APPLICATIONS: 2000-2005 Mitsubishi Eclipse; 1999-2003 Mitsubishi Galant",
        "FILTER CROSS REFERENCES: Mitsubishi MR500360; Premium Guard PC4682; Purolator C25874; STP CAF1821P",
        "EASY INSTALL: This cabin air filter is located behind the glove box and on average will only take 15 minutes to replace the old filter with a new filter. It is important to replace your cabin air filter periodically to help keep the air in your vehicle clean. During extreme weather and heat, the HVAC system has to work harder and a clean cabin air filter is essential in helping your HVAC system run more efficiently.",
        "FRAM Fresh Breeze cabin air filters are the only cabin air filters built with Arm & Hammer baking soda combined with carbon embedded in the filter. Cabin air filters have proven to be essential as air quality can be severely affected by wildfire smoke, pollen, dirt, and other irritants. It is important to replace your cabin air filter periodically to help keep the air in your vehicle clean.",
        "This cabin air filter will help protect your vehicles heating and air conditioning unit while allowing for the most efficient air flow into the cabin of your vehicle."
      ],
      "description": "Cabin air filters have proven to be essential to your vehicle as air quality can be severely affected by wildfire smoke, pollen and dirt. FRAM Fresh Breeze cabin air filter is the only cabin air filter that uses the natural deodorizing properties of ARM & HAMMER embedded in the filter to get rid of odor flowing through the ventilation system. FRAM cabin air filter filters 98% of these contaminants. Particles that enter the vehicle with outside air through the vehicle’s air conditioning, heating system and ventilation system can become concentrated and expose passengers to smoke, road dust, dirt and particles at higher levels than outside the car. Breathe in cleaner air with a FRAM Fresh Breeze Cabin Air Filter.",
      "parentTitle": "FRAM Fresh Breeze Cabin Air Filter with Arm & Hammer Baking Soda",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "E6000 231020 Adhesive with Precision Tips, 1.0 fl oz",
      "imagesCSV": "71TaUAG+JpL.jpg,71kldm5oqKL.jpg,71E5LUsfgKL.jpg,71QHdEQnM-L.jpg",
      "manufacturer": "E6000",
      "asin": "B00JP3X9WE",
      "brand": "E6000",
      "features": [
        "Includes 3 precision tips plus a precision tip cap",
        "Bonds to glass, wood, plastics, tin, metal, ceramic, cement, rubber, vinyl, leather, fabric and much more",
        "Dries clear, paintable",
        "Photo safe, temperature resistant",
        "Washer/dryer safe"
      ],
      "description": "E-6000 is one of those miracle adhesives that can bond almost anything to another material, with some exceptions. The lengthy list of materials it works with includes metal, wood, fabric, glass, ceramic, polymer clay, brick, marble, concrete, fiberglass, metal, acrylic, polycarbonate, and PVC. It’s an indispensable maintenance tool that permits the end user to repair and maintain equipment that may have been too expensive or difficult to do in the past, and it’s a great craft adhesive as well. Includes three tips for pinpoint delivery of the adhesive just where it’s needed. 1-oz. tube.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "MAXLONE ™ Car Spray with Triphene® Technology, Quick Spray & Wipe Waterless Detailer - Clean, Shine, Protect Paint, Glass, Wheels, Trim Without Pre-Washing (20oz, 1 Gallon with 8 Micro Fiber Cloth)",
      "imagesCSV": "71U3tuWFMsL.jpg,71K7wNWZdHL.jpg,71LQBg11UQL.jpg,71qpm4XfGtL.jpg,71gBit0SugL.jpg,71+SY3y0dIL.jpg,71C1Oslj65L.jpg",
      "manufacturer": "MAXL",
      "asin": "B0F1TT2TCR",
      "brand": "MAXL",
      "features": [
        "Waterless Wash & Quick Detailing Made Easy, Just Spray & Wipe! – No water, no mess! Easily clean, and shine vehicles and surfaces anytime, anywhere, no more complicated detailing routines! Just use MAXLONE car spray, wipe, and enjoy a stunning, streak-free shine that rivals pro-detailing jobs. Perfect for anyone looking to protect their investment and save hours of work.",
        "Repels Water, Dirt, & Grime with Advanced Triphene Barrier – MAXL spray coating triphene technology creates a triple layer smart coating hydrophobic and oleophobic shield that makes water, dirt, and road grime slide off, cutting down on wash time and keeping your vehicle or surfaces looking flawless.",
        "Instant Deep Shine & Long-Lasting Protection on All Surfaces – Instantly restore deep color and mirror like shine while protecting paint, glass, plastic, and metal for months, not days, no more constant reapplying! MAXLONE car spray triphene saves time and money by replacing dozens of products while delivering professional-grade results anyone can achieve.",
        "Heat, Chemical & UV Resistant for Extreme Durability Up to 600°F – MAXL car coating hydrophobic spray safely coat high-heat areas like wheels, calipers, exhausts, and engine parts without damage. Shields against UV rays, acid rain, road salts, and chemicals that would ruin other products, ensuring long-term protection in any condition.",
        "Eco-Friendly, Non-Toxic & Cost-Effective Pro Results at Home – Safe for you and the environment. MAXLONE Triphene Car Spray is highly concentrated, clean and treat an entire vehicle with just 2oz. Maxl can be diluted 50/50 with deionized water for double the coverage and value! Made in USA!"
      ],
      "description": "N/A",
      "parentTitle": "MAXLONE ™ Car Spray with Triphene® Technology, Quick Spray & Wipe All Purpose Waterless Detailer - Clean, Shine, Protect Paint, Glass, Wheels, and Plastic Trim Without Pre-Washing",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Weize YTX7A-BS High Performance - Maintenance Free - Sealed AGM Motorcycle Battery Compatible with Gas Gy6 Scooter Moped 50CC 125CC",
      "imagesCSV": "71bVKhHsMNL.jpg,71Rrk2nz2WL.jpg,71AYeK7cxcL.jpg,7145FvMaovL.jpg,71n+7TwfUcL.jpg,71CD3TfgHzL.jpg,716mHmQVkBL.jpg",
      "manufacturer": "WEIZE",
      "asin": "B07GGTCJ9Q",
      "brand": "WEIZE",
      "features": [
        "YTX7A-BS is a 12v 6ah 140 cold cranking Amps (CCA) sealed lead acid (SLA) battery. Dimensions: 5.90 inches x 3.43 inches x 3.74 inches. Polarity: positive on left, negative on right. Listing is for the battery and screws only. No wire harness or mounting accessories included. Terminal： Left : Positive (+)-Red, Right: Negative (-)-Black.",
        "This YTX7A-BS is a sealed lead-acid (SLA) absorbed glass mat (AGM) rechargeable battery. AGM and GEL batteries are lead-acid and of the same battery chemistry. This battery comes already charged, sealed, maintenance free, and ready to install.",
        "Premium quality absorbed glass mat technology (AGM) is ideal for ATVs, motorcycles, personal watercraft, jet ski's, snowmobiles and more.",
        "Size, cold cranking amps, terminal location and battery type are key pieces to getting the right unit. please measure your old battery and compare the dimensions with this battery, if the measurements are the same, positive and negative poles are consistent, CCA is no big difference, it will fit for your vehicle. It is recommended to replace the battery every two years to prevent the motorcycle from failing to start.",
        "Backed by a 30 day refund policy and full 1 year warranty. We aim for quality followed up with quality customer service, Amazon doesn't deal with the return of battery-related products, so please contact the seller directly. Weize support team is on standby for YOU."
      ],
      "description": "N/A",
      "parentTitle": "Weize YTX14AH YTX14 Battery",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "HOTOR Car Trash Can with Lid and Storage Pockets - 100% Leak-Proof Organizer, Waterproof Garbage Can, Multipurpose Trash Bin for Car, 2 Gallons, Black",
      "imagesCSV": "81hrIuixehL.jpg,81furKWHfrL.jpg,81bRrtv389L.jpg,81lr15jVGCL.jpg,81iGKqVJfzL.jpg,81SXnRx63WL.jpg,71uNUH942CL.jpg,71kx1-4ZNiL.jpg",
      "manufacturer": "HOTOR",
      "asin": "B07VGRVKSN",
      "brand": "HOTOR",
      "features": [
        "✔ADJUSTABLE STRAP & COLLAPSIBLE SHAPE – The car trash bag features an adjustable strap that allows it to be attached on both front and back headrest as well as the center console for easier access for all around. Coupled with the collapsible design, you will greatly benefit from functional convenience of this auto trash container.",
        "✔MAGNETIC SNAPS: There are 4 metallic magnetic snaps inside of HOTOR car trash can for fastening the extra trash bag. Compared with traditional car trash cans, those 4 little snaps make the replacement of car trash bags easier. Simply unsnap the magnetic snaps to replace the used trash bag with a new one. Then snap shut the magnetic snaps to fix the extra trash bag. Just 2 steps and and it's all set.",
        "✔DURABLE LEAKPROOF INNER LINING – This garbage can for car adopt waterproof and leakproof material, easy to clean and wash. No more worry about food spills or other stubborn stain.",
        "✔MULTIPURPOSE – This car garbage bin can be used as storage bag to keep items such as cups, toys, and other accessories. Additionally, the waterproof advantage also makes it an excellent car cooler of the maximum value for money.",
        "✔GREAT COMPATIBILITY – An effective solution for people with the needs of neat and organized car interior. Perfectly fits a variety of types including sedans, SUV, truckers, etc. HOTOR takes every conceivable possibility into account."
      ],
      "description": "N/A",
      "parentTitle": "HOTOR Car Trash Can with Lid and Storage Pockets - 100% Leak-Proof Organizer, Waterproof Garbage Can, Multipurpose Trash Bin for Car",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "BDK PolyPro Seat Covers Full Set in Beige on Black – Front and Rear Split Bench Seat Covers for Cars, Easy to Install , Car Accessories for Auto Trucks Van SUV",
      "imagesCSV": "61VWYvjtCDL.jpg,81mdBwyoT8L.jpg,71WgUOe3S+L.jpg,817EANFoivL.jpg,81SDEays3jL.jpg,71uig-bh+EL.jpg,61P2PHzAaAL.jpg,81V4M54EbYL.jpg,715zn1xB1lL.jpg,41J1gvLWJ6L.jpg,41y0clFc-5L.jpg,41mANjXpX8L.jpg",
      "manufacturer": "BDK",
      "asin": "B01FKQW1G4",
      "brand": "BDK",
      "features": [
        "UNIVERSAL FIT FOR MOST AUTOS: Our seat covers are designed to provide a snug and stylish fit for the majority of cars, trucks, vans, and SUVs. They are compatible with most vehicles that feature adjustable or removable headrests. Please note: these seat covers are not compatible with seats that have molded (non-adjustable) headrests, integrated seatbelts, or built-in armrests on the front seats.",
        "EASY INSTALLATION VIDEO ON PRODUCT PAGE: Protecting your vehicle has never been easier—or quicker. Follow the step-by-step instructions and installation video included on this page to secure the front seat covers in minutes. Then, complete the look by installing the rear bench seat cover and headrest covers. The video walks you through multiple options and adjustment tips to accommodate different vehicle interior designs.",
        "PROTECTS AGAINST WEAR & TEAR: Whether your car is brand new or just new to you, these durable seat covers are the perfect way to keep your interior looking fresh. They offer reliable protection against dirt, spills, and daily wear—helping preserve your seats and maintain your vehicle’s value.",
        "BREATHABLE MATERIALS FOR ALL-SEASON CONFORT: Designed with comfort in mind, our seat covers are made from premium, breathable materials to keep you cool and comfortable year-round. Unlike leather seat covers that can overheat in summer or feel icy in winter, our high-quality poly outer layer promotes airflow and ventilation—making even long drives more enjoyable.",
        "STYLISH MODERN DESIGN: Refresh your ride with a sleek, contemporary look. Our full set of seat covers features a bold two-tone design with detailed stitching, adding a pop of color and personality to your interior. It’s an instant upgrade that turns heads and transforms your car’s vibe from ordinary to eye-catching."
      ],
      "description": "N/A",
      "parentTitle": "BDK PolyPro Car Seat Covers Full Set in Charcoal on Black – Front and Rear Split Bench for Cars, Easy to Install Cover Set, Accessories Auto Trucks Van SUV",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Qifutan Car Phone Holder Mount Phone Mount for Car Windshield Dashboard Air Vent Universal Hands Free Automobile Cell Phone Holder Fit for iPhone Smartphone Carbon Fiber",
      "imagesCSV": "91Yg33Uoc6L.jpg,71jEOd9xdKL.jpg,71xG5kS2M1L.jpg,71DT5WkaTOL.jpg,71DpyRvM5KL.jpg,715YCWrTP6L.jpg,71LqbO1wp4L.jpg,81mcWMVTQoL.jpg,71d8fdSTttL.jpg",
      "manufacturer": "Qifutan",
      "asin": "B0CHS69JW3",
      "brand": "Qifutan",
      "features": [
        "3 IN 1 Phone Holders for Your Car: Cell phone holder car is equipped with a suction cup and vent clip, which can be freely mounted on the windshield, dashboard, and air vent for feeding your different usage needs. Cell phone holder is applied to most cars, pickup trucks, SUVs, taxis. A perfect assistant for Uber, Lyft drivers.",
        "Enhanced Powerful Suction Cup: Phone holder mount is equipped with double-lock suction cup and uses heat-resistant TPU material , which can provide strong suction power on smooth surfaces, and keep the mount stable in any conditions. To restore adhesion, simply rinse the sticky surface with warm water and wipe dry.",
        "Perfect Flexibility: Car phone holder with 360 degree ball joint and adjustable telescopic arm, which can adjust your phone to any ideal angle without obstructing your view. The telescopic arm can be extended from 6.5 inches to 8.1 inches. Easily adjust the distance between you and the car mount.",
        "Full Protection: iPhone car mount with vacuum silicone rubber and thick panels can provide full protection for your phone from scratches and drops even at high speeds, bumps or turns.",
        "Easy Operation: Car mount for iPhone has a one-touch release button, you can release your phone with one hand while driving. Adjustable feet accommodate all 4-7 inch phones and most thick cases."
      ],
      "description": "N/A",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "JOREST 120Pcs Micro Fuses, Low Profile Mini Fuse Kit, Micro Fuses Assortment Kit for Car/RV/Truck/Motor (2Amp 3A 5A 7.5A 10A 15A 20A 25A 30A 35A 40A) +1Blade Automotive Fuse Puller",
      "imagesCSV": "81mXtsG5yPL.jpg,71F55obqaOL.jpg,81WmsdObllL.jpg,81IaLOOczkL.jpg,81ZoDp1ndWL.jpg,71HjeMOsL1L.jpg,61CPXaEONqL.jpg",
      "manufacturer": "Jorest",
      "asin": "B09B7LK9WF",
      "brand": "Jorest",
      "features": [
        "【High cost-effective fuse kit】-- (Not mini type,”mini“has a big differennce with ”low proflie mini\")The micro fuse kit includes 120pcs micro size fuses and a fuse puller. The micro car fuses have 11 current specifications (2A /3A / 5A/ 7.5A/ 10A/ 15A/ 20A/ 25A/ 30A/ 35A/40A).",
        "【Reasonable quantity matching】-- According to market research data, we have increased the number of low profile fuses with commonly used current specifications of 10A/ 15A/ 20A/ 25A, and reduced the number of other less-used fuses. The number is reasonable and and the use time of fuses is extended.",
        "【High quality, easy to identify】-- The micro fuse is made of environmentally friendly plastic and zinc alloy. The fuse of each current specification is distinguished by different colors, and the current specification number is marked on the top of each fuse, which is easy to identify.",
        "【Precise protection】-- According to many experimental data, the micro fuses automotive we designed can quickly melt itself when the electrical appliance reaches the rated current, and accurately protect operation of the electrical appliance.",
        "【Installation Instructions】-- The micro fuse assortment kit contains fuse installation instruction to help you replace and install the fuse correctly. It is recommended that you compare the original car fuse with our fuse size or search the car fuse model on the Internet to choose the fuse suitable for your car model."
      ],
      "description": "N/A",
      "parentTitle": "JOREST Micro/Mini/Standard Car Fuse Kit - Blade Fuses Automotive + Auto Fuse Puller - Replacement Fuses Assortment for Car/RV/Truck/Motorcycle(2Amp 3A 5A 7.5A 10A 15A 20A 25A 30A 35A 40A)",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Leather Honey Leather Conditioner, Non-Toxic & Made in the Usa Since 1968. Protect & Restore Leather Couches & Furniture, Car Interiors, Boots, Jackets, Shoes, Bags & Accessories. Safe for Any Colors",
      "imagesCSV": "51Uej4PUARL.jpg,71CXfiptpvL.jpg,71Ew9SL9erL.jpg,813wx3HM3VL.jpg,91tErjUgRUL.jpg,61jysz1GAkL.jpg",
      "manufacturer": "Leather Honey",
      "asin": "B003L2ZVRG",
      "brand": "Leather Honey",
      "features": [
        "Powerful Leather Conditioner: Leather Honey penetrates deep to protect new leather and rejuvenate dry leather and old leather. This non-toxic leather conditioner has no silicone, solvents or animal products",
        "Restore All Types of Leather: Soften & moisturize leather furniture, car seats, shoes & belts. Great for all colors of leather, including white. Use on leather upholstery, boots, purses, saddles & tack. Not for use on suede, faux leather or vinyl",
        "Non-sticky, Odorless, Water Repellant Formula: Protect your leather all year long from snow & rain. Our time-tested, non-toxic formula is water-repellant, non-sticky, fragrance-free, and contains no silicone, solvents or animal products",
        "Safe for You, Safe for Leather: Made with non-toxic, high-quality ingredients that make your leather last longer. Free of PFAS forever chemicals and safe for people, pets & your leather. Provides 6 months of leather protection",
        "American Made Since 1968: Our premium leather care formulas have had a cult following among leather experts, retailers and high-end car and furniture makers and enthusiasts for over 50 years."
      ],
      "description": "N/A",
      "parentTitle": "Leather Honey Leather Conditioner, Since 1968. for All Leather Items Including Auto, Furniture, Shoes, Purses and Tack. Non-Toxic and Made in The USA",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Drift Car Air Freshener - Stone Air Freshener - Car Odor Eliminator - Pine Scent Refill - NO CLIP INCLUDED",
      "imagesCSV": "61s7HbbC+oL.jpg,71YWZDdbITL.jpg,81RDR4wJcaL.jpg,81q0j66WRmL.jpg,81nzlLf9YRL.jpg,81lYkKkIIEL.jpg,71nISzDssTL.jpg",
      "manufacturer": "drift",
      "asin": "B0CP4CWMYW",
      "brand": "drift",
      "features": [
        "CAR FRESHENERS: Drift car air fresheners are made to uproot your typical air freshener. We've combined sophisticated, functional design with real, designer and luxury grade scents. This set includes a metal clip to attach to your car visor.",
        "BEST NATURAL FRESHENERS: This natural car air freshener is designed to keep your ride fresh. Our Pine scent has notes of mountain pine, moss, & cedar Made of an organic stone blend specifically formulated for strong, even scent distribution all month long.",
        "LONG LASTING: Crafted with our natural essential and fragrance oil blends to deliver a great scent free of harmful chemicals all day. Looks good, smells good, all good.",
        "SIMPLE DESIGN: Attach metal clip to visor so the ledge faces down when closed. Open one side of bag until scent dissipates and freshener doesn't have any visible oil on surface. Attach the scent block to the clip, it will magnetically snap in, make sure there is no overhang on either side of the clip.",
        "REFILLABLE SCENTS: Keep scent sealed in bag and out of the sun until ready for use. Replace the scent block at minimum every 30 days. Do not use on any other surface than provided metal visor clip."
      ],
      "description": "Meet stone, our brand-new car air freshener designed to keep your ride fresh. Made of an organic stone blend specifically formulated for strong even scent distribution all month long. Attach the magnetic back to your drift visor clip and enjoy our longest-lasting freshener yet. Attach metal clip to visor so the ledge faces down when closed. Metal clip not included with refill pack. Open one side of bag until scent dissipates and scent block doesn’t have any visible oil on surface. Attach the scent block to the clip, it will magnetically snap in, make sure there is no overhang on either side of the clip. Keep scent sealed in bag and out of the sun until ready for use. replace the scent block at minimum every 30 days. Do not use on any other surface than provided metal clip, contact with oils can damage some surfaces. Drift products are vegan, cruelty-free and pet-friendly with no parabens, phthalates, formaldehyde, dea, mineral oil, petroleum, propylene or dichlorobenzene. All of the good, none of the bad.",
      "parentTitle": "Stone Air Freshener Refill - Variety Pack",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Reconstitution Solution 2-Pack - 30ml - Ultra Clean Solution in Premium Glass Vials | Made in USA",
      "imagesCSV": "712JdzNZq+L.jpg,616vW5QJutL.jpg",
      "manufacturer": "Aqua Science",
      "asin": "B0BCSRGSGL",
      "brand": "Aqua Science",
      "features": [
        "2-PACK (30ml each): Solution sealed with care. Ingredients are 99.1% deionized water and 0.9% benzyl",
        "TRANSPARENT GLASS: We use clear, premium glass bottles instead of cheap plastic, or amber-colored glass where you're unable to see the contents inside.",
        "QUALITY START TO FINISH: Deionized water system with a UV passthrough ultimately providing the purest formulation.",
        "MANUFACTURED IN-HOUSE",
        "MADE IN USA: Proudly made in Columbus, Ohio by Aqua Science Inc, since 1983.",
        "Reinforced packaging to help avoid any issues during transit."
      ],
      "description": "Dilution Solution - 2, 30ml bottles. Made in the USA",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Yuoyar 2 Packs Sunglasses Holders for Car Visor - Magnetic Leather Sunglasses Holder and Ticket Card Clip - Car Visor Accessories (Pink)",
      "imagesCSV": "71ETG6i9lsL.jpg,71qpqLPmvqL.jpg,71kVm+LcsUL.jpg,81gDzS688JL.jpg,81MLzwQGGsL.jpg,71-nNcbpUbL.jpg,61vFHDn-29L.jpg",
      "manufacturer": "Yuoyar",
      "asin": "B0DYCY2Y6Q",
      "brand": "Yuoyar",
      "features": [
        "Universal Fit: Our package includes two pieces of car sunglass holders that fit almost all car models. Simply clip the holder onto your visor and you’re ready to go.",
        "Easy to Use: Our special cloth handle design makes it easy to open the magnetic flap with just one hand. You can quickly and easily put your sunglasses into the holder and take them out when you need them.",
        "Full Leather Wrap: The car visor sunglasses holder is made of high-quality leather, featuring a soft texture that fully envelops the clip, ensuring your visor and glasses remain undamaged.",
        "Upgraded Elastic Cloth: We’ve upgraded the elastic cloth at the end of the holder to provide easy access to all kinds of glasses. The elastic cloth can stabilize your glasses without damaging the legs.",
        "Purchase with Confidence: If you have any questions or concerns, please feel free to contact us for assistance. Our customer service team is available online at any time to provide you with the best solution. We hope you enjoy our products and services."
      ],
      "description": "N/A",
      "parentTitle": "Yuoyar 2 Packs Sunglasses Holders for Car Visor - Magnetic Leather Sunglasses Holder and Ticket Card Clip - Car Visor Accessories",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "5 PLUS® 13\" Rear Wiper Blade Replacement for Hyundai Elantra 2020-2013 /Jaguar E-Pace 2020 2019 2018 /Kia Forte 2018-2014 / Alfa Romeo Stelvio 2022-2018 BACK Windshield Wiper Blade (A310H)",
      "imagesCSV": "71uN2GriZ1L.jpg,710BOj4m8kL.jpg,61IbLNa30lL.jpg,71LCLVf4eML.jpg,710JIcP18wL.jpg,71grXhR3JWL.jpg",
      "manufacturer": "5 PLUS",
      "asin": "B0BCW3BWGF",
      "brand": "5 PLUS",
      "features": [
        "【Make sure this fits 】- Use amazonconfirmrdfit, Enter your model.",
        "【AAAA Grade Natural rubber】 PTFE coated high quality rubber - quiet/clean/no trace.",
        "【Guarantee】: 60 days free return, no worry, no risk, no problem.",
        "【Quality】OEM standard, exact fit replacement of original rear wiper blades.",
        "【Easy installation】 - Easy installation, easy installation only 1 minute."
      ],
      "description": "N/A",
      "parentTitle": "rear windshield wiper blade FOR MY CAR",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Febreze Unstopables Car Odor-Fighting Car Freshener Vent Clip Fresh Scent, .07 oz. Car Vent Clip, Pack of 4 (Packaging may vary)",
      "imagesCSV": "71NyyaFYXFL.jpg,81DAD5l382L.jpg,81J2rVKeS9L.jpg,81KcmIJmJfL.jpg,81hI-msvdmL.jpg,8168r3RGoGL.jpg,814DpvQrQ5L.jpg,71UFJvgh2KL.jpg",
      "manufacturer": "Procter & Gamble",
      "asin": "B0BXMNC25J",
      "brand": "Febreze",
      "features": [
        "Fights trapped car odors with an irresistible scent",
        "Make every day smell like laundry day with the crisp, airy scent of Fresh",
        "Easy to install: Click to activate, clip into vent, adjust scent level, and sniff on",
        "Adjust the scent intensity from low to high and explore your bold side",
        "Delivers even scent for up to 40 days (on low) with a fresh that works with your car’s airflow"
      ],
      "description": "From soccer cleats to French fries, everyday odors get trapped in your car and follow you around town. Kick ’em to the curb and enhance your drive with some bold freshness. Febreze Unstopables CAR Vent Clips fight odors trapped in your car, minivan, or ice cream truck with an irresistible scent. These powerful but tiny car vent air fresheners have incredible odor blockers and odor fighters that fight all those stinks and smells built up from your longest, commute-iest days. Simply push the vent clip firmly until you hear it click to activate fragrance, then clip onto your car vent and drive stink-free for up to a whole 40 days. With the airy, just-washed scent of Fresh, you’ll want this crave-worthy scent within reach. So, freshen up your ride and breathe happy. And if you’re looking for an explosion of scent at home, try Febreze Unstopables Touch Fabric Spray and get a burst of freshness with every touch.",
      "parentTitle": "unstopables carstandard deodorizerstandard deodorizervent clipcar",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "HoogaLife Car Air Freshener Diffuser 2 Pack Hanging Sugary Pink Car Air Freshener for Women 45+ Days Long Lasting Fragrance Made in USA",
      "imagesCSV": "41b0Fc9PlOL.jpg,51XiyGmWrNL.jpg,51SucyepuCL.jpg,61qQ6rsHHmL.jpg,41h5QLkHb9L.jpg",
      "manufacturer": "The Essential Oil Company",
      "asin": "B0D45ZCH2F",
      "brand": "HoogaLife",
      "features": [
        "【Hanging Design】Car air freshener diffuser has a hanging design - Quality wooden bottle caps have a spiral design on the inside, closely integrated with the crystal clear glass bottles, experience the perfect blend of style and functionality, make every drive a sensory delight with our car air freshener diffuser",
        "【Made in the USA】Our hanging air freshener is made right here in the USA from sustainably sourced wood, and the bottle is made of thick high-quality glass, from production to processing, every step is strictly controlled to ensure durability. Our car air fresheners diffuser are made from the better quality essential oils and are free of alcohol and harmful chemicals, family members can use it safely",
        "【Long-Lasting Aroma】The car air freshener diffuser have a long-lasting smell, eliminating odors and creating a warm atmosphere, Transform your car into a fragrant oasis, pink garden and sexy whiskey. Our car air freshener is your ticket to a serene and pleasant commute",
        "【Easily Installed】The hanging car air freshener glass bottle can store 8ml volume of perfume(two bottles of aroma lasts at least 90+ days). Car diffuser when using, just remove the safety helmet and invert the bottle for 10 seconds, let the fragrance soak through the bottle cap, and then use the attached rope to hang it from the rearview mirror, It will not hinder the line of sight but also enhance the delicacy of the car",
        "【Satisfactory After-Sales】Hoogalife car air fresheners are great as a birthday gift or any car gift to friends or family. The car air freshener diffuser can be used for two years if unopened and stored in a cool, dry place. If car air fresheners fell short on your expectations, or there is any problem with the product. Please don’t be hesitated to contact us, we are standing by and will response within 24hrs"
      ],
      "description": "HoogaLife Car Air Freshener Diffuser Essential Oil",
      "parentTitle": "HoogaLife Car Air Freshener Oil Diffuser",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Everlasting Comfort Doctor Recommended Memory Foam Seat Cushion for Office Chairs & Car Seat - Ergonomic Office Desk Accessories for Tailbone Pain Relief, Sciatica & Back Support",
      "imagesCSV": "81vo2gHf4LL.jpg,71SfLlD8eqL.jpg,81r3c9D8nNL.jpg,91VS3R5C7fL.jpg,81vP+9RbxsL.jpg,710eT8KjdhL.jpg,81l75x2YUDL.jpg,71pRETPhfiL.jpg,81KnU5Uw4BL.jpg",
      "manufacturer": "Upper Echelon Products LLC",
      "asin": "B01EBDV9BU",
      "brand": "Everlasting Comfort",
      "features": [
        "OFFICE CHAIR SEAT CUSHION: Our everlasting comfort seat cushion is ideal for extended workdays. Made with premium memory foam, it supports the butt, conforming to your body for all-day comfort in office chairs or car seats",
        "ERGONOMIC SEAT CUSHION FOR OFFICE CHAIR: Our desk chair cushion has a U-shaped coccyx cutout, promoting correct spinal alignment and offering lower back support for office chair use, ultimately relieving back pain",
        "CAR SEAT CUSHION: Our seat cushion for office chair use also provides a comfortable seating experience in cars. This seat cushion for lower back pain relief doubles as a car seat cushion, suitable for long travel or commute",
        "MULTI-USE SEAT CUSHIONS: Our foam seat cushion fits common office chairs, desks, car seats, airplane seats, and more. Check the dimensions (17x13.2x2.4 inches) to ensure proper fit for your desk chair or car seat",
        "MEMORY FOAM SEAT CUSHION: Expect ultimate comfort with our desk chair cushion for long sitting. If unsatisfied, receive a full refund or replacement. Comes with a removable, machine washable, slip-resistant cover for your convenience"
      ],
      "description": "N/A",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Motor Trend FlexTough Floor Mats for Cars, Gray Deep Dish All-Weather Mats, Waterproof Trim-To Fit Automotive Floor Mats for Trucks SUV, Universal Liner Car Accessories",
      "imagesCSV": "71J7ce5WgfL.jpg,81C+QSzGIPL.jpg,81gpnvhW5hL.jpg,91fK1276iUL.jpg,813H7+F3uvL.jpg,81ErfomyS9L.jpg,81p6Fs5vjHL.jpg,91IfYiVLOJL.jpg",
      "manufacturer": "Motor Trend",
      "asin": "B01A1IJ678",
      "brand": "Motor Trend",
      "features": [
        "GENUINE FLEXTOUGH CAR FLOOR MATS - Motor Trend's FlexTough car floor mats provide maximum all-weather protection for your car's interior from snow, rain, and mud",
        "UNIVERSAL FIT - Designed to fit most vehicles, these flexible rubber floor mats mold to the shape of your car's interior. Front Measurements: 27\" L x 20\" W, Rear Measurements: 51\" L x 14\" W",
        "HEAVY-DUTY RUBBER - Built with a proprietary rubber blend, our floor mats for cars are made to last and always protect your vehicle interior without deforming or cracking",
        "TRIM TO FIT DESIGN - The trimmable shape of our universal automotive floor mats fits most vehicles. You can further trim the floor mats to your vehicle's specifications",
        "EASY TO CLEAN - Spills, dirt, and stains wipe right off these all-weather car floor mats. Just use some soap and water whenever cleaning is needed"
      ],
      "description": "Motor Trend FlexTough Floor Mats for Cars, Gray Deep Dish All-Weather Car Mats, Waterproof Trim-To Fit Automotive Floor Mats for Cars Trucks SUV, Universal Floor Liner Car Accessories",
      "parentTitle": "Motor Trend FlexTough Floor Mats for Cars",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "HOTOR Foldable Trunk Organizer - SUV & Sedan, 3-Compartment, 35.4\"×14.2\"×10.6\" Black Car Accessory Organizer",
      "imagesCSV": "81WXhH2wD+L.jpg,81w++W17gbL.jpg",
      "manufacturer": "HOTOR",
      "asin": "B0DLFFPXC6",
      "brand": "HOTOR",
      "features": [
        "SPACIOUS STORAGE: With 3 large compartments and 6 extra mesh pockets, this car trunk organizer provides ample space to neatly store groceries, tools, sports equipment, and more. Keep your car trunk clutter-free and organized on every trip.",
        "DURABLE MATERIALS: Made of sturdy Oxford cloth with reinforced stitching on high-wear areas, this car organizer for trunk is built to last through heavy use. The thickened base panel and handles enable this product to bear over 60lb capacity.",
        "FLEXIBLE CONFIGURATION: Adjustable side Velcro strips allow you to fold the car storgae organizer fully or halfway to fit your storage needs. Just put it in the trunk, backseat, front seat, or wherever you want in the car.",
        "CONVENIENT ACCESS: HOTOR car trunk organizer for SUV is equipped with 3 compartments and 6 stretchy mesh pockets to make items easy to see and grab when needed. No more digging around a messy trunk to find what you need. Just grab and go.",
        "PORTABLE & SPACE-SAVING: When not in use, simply fold the SUV trunk organizer flat with the Velcro strips. The collapsible design is perfect for freeing up trunk space or storing the organizer neatly at home. An essential item for tidy travels."
      ],
      "description": "Heading out for a family road trip and want to keep your cars tidy? This car trunk organizer for sedans is just what you need.\n1. With multiple compartments and pockets, it is not only used for truck organizers and storage (as car accessories) but also can be a storage box for daily life! It can not only meet your car storage and organization needs in car use scenarios. You can even use it for household sundries, such as books, clothing, and tools.\n4. The durable Oxford fabric and reinforced stitching allow these car organizers and storage to stand up to heavy use trip after trip. Bring organization and convenience with this premium-quality trunk organizer. Your whole family will enjoy the clutter-free, stress-free journey.",
      "parentTitle": "HOTOR Foldable Trunk Organizer - SUV & Sedan Compatible, Sturdy Car Organization for Accessories, Tools, Sundries",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Aujen Silicone License Plate Frames Black, 2 Pack Car License Plate Frame, Universal US Car Black License Plate Holders Brackets Rust-Proof, Rattle-Proof, Weather-Proof Car Accessories(Black)",
      "imagesCSV": "71c7pbvO5QL.jpg,71AXQecjjTL.jpg,71ERnwbHYrL.jpg,719-5i51+JL.jpg,61mrqqdYdwL.jpg,51Sld32BQPL.jpg",
      "manufacturer": "Aujen",
      "asin": "B07YZFM2FQ",
      "brand": "Aujen",
      "features": [
        "For U.S. License plate. - Aujen license plate frames use the high quality silicone materials, which protect license plate from rusting and damaging.",
        "Rust-proof. Rattle-proof. Weather-proof Car Accessories. - Made from industrial-grade silicone, this liscen plate frame have soft flexible surface that prevents any scratches or rattles. And these lisences plate frame will not rust even if it is exposed all year round to wind and rain.",
        "Humanized design - Our automotive license plate frames have 3 drainage holes to release water. Black matte material does not discolor or rust and gets better with use.",
        "Totally street legal - With zero license plate & sticker obstruction, this license plate frame for car won’t bring you trouble. No more worrying about being stopped by the police.",
        "ALL-ROUNDED PROTECTION: Aujen licence plate frames are designed to provide an all-rounded protection to your car plate. The soft silicone material can effectively prevent the car plate from deformation and the car paint from scratches!"
      ],
      "description": "N/A",
      "parentTitle": "Aujen Silicone License Plate Frames Black, Car License Plate Frame, Universal US Car Black License Plate Holders Brackets Rust-Proof, Rattle-Proof, Weather-Proof Car Accessories(Black)",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "CAR GUYS Plastic Restorer | Bring Plastic, Rubber, and Vinyl Back to Life! | User Friendly Trim Restorer | Safe Auto Detailing Supplies | 8 Oz Kit with Foam Applicator",
      "imagesCSV": "51QqQuocBcL.jpg,71aXrJoUBaL.jpg,71Jig7j4mOL.jpg,81F0CPKpdZL.jpg,71cbvNkUbVL.jpg",
      "manufacturer": "CAR GUYS",
      "asin": "B071FRWWRF",
      "brand": "CAR GUYS",
      "features": [
        "RESULTS THAT LAST! – Are you tired of wasting time and money on plastic restorers that claim to last long? They always look great in the beginning.. only to fade after a few days, or maybe a month if it’s decent! Our product will renew, seal, and protect any interior/exterior surface and WILL LAST.. for several MONTHS!",
        "SURVIVES RAIN! – Does this sound familiar? You spent all that time perfectly applying a new product and it looks great! Wow, you finally found the one! BUT… after the first rain-fall, you look in disgust at yet another product that left ugly streaks down the side of your beautiful vehicle... STOP THE MADNESS! Our product repels water and stays looking good for several months!",
        "NO MORE OILY MESS! – Do you hate all the oily, greasy gel dressing products that stay wet and never fully dry? That describes about 90% of the plastic and trim restorers on the market today! Well lucky you! We made a product that will restore and leave a great finish, but more importantly, it will completely dry to the touch! No more ruining your detailing towels and supplies with cheap oil-based products!",
        "WHY CHOOSE CAR GUYS? – We Care About Quality! Our products are made with the latest advancements in science, using the best equipment available. This helps us make consistently high-quality products that always work great! Every formula we make is mixed and bottled, in the USA, by hard working Americans!",
        "REAL CUSTOMER SUPPORT! – The CAR GUYS team actually cares about customer satisfaction! If you ever have any concerns, let us know, and a person from our team will do everything in our power to make it right."
      ],
      "description": "N/A",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Valvoline Advanced Full Synthetic SAE 0W-16 Motor Oil 1 QT, Case of 6",
      "imagesCSV": "61gT5kKFwtL.jpg,71BBUqeOLwL.jpg,71aOQRn-K6L.jpg,71aqnbm9C7L.jpg,716y6VLPhFL.jpg,71jqfCCM7FL.jpg,71CBfgY52YL.jpg,81MxbPUE0WL.jpg",
      "manufacturer": "Valvoline",
      "asin": "B07ZCQPBX5",
      "brand": "Valvoline",
      "features": [
        "Advanced protection against the four main causes of engine breakdown: wear friction heat and deposits",
        "Exceeds industry standards for wear protection and fuel economy",
        "Superior antioxidants resist motor oil breakdown in extreme conditions",
        "Full synthetic formula offers 24X stronger protection against engine-killing contaminants than the leading full synthetic motor oil",
        "Meets or exceeds all requirements of ILSAC GF-6B, API SP, API SN with SN Plus",
        "American made and formulated, from the Original Motor Oil brand trusted for more than 150 years"
      ],
      "description": "Anything a conventional motor oil can do Valvoline Advanced Full Synthetic improves upon. In fact, Valvoline Advanced Full Synthetic 0W-16 Motor Oil provides 24X stronger protection against engine-killing contaminants than the industry-leading full synthetic brand. Engineered with the highest quality base oils and additives, it delivers 25% better deposit protection and 40% better protection against wear than industry standards. Less wear means improved fuel efficiency, stronger performance, and a longer-lasting engine. Short trips or stop-and-go traffic are hard on a car, causing extreme heat and temperature fluctuations inside your engine that can lead to harmful sludge and extra friction. Valvoline Advanced Full Synthetic Motor Oil uses additional boosters to minimize the effects of heat. And in the winter, it flows easily at low temperatures for enhanced cold start protection. Trade up to one of our best motor oil for superior performance in all types of environments and conditions, and ensure your Honda Civic, Nissan Rouge, Ford F150, Dodge Ram, GMC Sierra (or most any other make or model) is a smooth-running machine. Valvoline Advanced Full Synthetic Motor Oil, made and formulated in America, from the Original Motor Oil brand.",
      "parentTitle": "Valvoline Advanced Full Synthetic SAE",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Holikme 6Pack Drill Brush Power Scrubber Cleaning Brush Extended Long Attachment Set All Purpose Drill Scrub Brushes Kit for Grout, Floor, Tub, Shower, Tile, Bathroom and Kitchen Surface，Yellow",
      "imagesCSV": "81aQXkvZivL.jpg,71jw7wUlPaL.jpg,715tAzCqpIL.jpg,71ZNfPA7OSL.jpg,81F11kx9bsL.jpg,71uyJx3KfsL.jpg,71stgcuWEDL.jpg",
      "manufacturer": "Holikme",
      "asin": "B07G7XG6BV",
      "brand": "Holikme",
      "features": [
        "5 shape of brushes clean your bathtub, grout, upholstery, bathroom surface, floor, tile, shower, toilet and carpet etc, Nylon bristles will not scratch surfaces of them.",
        "Extended reach attachment help brush to clean the tight spaces or hard-to-reach areas such like stove grates, drip pans, crevices, car etc",
        "Car cleaning brush: suitable for car wheels, tires and other multi-functional cleaning",
        "Attention!! Product size Tip: The diameter of the connecting rod connecting the drill is 1/4inch. Before buying, please check whether the drill fits this size (if you do not check the drill size, there may be a mismatch) If the product is not suitable for the drill, please contact our customer service in time to arrange returns, we support all unsuitable returns.",
        "Cordless Drill NOT included!!! Tips: It is recommended to use with other cleaning products for better results"
      ],
      "description": "N/A",
      "parentTitle": "Holikme Drill Brush Attachment",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "BOSCH 24A19A ICON Beam Wiper Blades - Driver and Passenger Side - Set of 2 Blades (24A & 19A)",
      "imagesCSV": "71Wm2aTYp5L.jpg,61JPO+tzb-L.jpg,71HR+6MMShL.jpg,61JBUG6wLTL.jpg,61IY2lIKNtL.jpg,71Atw69eZ2L.jpg",
      "manufacturer": "Bosch",
      "asin": "B07VH2CXQ3",
      "brand": "Bosch Automotive",
      "features": [
        "Bosch ICON makes windshield wiper replacement simple and easy with 2-pack bundles that include popular driver and passenger side blade length combinations designed to fit specific vehicles",
        "Exclusive fx dual rubber technology resists heat and ozone deterioration and has proven to last up to 40% longer than other premium wiper blades",
        "Patented beam design features exclusive tension spring arcing technology, that creates a fit that's custom-contoured to the curvature of each side of the windshield, for optimized visibility even under extreme weather conditions",
        "Built-in flexible asymmetric spoiler distributes uniform downward force along the entire length of the wiper blade, holding it firmly to the windshield at higher speeds to prevent lift-off, ensuring a cleaner wipe",
        "Quick, easy installation with original equipment quality hook adapter that is compatible with 9x3mm and 9x4mm hook wiper arms (not compatible with side lock, pinch tab, or top lock wiper arms which require \"OE\" suffix part numbers)",
        "NOTE: Enter vehicle Type, Year, Make, and Model into fit checker above to ensure compatibility - due to wiper arm variations, it is no longer possible to choose replacement wiper blades by length only"
      ],
      "description": "Bosch ICON makes windshield wiper replacement simple and easy, with 2-pack bundles that include popular driver and passenger side blade length combinations designed to fit specific vehicles. ICON wiper blades feature Bosch's exclusive fx dual rubber technology that resists heat and ozone deterioration and has proven to last up to 40% longer than other premium wiper blades. The patented ICON beam design features exclusive tension spring arcing technology that creates a fit that's custom-contoured to the curvature of each side of the windshield, for optimized visibility even under extreme weather conditions. Built-in flexible asymmetric spoiler distributes uniform downward force along the entire length of the wiper blade, holding it firmly to the windshield at higher speeds to prevent lift-off, ensuring a cleaner wipe. Quick and easy installation with original equipment quality hook adapter that is compatible with 9x3mm and 9x4mm hook wiper arms (not compatible with side lock, pinch tab, or top lock wiper arms which require \"OE\" suffix part numbers).",
      "parentTitle": "BOSCH ICON Wiper Blades",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Window Visors Rain Guards for 2007-2012 Hyundai Santa Fe, Out-Channel Window Vent Wind Deflectors Visors Shades for 07-12 Hyundai Santa Fe",
      "imagesCSV": "71-chdQVKcL.jpg,51IGitDi6GL.jpg,713UqoJ4TFL.jpg,81eR0GwLGFL.jpg,611fkMpSWWL.jpg,71Zy82DjEpL.jpg",
      "manufacturer": "YQAUTEC",
      "asin": "B0DFY5ZN4Y",
      "brand": "YQAUTEC",
      "features": [
        "【Perfect Fit】YQAUTEC Out-Channel Window Visors Rain Guards Shield fit for 2007 2008 2009 2010 2011 2012 07 08 09 10 11 12 Hyundai Santa Fe, Side Window Vent Wind Deflectors Visors Shades.",
        "【Premium Quality】Made from high-quality and durable anti-shatter material, these Rain Guards have great performance in UV & scratch resistance test. And those 3M-graded tape helps stick firmly.",
        "【Fully Functional】You could enjoy the fresh air and keep the rain drops out after installing the vent visors and keeping the window cracked open, no foggy worries.",
        "【Easy Installation】Outside Mount Style. No drilling or special hardwares required. Test fit the visors first to make sure it's the right model before you tape them on.[NOTE: Don't wash your car 24 hours after installation.]",
        "【Warranty& Support】1-YEAR WARRANTY. LIFETIME SUPPORT. If you have any questions, just let us know and we will reply ASAP."
      ],
      "description": "N/A",
      "parentTitle": "YQAUTEC A Rain Guards",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Meguiar's Hot Shine Tire Foam - High Goss Tire Shine That Cleans, Shines, and Protects in One, Deep, Black Shine with Conditioners and UV Protection to Help Keep Tires Looking Like New, 19 Oz Aerosol",
      "imagesCSV": "71VnZ+-tfDL.jpg,81st4wLL6IL.jpg,817KsWuzJUL.jpg,816sujLmwUL.jpg,91YKkwU2pvL.jpg,812tVl22vvL.jpg,81RFRTUXPlL.jpg,91rAnb1takL.jpg",
      "manufacturer": "Meguiar's",
      "asin": "B000EOVLR8",
      "brand": "Meguiar's",
      "features": [
        "SPRAY TIRE DRESSING: Cleans, shines, and protects in one easy step with hands-off application",
        "GLOSSY TIRE SHINE: Thick, active foam powers through buildup to reveal a deep, black shine",
        "EASY SPRAY FOAM: Convenient and easy-to-use foam that stays where you spray, then dissolves clear for less mess. Simply spray and walk away!",
        "UV PROTECTION: Conditioners and UV protection help keep tires looking like new",
        "LASTS FOR WEEKS: With water-resistant polymers, the shine last for weeks on end"
      ],
      "description": "Clean, shine and protect your tires in one convenient and easy step. Meguiar's Hot Shine Tire Foam powers through buildup to reveal a deep black shine. The thick, active foam lifts and releases dirt and grease while creating a glossy black sheen. The easy-to-use foam clings to the rubber so it stays where you spray, then dissolves clear for less mess. With its water-resistant polymers and UV technology, this formula gives your tires a clean, shiny, well-maintained look for weeks on end.",
      "parentTitle": "Meguiar's Hot Shine Spray Can",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Unique RV Digest-It+ Extra-Strength Ultra-Concentrate Gallon Refill - 128 RV Toilet Treatments - Eliminates Smells and Liquifies Waste (128 oz)",
      "imagesCSV": "71UAhCGUILL.jpg,81qy+FMI5AL.jpg,81YUf+eUHsL.jpg,817PpYwMnDL.jpg,81WQl5r1R9L.jpg,91mKtnYCXTL.jpg",
      "manufacturer": "Unique Manufacturing & Marketing",
      "asin": "B0DFZ67HYX",
      "brand": "Unique",
      "features": [
        "Faster and more effective waste and RV tissue digester. RV Digest-It+ Ultra-Concentrate RV black tank treatment breaks down waste and all brands of toilet paper, preventing pyramid plugs and making dumping easier.",
        "The Power of Plus. Our strongest complete RV tank treatment in a large, gallon size so you can refill your no-fuss bottle. The 128 ultra-concentrated treatments are significantly stronger than RV Digest-It Classic. Breaks down clog-causing waste and eliminates porta potty smells and sewer stink in your tank.",
        "Prevents sensor probe problems. Stops black water tank sensor probes from misreading by liquifying waste before it builds up and clings to probes. Digests grease, oil, and food debris in gray tanks.",
        "RV Digest-It Plus Ultra camper toilet treatment is designed to work with The Unique Method to ensure clog- and stench-free camping, no matter what your style is: hookups, dry camping, full-time, extreme heat.",
        "Helping you experience worry-free RVing is our top priority, so we’re doing something extraordinary. Every purchase of Unique Camping + Marine products includes exclusive access to our Unique Cares program--expert assistance from our Colorado-based Certified RV Tech Team to help solve your wastewater issues."
      ],
      "description": "N/A",
      "parentTitle": "Unique RV Digest-It Holding Tank Treatment",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "GOOACC 5 PCS Nylon Auto Trim Removal Tool Kit No-Scratch Removal Tool Kit for Car Panel & Audio Dashboard Dismantle Red",
      "imagesCSV": "61abJPDQVOL.jpg,619vkRb9EdL.jpg,71cj3jJFQoL.jpg,61DLLnLUQ8L.jpg,71RDP2zdCyL.jpg,71z5446sl5L.jpg,71pMdsK00tL.jpg,61+Cgwxit0L.jpg",
      "manufacturer": "GOOACC",
      "asin": "B0B6W1MRB2",
      "brand": "GOOACC",
      "features": [
        "Nylon Material: Made of impacted resistant nylon fiber material with high level craftsmanship, it’s non-toxic, durable and not like brittle material which is prone to bent or crack",
        "Multi-function tools:These 5 PCS different kinds of trim tools used for car audio/radio system installing or removing, dash panel, moldings, emblems, window trims or automotive interior repairing and furniture restoration",
        "Good Helper: Whenever you need them, they are always here to help you. It would be an excellent choice to work with this kit",
        "Ergonomic Design: GOOACC trim removal tool kit is made in accordance with ergonomics design with super lightweight and easy handheld features which effectively effort saving for various interior and exterior car trimming",
        "Package Include:Including 4 pcs car dash panel removal tool and 1 fastener remover, total 5 pcs auto trim removal tool"
      ],
      "description": "N/A",
      "parentTitle": "GOOACC",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Drift Car Air Freshener - Wood Fragrance - Automotive Odor Eliminator - Car Fresheners Long Lasting - Open Air Scent Refill - Pack of 3 - NO CLIP INCLUDED",
      "imagesCSV": "81TYf03obTL.jpg,41c-P9w6cHL.jpg,81SwkEB4iQL.jpg,71b8GpYWOTL.jpg,81nzlLf9YRL.jpg,81WjO6ensIL.jpg,71MDBvzTgaL.jpg",
      "manufacturer": "drift",
      "asin": "B0D463HXK5",
      "brand": "drift",
      "features": [
        "WOOD CAR FRESHENERS: Drift car air fresheners are made to uproot your typical air freshener. We've combined sophisticated, functional design with real, designer and luxury grade scents.",
        "MADE IN THE USA: Our wood freshener is made right here in the USA from sustainably sourced wood, and magnetized to fit perfectly on your car visor with our metal clip. Our Open Air scent has notes of fresh air, crisp linen, morning dew.",
        "LONG LASTING: Crafted with our natural essential and fragrance oil blends to deliver a great scent free of harmful chemicals all day. Looks good, smells good, all good.",
        "SIMPLE DESIGN: Attach metal clip to visor so the ledge faces down when closed. Open one side of bag until scent dissipates and freshener doesn't have any visible oil on surface. Attach the scent block to the clip, it will magnetically snap in, make sure there is no overhang on either side of the clip.",
        "REFILLABLE SCENTS: Keep scent sealed in bag and out of the sun until ready for use. Replace the scent block at minimum every 30 days. Do not use on any other surface than provided metal visor clip."
      ],
      "description": "meet wood, made to uproot your typical air freshener. we've combined sophisticated, functional design with real, designer grade scents. our wood freshener is made right here in the usa from sustainably sourced wood, and magnetized to fit perfectly on your visor with our metal clip. soaked in our drift essential fragrance oil blends to deliver a great scent free of harmful chemicals. looks good, smells good, all good.",
      "parentTitle": "Wood Air Freshener Refill - Variety Pack",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    },
    {
      "title": "Mobil 1 FS European Car Formula Full Synthetic Motor Oil 0W-40, 5 Quart",
      "imagesCSV": "61fZFMnctkL.jpg,415MZuoUB-L.jpg,411AC8H7FLS.jpg,61YS-vSdNxL.jpg,61acx9awfRL.jpg,71UVFahNxBL.jpg,61c9N8FH+NL.jpg,61eAjv6Y0kL.jpg",
      "manufacturer": "Mobil 1",
      "asin": "B00HG76A9A",
      "brand": "Mobil",
      "features": [
        "Mobil 1 FS European Car Formula full synthetic motor oil 0W-40 helps to extend engine life even in severe conditions",
        "Helps to control oxidation to prevent oil breakdown and maintain excellent viscosity for up to 10,000 miles between oil changes*",
        "Provides outstanding engine wear protection and performance with uniform synthetic oil molecules for better friction reduction",
        "Keeps your engine running like new by working to prevent damaging deposits and sludge buildup",
        "Provides excellent internal engine heat protection (up to 500 degrees F) and low temperature protection (up to -40 degrees F)",
        "This product has the following approvals: AVTOVAZ (LADA cars); MB-Appoval 229.5; MB-Approval 229.3; Nissan Genuine Performances; Porsche A40; VW 502 00; VW 505 00; BMW Longlife 01"
      ],
      "description": "Mobil 1 FS European Car Formula 0W-40 helps to extend engine life, even in severe conditions, and protects critical engine parts for up to 10,000 miles between oil changes*. Its uniform synthetic oil molecules reduce friction, helping to prevent deposits and sludge buildup. This technologically advanced formulation provides excellent internal engine heat protection (up to 500 degrees Fahrenheit), and low-temperature protection (to -40 degrees Fahrenheit), supporting quick cold-weather starting and ultra-fast protection. Mobil 1 FS European Car Formula 0W-40 also helps control oxidation to prevent oil breakdown. Approved for many Mercedes-Benz, VW, Audi and Porsche vehicles, this formula provides excellent turbocharged engine protection. Mobil 1 is America’s leading synthetic motor oil brand at retail**, recommended by car builders and experienced mechanics, and is the Official Motor Oil of NASCAR®. (*Protects for 10,000 miles or 1 year, whichever comes first. To learn more about the Mobil 1 Limited Warranty, visit Mobil.US. **Source: The NPD Group/ Retail Tracking Service/ Dollar Sales/ PCMO Full Synthetic/ 52 weeks ending September 30, 2023)",
      "parentTitle": "Mobil 1 Extended Performance Full Synthetic Motor Oil",
      "starRating": "N/A",
      "category": "Automotive",
      "categoryId": 15684181
    }
  ]
}