{
  "productDetails": [
    {
      "title": "Crocs Men's and Women's Classic Clog Banana Men's 8, Women's 10",
      "imagesCSV": "71edD8FpbWL.jpg,61UW94ljexS.jpg",
      "manufacturer": "Crocs",
      "asin": "B08KHL6C3T",
      "brand": "Crocs",
      "features": [
        "Sole sizes are US. Label shows UK. M = Men's W = Women's"
      ],
      "description": "Description\n\nCrocs Classic clog",
      "parentTitle": "Crocs Unisex Adult Classic Clog",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Gildan Men's Crew T-Shirts, Multipack, Style G1100, Navy/Heather Navy/Indigo Blue (5-Pack), Medium",
      "imagesCSV": "81ItG4mkmHS.jpg,614iwiR2uNL.jpg,61r8ieCjw7L.jpg,81nfzIKTxTL.jpg,717FBkZzmcS.jpg,61Q5js47DgL.jpg",
      "manufacturer": "Gildan",
      "asin": "B093136ND2",
      "brand": "Gildan",
      "features": [
        "Soft, breathable cotton",
        "Moisture wicking technology keeps you cool and dry",
        "Tag-free to prevent irritation",
        "Classic length for easy tucking",
        "Durable stitching",
        "Lay-flat collar"
      ],
      "description": "Description\n\nGildan uses cotton grown in the USA, which represents the best combination of quality and value for Gildan’s cotton and cotton blended products. Since 2009, Gildan has proudly displayed the Cotton USA mark, licensed by Cotton Council International, on consumer’s product packaging and shipping materials. Gildan’s environmental program accomplishes two core objectives: reduce our environmental impact and preserve the natural resources being used in our manufacturing process. At all operating levels, Gildan is aware of the fact that we operate as a part of a greater unit: the environment in which we live and work.",
      "parentTitle": "Gildan Men's Crew T-Shirts, Style G1100, Multipack",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Crocs Men's and Women's Classic Clog Banana Men's 8, Women's 10",
      "imagesCSV": "71edD8FpbWL.jpg,61UW94ljexS.jpg",
      "manufacturer": "Crocs",
      "asin": "B08KHL6C3T",
      "brand": "Crocs",
      "features": [
        "Sole sizes are US. Label shows UK. M = Men's W = Women's"
      ],
      "description": "Description\n\nCrocs Classic clog",
      "parentTitle": "Crocs Unisex Adult Classic Clog",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Gildan Men's Crew T-Shirts, Multipack, Style G1100, Navy/Heather Navy/Indigo Blue (5-Pack), Medium",
      "imagesCSV": "81ItG4mkmHS.jpg,614iwiR2uNL.jpg,61r8ieCjw7L.jpg,81nfzIKTxTL.jpg,717FBkZzmcS.jpg,61Q5js47DgL.jpg",
      "manufacturer": "Gildan",
      "asin": "B093136ND2",
      "brand": "Gildan",
      "features": [
        "Soft, breathable cotton",
        "Moisture wicking technology keeps you cool and dry",
        "Tag-free to prevent irritation",
        "Classic length for easy tucking",
        "Durable stitching",
        "Lay-flat collar"
      ],
      "description": "Description\n\nGildan uses cotton grown in the USA, which represents the best combination of quality and value for Gildan’s cotton and cotton blended products. Since 2009, Gildan has proudly displayed the Cotton USA mark, licensed by Cotton Council International, on consumer’s product packaging and shipping materials. Gildan’s environmental program accomplishes two core objectives: reduce our environmental impact and preserve the natural resources being used in our manufacturing process. At all operating levels, Gildan is aware of the fact that we operate as a part of a greater unit: the environment in which we live and work.",
      "parentTitle": "Gildan Men's Crew T-Shirts, Style G1100, Multipack",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Nippies Nipple Cover - Sticky Adhesive Silicone Nipple Pasties - Reusable Pasty Nipple Covers for Women with Travel Box",
      "imagesCSV": "81yNhPXY6HL.jpg,71QOan6AftL.jpg,61FQwxSVKML.jpg,71obs4jZd1L.jpg,71awFmcfJlL.jpg,81sxa70YGEL.jpg,71soKpllAZL.jpg,91zEfkJmYlL.jpg",
      "manufacturer": "Nippies",
      "asin": "B09JXJCRTV",
      "brand": "Nippies",
      "features": [
        "BREAK FREE FROM BRAS! - Replace uncomfortable bras with our silicone nipple cover. Comfortable and supportive, it conceals the areola and breast, creating a smooth finish to wear with a backless dress, bridesmaid gown, camisole top, or bathing suit.",
        "STAY ON ALL DAY - Hitting the gym in a sports bra? Or the dance floor of a club in sheer fabric? The sticky nipple covers for women will stay in place no matter the activity. Consistently proven to stay in place for up to 12 hours.",
        "YOU’LL FORGET YOU’RE WEARING THEM - Made to accommodate small or large cup sizes, the silicone pasties are virtually invisible. Designed to match skin tone and complexion without being see-through. The texture is flat and does not shine or reflect light.",
        "BETTER THAN STRAPLESS BRAS - The reusable nipple covers for women are easy to put on and peel off. Carefully follow instructions when removing and keep in case to maintain shape for reuse. Use the silicone nipple covers that countless women love.",
        "WITHSTAND HOT SUMMER HEAT & HUMIDITY - Go out on the Las Vegas strip, join a yoga class, or attend that wedding on a sunny Miami beach with these silicone nipple stickers. Crafted to provide premium ‘runway fashion model’ support without making you sweat."
      ],
      "description": "Description\n\nMade to wear with all your unlined bras and sheer knits, bristols 6 Nippies skin covers are designed with ultra-thin edges for a seamless look that will make it easy to go braless with absolute confidence.",
      "parentTitle": "Nippies Nipple Covers for Women - Sticky Adhesive Silicone Pasties - Reusable Pasty Nipple Cover with Travel Box",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Crocs Classic Clogs (Little Toddler/Big Kid), Pink Crush, 5 US Unisex",
      "imagesCSV": "61p0W4AW5NL.jpg,71fe68HsiYL.jpg,81Agsv5kfQL.jpg,61XpC-aTRIL.jpg,714u8YXnJ+L.jpg,71LggPifjbL.jpg",
      "manufacturer": "Crocs",
      "asin": "B0CQR8NRQH",
      "brand": "Crocs",
      "features": [
        "The Crocs Kids Classic Clogs are the perfect combination of comfort and style for your little ones. With lightweight EVA upper and insole, these clogs are breathable and waterproof, making them ideal for all-day wear. The Croslite material and molded",
        "Slip-on style with pivotal heel strap.",
        "Iconic Croc Comfort offers a lightweight and flexible performance with 360-degree comfort.",
        "Round toe design.",
        "EVA outsole."
      ],
      "description": "Description\n\nCrocs Classic Baby Boys Shoes",
      "parentTitle": "Crocs Kids' Classic Clog",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Crocs Unisex-Adult Classic Clogs (Best Sellers), Lavender, 13 Men/15 Women",
      "imagesCSV": "61x1BMAlZNL.jpg,41Bvpu5kUiL.jpg,51+5oLBjKQL.jpg,51LnX3kTuBL.jpg,41c+8fCDKYL.jpg,412ASwerp8L.jpg,51y9dBh5cJL.jpg,61b8q+nX+JL.jpg",
      "manufacturer": "Crocs",
      "asin": "B08412MCNW",
      "brand": "Crocs",
      "features": [
        "Size Recommendation: We recommend sizing up (e.g. if you are a 7.5, size up to an 8)"
      ],
      "description": "Description\n\nCrocs Classic clog",
      "parentTitle": "Crocs Unisex Adult Classic Clog",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Gildan Men's Crew T-Shirts, Multipack, Style G1100, Navy/Heather Navy/Indigo Blue (5-Pack), Medium",
      "imagesCSV": "81ItG4mkmHS.jpg,614iwiR2uNL.jpg,61r8ieCjw7L.jpg,81nfzIKTxTL.jpg,717FBkZzmcS.jpg,61Q5js47DgL.jpg",
      "manufacturer": "Gildan",
      "asin": "B093136ND2",
      "brand": "Gildan",
      "features": [
        "Soft, breathable cotton",
        "Moisture wicking technology keeps you cool and dry",
        "Tag-free to prevent irritation",
        "Classic length for easy tucking",
        "Durable stitching",
        "Lay-flat collar"
      ],
      "description": "Description\n\nGildan Cotton Crew Neck T-Shirts are anything but basic. Crafted with soft, breathable cotton and moisture wicking technology to keep you cool and comfortable no matter what's on the agenda. Perfect for layering or lounging - you can thank us later.",
      "parentTitle": "Gildan Men's Crew T-Shirts, Multipack, Style G1100",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Womens Summer Tops Kimono Cardigan Hawaiian Loose Cover ups Outwear Jackets (Hawaii Coconuts, L)",
      "imagesCSV": "51WZxYPnJ8L.jpg,512gSalDRvL.jpg,413XiWzmVGL.jpg,41TVQvIbchL.jpg,41Btc2VcroL.jpg",
      "manufacturer": "N/A",
      "asin": "B0BPLFNBN6",
      "brand": "CHICGAL",
      "features": [
        "Womens casual tops like this kimono cardigans, open front coverups, Wearing as women jacket has a bit of give to make for a great fit. you’ll land on a beautiful fitting shrug capes to complement your shape and style .",
        "The floral shirt is made of chiffon.The Lightweight cardigan is comfortable and breathable. We’ve used sheer fabric that never irritates your skin. So you can be reeling in total comfort as you soak up for swimwear .",
        "The woman thin coat suit to travel, daily wear, beach,wedding,pool, home hawaii,cruise shopping, party, vacation ect. Perfect to match with all kind of ,swimsuit ,shoes,bags and hair styles.Easy to put up or down in Spring, Summer, Fall. Great gift for Christmas ,New Year ,Valentine's day , birthday family and girlfriend.",
        "This printed shawl blouse can be worn as resort accessories must have cover-ups with almost any outfit, such as Leggings or Jeans, Shorts, Skirt,dress,tunic or tanks top. Trendy & Classic little lady’s outwear and timeless open front styling, add to fashion elements for your style, create your charming look.",
        "S-5XL Please check the size chart before purchasing. Whether you’re petite, plus size, or somewhere in between, you would find fited cardigans from our sizes."
      ],
      "description": "N/A",
      "parentTitle": "Women's Floral Print Puff Sleeve Kimono Cardigan Loose Cover Up Casual Blouse Tops",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Nippies Nipple Covers for Women - Added Lift Adhesive Silicone Nipple Pasties - Reusable Sticky Breast Covers - Hazelnut, 1.5",
      "imagesCSV": "512umbPrHuL.jpg,61sWRvVMzfL.jpg,6180-sDpq9L.jpg,61+ly+9ULlL.jpg,71awFmcfJlL.jpg,61YK0h9cswL.jpg,71AFAzyUK9L.jpg,71soKpllAZL.jpg,71f07xNpWXL.jpg",
      "manufacturer": "B-Six",
      "asin": "B09JHDX3YD",
      "brand": "Nippies",
      "features": [
        "PERFECT LIFT - The pull tab of this lifting silicone nipple cover adds up to 1 inch of lift for enhanced cleavage, with a backless, bra-less design.",
        "NO-SHOW COMFORT - Invisible under clothing, these sticky boobs adhesives will stay surely in place all day or all night. They’re made from ultra-thin, breathable silicone that feels just like a second skin!",
        "EASY CARE - These reusable pasties nipple covers are waterproof, wrinkle-free and can be easily washed with soap and water. Use these versatile breast petals up to 20-30 times.",
        "CUSTOM COVERAGE - Enjoy 5 skin tone options (Creme, Caramel, Coco, Espresso and Hazelnut) and 2 sizes (5x4” & 6x4.75”) of breast lift pasties so you can have the most comfortable, customized, and confident coverage!",
        "CUSTOMER SUPPORT - At Nippies, we work to create products that allow everyone to wear what they want freely. If you have any questions or concerns about your nipple stickers, reach out to our 24/7 support team."
      ],
      "description": "Description\n\nMade to wear with all your unlined bras and sheer knits, bristols 6 Nippies skin covers are designed with ultra-thin edges for a seamless look that will make it easy to go braless with absolute confidence.",
      "parentTitle": "Nippies Nipple Covers for Women - Sticky Adhesive Silicone Pasties - Reusable Pasty Nipple Cover with Travel Box",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Crocs Classic Clog Baby Girls Shoes Size 11, Color: Pink",
      "imagesCSV": "41FvkDOqD2L.jpg,41NeducwFEL.jpg,31i5HgMttTL.jpg,31YCs528mHL.jpg",
      "manufacturer": "N/A",
      "asin": "B0BQQ5DW5Q",
      "brand": "Crocs",
      "features": [
        "Crocs",
        "Baby Girls Shoes",
        "Clogs Shoes",
        "Pink",
        "Synthetic & Rubber"
      ],
      "description": "Product Description\nCrocs Classics (Toddler/Youth) - Neon Purple Comfort and fun connect in the Crocs Kids' Classic. This kids' clog has a durable, lightweight foot bed that molds to feet and ventilation for breathability. Plus they can add Jibbitz charms to make them their own. Features: easy to clean, and quick to dry. Contoured, orthotic foot bed for comfort. Advanced toe box ventilation keeps feet cool and lets water and debris drain away. Lightweight, non-marking sole. Water-friendly and buoyant; weighs only ounces. Fully-molded Croslite material construction for maximum lightweight cushioning and durability. Croslite material heel strap for a secure fit. From the Manufacturer\nCrocs, Inc. is a rapidly growing designer, manufacturer and retailer of footwear for men, women and children under the Crocs brand. All Crocs brand shoes feature Crocs' proprietary closed-cell resin, Croslite, which represents a substantial innovation in footwear. The Croslite material enables Crocs to produce soft, comfortable, lightweight, superior-gripping, and non-marking shoes. These unique elements make Crocs ideal for casual wear, as well as for professional and recreational uses such as boating, hiking, hospitality and gardening. The versatile use of the material has enabled Crocs to successfully market its products to a broad range of consumers.",
      "parentTitle": "Crocs Kids' Classic Clog",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Hanes Men Boxer Briefs, Cool Dri Moisture-Wicking Underwear, 5 Pack - Multicolor, X-Large",
      "imagesCSV": "61GuoK7oz8L.jpg",
      "manufacturer": "N/A",
      "asin": "B0CGF4FT1V",
      "brand": "Hanes",
      "features": [
        "Pattern: Solid",
        "Style: 4-pack Freshiq Tagless Cotton Boxer With Comfortflex Waistband Briefs",
        "Rise Style: Mid",
        "Special Feature: Wrinkle-Free"
      ],
      "description": "Description\n\nIf you're looking for comfort and performance in stretch boxer briefs, look to Hanes Ultimate® Comfort Flex Fit® boxer briefs. The remarkable comfort starts with the specially designed lightweight pouch that gives you the support of a brief in a sleek, fitted boxer brief silhouette. This sexy underwear is knit from Cool Comfort® fabric that wicks away moisture to keep you cool and dry all day. These stretch cotton/modal boxer briefs are also made with Hanes®'s FreshIQ™ advanced odor protection technology that removes odor for all-day freshness. And here's even more comfort - the Comfort Flex® stretch waistband moves with you and keeps its shape wash after wash without pinching or binding. No-ride-up leg bands are designed to stay smoothly in place and there's a traditional open fly. These moisture-wicking stretch boxer briefs are available in a convenient 4-pack of assorted solid colors for effortless stocking up.",
      "parentTitle": "Hanes Men's Boxer Briefs, Cool Dri Moisture-Wicking Underwear, Cotton No-Ride-up for Men, Multi-Packs",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Carhartt Men's Loose Fit Heavyweight Short-Sleeve Pocket T-Shirt (Also Available in Big & Tall), North Woods Heather, 3X-Large",
      "imagesCSV": "61HneBiuOcL.jpg",
      "manufacturer": "Carhartt",
      "asin": "B08PPVJZ2X",
      "brand": "Carhartt",
      "features": [
        "Rib-knit crew neck",
        "Side-seam construction minimizes twisting",
        "Left-chest pocket with sewn-on Carhartt label",
        "Tagless neck label",
        "Prev. Name: Workwear Pocket Short-Sleeve T-Shirt"
      ],
      "description": "Description\n\nA workwear staple, this men's pocket t-shirt is equal parts durable and comfortable. It has an original fit, Carhartt's roomiest cut. The heavyweight fabric only gets softer with time.",
      "parentTitle": "Carhartt Men's Loose Fit Heavyweight Short-Sleeve Pocket T-Shirt (Also Available in Big & Tall)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "ATHMILE Water Shoes Women Men Barefoot Aqua Socks Quick-Dry for Beach Swim Pool Yoga Camping Cruise Surf Sport",
      "imagesCSV": "717T4kD6E6L.jpg,71n8fe2Zg3L.jpg,71E3YzF8ChL.jpg,71j5TuB09HL.jpg,71MK9PraJhL.jpg,81MJ18kBfLL.jpg,612qhp3uNvL.jpg",
      "manufacturer": "ATHMILE",
      "asin": "B0BJ6NRVRW",
      "brand": "ATHMILE",
      "features": [
        "Comfortable: The fabric of water shoes for women men is smooth, skin-friendly, elastic, comfortable like socks, and thick soles provide support for you.",
        "QUICK-DRY&ANTI-SLIP: Barefoot shoes upper is made of professional diving fabric, which is breathable and quick-dry.The soles have similar tire texture design, good anti-slip performance, and can firmly grasp the ground.",
        "CONVENIENCE: Beach swim shoes are made of ultra-light and high-elastic materials, which can be folded at will. It's really convenient to take out for holiday.",
        "Occasions: You deserve these water socks for beach,swimming, surfing, water park, sailing, kayaking, cruise essentials, beach volleyball, fishing, hiking, camping and yoga etc. Especially for family holiday!",
        "VARIOUS SIZE:There are a variety of colorful styles to choose.And swim pool shoes have lots of size suited for men,women,boys,girls."
      ],
      "description": "N/A",
      "parentTitle": "Water Shoes for Women Men Quick-Dry Aqua Socks Swim Beach Barefoot Yoga Exercise Wear Sport Accessories Pool Camping Must Haves Adult Youth Size",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "XIEERDUO Womens Tops Summer 2025 Floral 3/4 Sleeve Blouses for Women Spring Clothes for Women M",
      "imagesCSV": "91exywiCn-L.jpg,91Dc7Im485L.jpg,91Prb0kyLmL.jpg,911hX9W7i3L.jpg,91j-6mLzo+L.jpg",
      "manufacturer": "N/A",
      "asin": "B0DMF2JQW2",
      "brand": "XIEERDUO",
      "features": [
        "♥Tips-- Machine wash in cold water/ Hang or line dry/ Do not bleach. The 3/4 length womens tops are packed with vacuum bag. It may looked wrinkle after open the package. Please wash and iron it to solve the wrinkles before wearing.",
        "♥Material-- Super soft, breathable, comfortable and skin friendly to wear. The print blouses are made of 95%Polyester,5%Spandex.",
        "♥Feature-- The 3/4 sleeve tops for women is very cute with elastic cuffs which is perfect for business casual wear. Basic Crew Neck with curved hem design provides a flattering fit. Easy to dress up or down.",
        "♥Match-- The dressy casual blouses are great to pair with pants, variety of jeans, skirts, leggings, sweatpants and shorts in summer and spring. It's also nice to wear with blazer, cardigan, coats and jackets. Nice for layering in fall and winter.",
        "♥Occasion-- This casual tops are perfect for work, business, home, party, club, school, outdoor, shopping, street, travel and daily wear."
      ],
      "description": "N/A",
      "parentTitle": "XIEERDUO Blouses for Women Dressy Casual 3/4 Length Sleeve Womens Tops with Smocked Cuffs",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Gildan Adult Ultra Cotton T-Shirt, Style G2000, Multipack, Maroon (3-Pack), 3X-Large",
      "imagesCSV": "71BYiYdKVcL.jpg,61CBEsFOufL.jpg,61pw8JnwOqL.jpg,61ueA15HbiL.jpg,61YCvtReRYL.jpg",
      "manufacturer": "Gildan",
      "asin": "B09S6VYR7H",
      "brand": "Gildan",
      "features": [
        "Classic fit for loose comfort",
        "A great choice for everyday or work wear",
        "Heavyweight tee perfect for layering or on its own",
        "Taped neck and shoulders for comfort and durability",
        "Tear away label for customizable comfort",
        "Screen printing, embroidery, iron-on transfers, bleaching and tie dye",
        "Companion style: G2000B"
      ],
      "description": "Description\n\nWhether wearing it for work or play, the Gildan Ultra Cotton Adult T-Shirt is a wardrobe basic that works for just about any occasion. It features a classic fit and a heavyweight fabric with taped neck and shoulders for comfort and durability. You can decorate using screen printing, DTG, heat transfers, dye sublimation or discharge, and companion styles for youth and toddlers make it easy to create matching outfits for the whole family.",
      "parentTitle": "Gildan Unisex Adult Ultra Cotton T-Shirt, Style G2000, Multipack",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Amazon Essentials Women's Cotton Bikini Brief Underwear (Available in Plus Size), Pack of 10, White, X-Small",
      "imagesCSV": "61jwvddrdML.jpg,21MvE1vdfnL.jpg,71B6JTiffbL.jpg,713YnQU12qL.jpg,91AVImQ9W4L.jpg,21vlNRQJHmL.jpg",
      "manufacturer": "Amazon Essentials",
      "asin": "B07CJLJJTR",
      "brand": "Amazon Essentials",
      "features": [
        "FIT: Bikini style panties sit at the low hip with full back coverage.",
        "COTTON SPANDEX: Soft, smooth cotton blend. This breathable lightweight natural fabric feels soft against your skin, while the added spandex offers a flexible fit that moves with you.",
        "BIKINI PANTY: The ultimate in everyday comfort, a versatile panty staple that works under all your favorite outfits.",
        "DETAILS: Designed with soft elastic around the waist and leg for support and comfort, with a printed label at waist."
      ],
      "description": "Description\n\nWe listen to customer feedback and fine-tune every detail to ensure our clothes are more comfortable, higher quality, and longer lasting—at affordable prices for the whole family.",
      "parentTitle": "Amazon Essentials Women's Cotton Bikini Brief Underwear (Available in Plus Size), Multipacks",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "WIHOLL Short Sleeve Shirts for Women Dressy Casual Summer Spring Square Neck Tops Outfits 2025 Blue and Pink Stripe M",
      "imagesCSV": "81huiSAKLZL.jpg,81ziA6niboL.jpg,819ZCai-5uL.jpg,71oOU5wwOHL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DM45W5G3",
      "brand": "WIHOLL",
      "features": [
        "Square Neck: The square neckline of this casual t-shirts is open and feminine.More Flattering to match with your necklace.",
        "Ruffle sleeve: Exquisite sleeve offers more details with tshirts, Add the-moment fashion to your tops, from trending picks to style staples.",
        "Matches: It's a bit sexy and stylish, Looked flattering and cute with jeans, denim shorts, leggings, jackets, high heels or sneakers & a touch of jewelry.",
        "Occasions: Suitable for any occasions like home, work, office, vacation, beach, party, dating, weekend gathering or casual daily wear.",
        "Size: It's not US regular size. Reference the size chart below on \"Product description\"."
      ],
      "description": "N/A",
      "parentTitle": "WIHOLL Tops for Women Summer Casual Ruffle Trim Sleeve Square Neck T Shirts",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Kuailu Flip Flops Women Arch Support Yoga Mat Comfortable Summer Beach Walking Thong Cushion Sandals Slip on Outfits Travel Essential Orthotic Slides Indoor Outdoor Slippers Shoes Black Khaki Size 7.5",
      "imagesCSV": "71r4msCfXhL.jpg,71eyqtf4Z3L.jpg,61fdGfEL1SL.jpg,71NAobbug8L.jpg,71+PRGPuK3L.jpg,61psJk81i8L.jpg,71Hh9t8kSPL.jpg,8182bBa+6XL.jpg,8138a7TDRIL.jpg",
      "manufacturer": "N/A",
      "asin": "B0D7V744PP",
      "brand": "KuaiLu",
      "features": [
        "Womens Dressy Casual Sandals: Elegant and trendy style. Soft cloth bow knot strap sandals can dress up and down to match cute dress, trending jeans, stylish cloth. Premium arches thick cushion foam serve walking on cloud comfort",
        "Cushioned Yoga Mat Footbed: Made with memory foam EVA give sandles extra cushioning and better foot care for all day walking, lightweight classy sandals are good for resort travel, vacation, wedding bride or bridal and work in office",
        "Comfort Arch Support: Supportive every step of your feet anywhere and relieves the fatigue of walking. Women's orthopedic sandals relax feet for long distance walk, improve your gait and lessen foot issues like Plantar Fasciitis",
        "Non-Slip Rubber Sole: Deep texture waterproof tread function with perfect traction and grip to ensure the best protection, gives you peace of mind when summer pool beach partys or bath, shower in bathroom",
        "Partner for Summer: Classic flat sandals are perfect for various outfits and scenes. These Pretty sandals can match y2k tops,workout sets,lounge shorts, resort wear, going out outfits and fashion swimsuits"
      ],
      "description": "N/A",
      "parentTitle": "KuaiLu Flip Flops for Women with Arch Support Yoga Mat Comfortable Summer Beach Walking Thong Cushion Sandals Slip On Indoor Outdoor",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "J.VER Men's Dress Shirts Solid Long Sleeve Stretch Wrinkle-Free Formal Shirt Business Casual Button Down Shirts Burnt Orange Medium",
      "imagesCSV": "71GWqYnNodL.jpg,71GHFYpGzdL.jpg,8107hnDABgL.jpg,81ryZtAZaRL.jpg,71ukcPoGhrL.jpg,810LZ8w5T+L.jpg",
      "manufacturer": "N/A",
      "asin": "B0CDLQK93W",
      "brand": "J.VER",
      "features": [
        "Flex Fabric: The long sleeve dress shirt is made of stretch fabric,makes you move body easier;soft and comfortable with good breathability",
        "Wrinkle Free: The combination of high-quality fabrics and special technology makes the solid dress shirt not easy to wrinkle, easy to care.The classic spread collar easily matches with a tie or bow tie",
        "Occasion: Business/ Wedding/ Party/ Dating/ Office/ Nightclub, whether for formal occasions or daily casual, this mens dress shirt is a perfect choice. The classic design ensures it's a staple in any wardrobe",
        "Size: Our button down shirts are US regular fit tailoring style,a variety of sizes and colors for you to choose,please refer to the size chart to choose the size that suits you",
        "Washing Method: It is recommended to hand wash or machine wash in cold water to protect the fabric's texture and color. This shirt can be ironed at low temperatures"
      ],
      "description": "N/A",
      "parentTitle": "J.VER Men's Dress Shirts Solid Long Sleeve Stretch Wrinkle-Free Formal Shirt Business Casual Button Down Shirts",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "SHAPERMINT Shapewear for Women - High-Waisted Shapewear Tummy Control Shorts, Faja Body Shaper, Underwear for Women Sand",
      "imagesCSV": "71MXZkPM1oL.jpg,71oj-d2zAlL.jpg,71MXCzJviHL.jpg,71-1p1gWNPL.jpg,71NuA+ymMVL.jpg,71iFwWJbqyL.jpg,71OttbaBkmL.jpg",
      "manufacturer": "N/A",
      "asin": "B09NHVDHL7",
      "brand": "SHAPERMINT",
      "features": [
        "ALL-DAY COMFORT & CONTROL: Designed for everyday comfort, this shapewear tummy control shorts smooth your midsection while staying breathable and lightweight. Perfect for layering under formal dresses for women or as waist trainers for women belly fat.",
        "SECURE FIT – NO ROLLING ANTI CHAFING SHORTS FOR WOMEN: Stay comfortable with anti-slip silicone strips that keep your tummy control shapewear in place all day. No rolling, no chub rub—just smooth, effortless support. These are must-have under slip shorts for under dresses.",
        "FULL WAIST, THIGH & BACK COVERAGE: Feel instantly supported with a design that tucks the tummy, slims the thighs, and smooths the back. Whether you need body shaper tummy control, faja body shaper, or shapewear bodysuits for women, this is the perfect solution for any occasion.",
        "SIZING TIP – FIND YOUR PERFECT FIT: Check the size chart for the best fit! If in between sizes, choose a larger size for a relaxed fit or a smaller size for a snug fit. Our tummy control underwear for women is designed to work seamlessly under plus size dresses for curvy women."
      ],
      "description": "Description\n\nMade Just For You We believe every woman deserves to feel beautiful. Our body shaper for women has been designed to let you embrace your curves, fill you with confidence, and finally start loving yourself again. Feel feminine, feel empowered, feel irresistible. Our high waisted body shaper shorts does it all. They’re soft as silk, stretchy as can be, made for all shapes and sizes, easy to wash and they tuck your tummy in a comfortable and flawless way. Every one of our shapewear shorts comes with a no-slip silicone strip, crafted to prevent rolling. We work everyday to help you and countless women feel exceptional from the inside out. Your complete happiness and satisfaction is our goal and we won’t stop until then! Features & Benefits They’re silky soft and stretchy. Made using the finest fabrics. Made to last! They’re perfect for any and every occasion + activity! You name it. Tucks away your tummy Lifts your butt naturally and comfortably The perfect body shaper shorts for you! We have sizes for women of all shapes. Easy to wash so you can use them over and over again. 100% Risk-Free Guarantee Made to Last Shapermint products are made ethically and authentically while offering seamless quality and performance. Try our waisted body shaper shorts today, worry-free! Add to your cart, buy now and try them on. Go about your normal everyday activities. Workout, go on a walk, relax at home!",
      "parentTitle": "SHAPERMINT Shapewear for Women - High-Waisted Shapewear Tummy Control Shorts, Faja Body Shaper, Underwear for Women",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "iGENJUN Women Workout Tops Racerback Tank Tops Basic Cute Summer 2024 V Neck Going Out Slim Fit Yoga Gym Ribbed Sleeveless Shirts Clothes Fashion,XL,Sea Green",
      "imagesCSV": "71Q9SrnlPvL.jpg,710CBi2l+dL.jpg,81oPDfKsKKL.jpg,81FPvVNFJGL.jpg,81tuZTybN4L.jpg,81hd8a87bnL.jpg,712D8PnQ8lL.jpg,81gU1z1grYL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DB4KFF1X",
      "brand": "iGENJUN",
      "features": [
        "Soft and Stretchable Fabric: Crafted from soft and stretchable materials, these tank tops offer a comfortable and flexible fit, ensuring ease of movement.",
        "Designed with a deep V-neck and racerback, this top is perfect for those who prioritize both style and practicality. Stay Fashionable in the Heat: With their trendy crop design, these tank tops are perfect for staying cool and stylish during the hot summer months.",
        "Ideal for Various Occasions: Whether you're going for a workout, hanging out with friends, or attending a casual event, these tank tops are versatile enough to suit any occasion.",
        "Perfect for Fitness Enthusiasts: Whether you're doing yoga, running, or lifting weights, this tank top serves as your ideal workout partner. Its accommodating stretch and breathability offer optimal performance.",
        "Upgrade Your Summer Wardrobe: Add these must-have tank tops to your summer collection and stay cool and stylish all season long. Shop now and enjoy the ultimate comfort and style!"
      ],
      "description": "N/A",
      "parentTitle": "iGENJUN Workout Tops for Women Racerback Basic Tank Summer 2024 Camisole V Neck Slim Fit Ribbed Sleeveless",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "AUTOMET Womens Loose Fit Casual Flowy Tank Tops Square Neck Trendy Sleeveless Summer Tops Clothes Outfits 2025 Pink M",
      "imagesCSV": "716JSXVXj0L.jpg,61g6cUvnQlL.jpg,71K79t3CSuL.jpg,61sihLUNEjL.jpg,71wvF44wMVL.jpg,71-Ze4oy-XL.jpg,41tuwOOIk6L.jpg",
      "manufacturer": "N/A",
      "asin": "B0CXPW4HLF",
      "brand": "AUTOMET",
      "features": [
        "Material: This low crewneck tank top is made of 12%rayon+82%polyester+6%spandex. Loose, comfortable,soft, lightweight, breathable, light-stretch, wrinkle-free and skin-friendly.",
        "Features: basic tank, scoop neck, strechy fabric, solid color, loose fit, lightweight, comfy under shirts, casual style, suitable for spring, summer and fall.",
        "Match: This womens casual sleeveless tank top is easy to match with jeans, shorts, sweatpants, leggings, cago pants.",
        "Suitable for the season: basic , crewneck, sleeveless, strechy fabric, solid color, loose fit, lightweight, comfy tank top, casual style, suitable for spring, summer and fall.",
        "This trendy tank top is suitable for machine or hand washes in cold water."
      ],
      "description": "N/A",
      "parentTitle": "AUTOMET Womens Loose Fit Casual Flowy Tank Tops Square Neck Trendy Sleeveless Summer Tops Clothes Outfits 2025",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "ANRABESS Womens Short Sleeve Henley Tops V Neck Dressy Casual Loose Fit Shirts Summer Flowy Blouses 2025 Trendy Clothes Brick Red X-Large",
      "imagesCSV": "71Uq2Xvsa6L.jpg,81cw1tG22OL.jpg,71+w8yVVqhL.jpg,71+sxEfgNHL.jpg,816t9+Wb-+L.jpg,71kLuv3lbEL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DY7GTFDK",
      "brand": "ANRABESS",
      "features": [
        "Fit: Loose. S=US(4-6), M=US(8-10), L=US(12-14), XL=US(16-18), XXL=US(20-22).",
        "Fabric: 68% Polyester, 27% Rayon, 5% Elastane. Stretch - Slight, Thickness - Slight, Softness - Medium.",
        "Designs: Short sleeve, casual loose fit, v neckline with buttons, tunic length, basic tees.",
        "Style: This v neck top is super cute and flattering to pair with shorts, jeans or skirts for work office outfits, casual wear, running errands, laidback weekends.",
        "Care: Machine or hand wash cold, do not bleach. Hang or lay flat to dry, do not tumble dry."
      ],
      "description": "N/A",
      "parentTitle": "ANRABESS Womens Short Sleeve Henley Tops V Neck Dressy Casual Loose Fit Shirts Summer Flowy Blouses 2025 Trendy Clothes",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Wrangler Authentics Men's Classic Cargo Stretch Short, Medium Tint Denim, 40",
      "imagesCSV": "91JqCQKZbTL.jpg,4122KB0duKL.jpg,41zookM6C2L.jpg,81gvYnl4WvL.jpg,B1MmJkAdyPS.jpg,A1mowEiWMML.jpg,A1LzTLC9JWL.jpg",
      "manufacturer": "Wrangler",
      "asin": "B07YP9DJVM",
      "brand": "Wrangler Authentics",
      "features": [
        "TRADITIONAL CARGO STYLE. Built for versatility and comfort, this classic cargo short takes you from the outdoors to work, to every day with this timeless silhouette",
        "RELAXED FIT. These cargo shorts sit at the natural waist with a relaxed seat and relaxed fit through the thighs. This short is built with a 10-inch inseam and will keep you comfortable all day.",
        "QUICK-ACCESS STORAGE. Equipped with (6) pockets for maximum storage capacity. (2) side cargo flap pockets, (2) slash pockets, and (2) back patch pockets, for easy-access storage. Great for storing personal items or gadgets",
        "DURABLE STRETCH MATERIALS. Offered in a variety of stretch fabrications including twill and rip stop, these pants are built to last while maintaining comfort and style",
        "HEAVY-DUTY HARDWARE. Finished with a heavy-duty zipper fly and button closure"
      ],
      "description": "Description\n\nThe Wrangler Authentics collection delivers laid-back style for the man on the go. Performance-level comfort is built into our classic button-downs and blue jeans for an outfit that feels as good as it looks. Wrangler Authentics jeans are constructed with 5-pocket styling, made from heavyweight 100% cotton denim and feature a comfortable waist with deep front pockets. Available with Advanced Comfort technology that helps your jeans move with you for all day comfort. Pair with your favorite Wrangler Authentics shirt for a night out or casual weekend.",
      "parentTitle": "Wrangler Authentics Men's Classic Cargo Stretch Short",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "SINOPHANT High Waisted Leggings for Women - Full Length Capri Buttery Soft Yoga Pants for Workout Athletic(Full Color Line,XXL)",
      "imagesCSV": "71Qjbz+-3qL.jpg,81schv3OGQS.jpg,713qznQWTtL.jpg,81RwdZ+T9RL.jpg,71c4u3XyQTL.jpg,81MepUqcc4L.jpg,81usYXB9AtL.jpg",
      "manufacturer": "SINOPHANT",
      "asin": "B0C74VGG6V",
      "brand": "SINOPHANT",
      "features": [
        "THREE SIZES AVAILABLE – SINOPHANT leggings feature a super-elastic design with stretchy, supportive fabric that moves with you, ensuring all-day comfort and a flattering fit",
        "SUPER SOFT: Womens leggings are as buttery soft as they get, providing an unparalleled level of comfort; The smooth texture will make you feel like you're wearing a second skin, allowing for unrestricted movement, without being see-through",
        "HIGH WAIST: The wide waistband provides tummy control and a streamlined look, helps flatten the stomach and accentuate the waistline, while the high-waisted style elongates the legs and enhances your figure, making you look slimmer",
        "VERSATILE: Whether it's stylish workwear or a relaxed weekend look, SINOPHANT leggings have got you covered; Our leggings are the perfect choice for running, yoga, dancing, jogging, aerobic exercises, pilates, or any gym workout",
        "CARE TIPS: Please wash them with similar colors, MACHINE WASH in cold water, do not bleach, and do not iron"
      ],
      "description": "N/A",
      "parentTitle": "SINOPHANT High Waisted Leggings for Women - Full Length Capri Buttery Soft Yoga Pants for Workout Athletic",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Warner's womens Easy Does It Underarm Smoothing With Seamless Stretch Wireless Lightly Lined Comfort Rm3911a Bra, Butterscotch, X-Small US",
      "imagesCSV": "71zHGhAaXAL.jpg,411i-oDga9L.jpg,41l1Ah7ScXL.jpg,51v7p05nc7L.jpg,51nNSBB8i1L.jpg,71wo5oyvKYL.jpg",
      "manufacturer": "Warner's Women's IA - Bras",
      "asin": "B01MT7SOKG",
      "brand": "Warner's",
      "features": [
        "Side-smoothing panels",
        "Seamless comfort",
        "Simple, easy sizing (S-3XL)",
        "Wide, comfortable straps",
        "Designed to fit your shape with allover stretch fabric"
      ],
      "description": "Description\n\nKeep it easy. Keep it comfortable. Designed to fit your shape with allover stretch fabric, this Easy Does It® wireless lightly lined comfort bra features simple, easy sizing. Get the coverage you want with our amazing side-smoothing panels. Welcome to a better bra experience. When it comes to intimates, everyone needs something different. That's why we made styles for every body. We're simple solutions, made better.",
      "parentTitle": "Warner's Women's Easy Does It® Underarm-smoothing With Seamless Stretch Wireless Lightly Lined Comfort Bra Rm3911a",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "COOFANDY Men's Linen Shirt Casual Shirts Short Sleeve Shirts Button Down Linen Beach Shirts for Men Summer Outfit Denim Blue",
      "imagesCSV": "815kisQxTjL.jpg,81KJ29zuoLL.jpg,810gtf7UpSL.jpg,91SUVcC+IIL.jpg,91QYFT0Y1BL.jpg",
      "manufacturer": "N/A",
      "asin": "B0BVB6FXR1",
      "brand": "COOFANDY",
      "features": [
        "COOFANDY LINEN SHIRT --- Mens Casual Button Down shirt is made of high quality cotton linen fabric. Feature with Breathable, Lightweight, Skin-friendly, which can resistant shrink, provide you feeling cool and comfotable all day",
        "CASUAL & FASHION --- Mens Casual Linen Shirts comes with button-down closure, short sleeve, adjustable cuff, silm fit, solid color. Casual Beach Style Design to make you feel better about this summer",
        "MENS SUMMER OUTFIT --- Mens Summer Shirts Short Sleeve is great to match with beach shorts, solid t-shirts, casual pants, casual shorts. Pair with shorts, sunglasses,a hat, and canvas shoes for your perfect vacation style on the beach",
        "OCCASION --- Mens Cotton Linen Shirts For Beach suitable for beach, yoga, vacation, informal business, party, holiday, dating, wedding, travel, streetwear or any casual daily wear. Great for Summer, Spring, bring this Linen Button Down Shirts to Enjoy your Leisure Time",
        "WARM TIPS --- Low temperature hand wash or machine wash, hang to dry. Please refer to our SIZE CHART for selection"
      ],
      "description": "N/A",
      "parentTitle": "COOFANDY Men's Linen Shirts Short Sleeve Casual Shirts Button Down Shirt for Men Beach Summer Wedding Shirt",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Plus Size Tops for Women Short Sleeve Shirts Summer Outfits Dressy Casual Blouses Loose Fit Baby Blue 4XL",
      "imagesCSV": "81jHj3+jMgL.jpg,71NlKg+jQbL.jpg,81JvC7cTxKL.jpg,811Y0iqCC3L.jpg,71quDYZ+hPL.jpg,71CNdSUcmIL.jpg,41ghNrmRvjL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DWSN5PCT",
      "brand": "OFEEFAN",
      "features": [
        "Great Features: t shirts for women loose fit,womens tops dressy casual,adorable pleated front design,scooped neck short sleeve blouses for women,cute summer tops with curved hem,available in floral and solid colors",
        "Loose Fit: this t shirts fits flowy and comfortable,the pleating design helps contour chest area and conceal tummy issues,the puff sleeves hides big arms nicely",
        "Matches:pair this top with jeans, pants, shorts, skirts, capris, or even biker shorts. The curved hem adds a stylish touch, long enough to cover the rear, making it perfect to wear with leggings",
        "Occasions: ideal for daily, casual, business, work, office, date, travel, beach vacation, parties, pregnancy,outdoor events,shopping,holiday getaways and as a thoughtful gift",
        "Garment Care: machine wash in cold water, dry on low heat, or hang/line to dry. Iron on low settings"
      ],
      "description": "N/A",
      "parentTitle": "OFEEFAN Womens T Shirts Short Sleeve Pleated Dressy Casual Scooped Neck Summer Tops Blouses",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Fruit of the Loom Men's Undershirts, Moisture Wicking & Tag Free, Short Sleeve Crew T-Shirts, Black/Grey-3 Pack",
      "imagesCSV": "61+XVFwXwcL.jpg,31uK6n6RigL.jpg,31zlrK7kFnL.jpg,31yE7TdfGQL.jpg,716r3aUC6kL.jpg",
      "manufacturer": "Fruit of the Loom",
      "asin": "B0F8P37TWC",
      "brand": "Fruit of the Loom",
      "features": [
        "Eversoft breathable fabric",
        "Moisture wicking",
        "Lay flat collar",
        "Comfort Move sleeves for full range of motion",
        "Stay true colors last wash after wash"
      ],
      "description": "Description\n\nFruit of the Loom White Crews T-shirts are designed to stay tucked so you can go about your busy day with confidence. Our undershirts are designed with a unique soft cotton fabric that maintains comfort and softness wash after wash. The layflat collar will keep its shape and you will love the tag free design. The sleeves are designed to give you the perfect fit and to prevent unwanted peeking from underneath your outershirt. Each undershirt wicks away moisture so you can stay cool and dry.",
      "parentTitle": "Fruit of the Loom Men's Undershirts, Moisture Wicking & Tag Free, Short Sleeve Crew T-Shirts",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "CUSHIONAIRE Lane Cork Footbed Sandals for Women – Comfortable Double Buckle Slip-On with Genuine Suede Footbed & Arch Support Slides for Women Footwear, BROWN 5",
      "imagesCSV": "81suZ76XHpL.jpg,71qd7sYowGL.jpg,81XGQ9O8QRL.jpg,81Izkt1hAnL.jpg,81lgqacfYOL.jpg,71tXEU83wAL.jpg,71PD1XNZF3L.jpg,61cCHLnoPQL.jpg,715pLDyzSCL.jpg",
      "manufacturer": "CUSHIONAIRE",
      "asin": "B0848K2G15",
      "brand": "CUSHIONAIRE",
      "features": [
        "100% 𝗚𝗲𝗻𝘂𝗶𝗻𝗲 𝗦𝘂𝗲𝗱𝗲 𝗜𝗻𝘀𝗼𝗹𝗲𝘀 – Forms a perfect contour of the foot after being worn in, delivering superior comfort in these womens sandals for all-day wear. 𝗥𝘂𝗻𝘀 𝗦𝗺𝗮𝗹𝗹 For the best fit, go up half a size from your usual size.",
        "𝗣𝗿𝗲𝗺𝗶𝘂𝗺 𝗙𝗮𝘂𝘅 𝗟𝗲𝗮𝘁𝗵𝗲𝗿 𝗨𝗽𝗽𝗲𝗿 – Crafted from high-quality faux leather, featuring a soft lining and adjustable double buckle straps, making these sandals women can trust for a secure and customized fit.",
        "𝗗𝘂𝗿𝗮𝗯𝗹𝗲 𝗧𝗿𝗮𝗰𝘁𝗶𝗼𝗻 𝗘𝗩𝗔 𝗢𝘂𝘁𝘀𝗼𝗹𝗲 – Designed for long-lasting durability and stability, the premium traction outsole provides a secure grip on various surfaces, making these a must-have for your vacation essentials.",
        "𝗙𝗹𝗲𝘅𝗶𝗯𝗹𝗲 𝗖𝗼𝗿𝗸 𝗙𝗼𝗼𝘁𝗯𝗲𝗱 – Experience superior flexibility with the lightweight cork footbed, allowing for natural movement in these womens sandals. Perfect for those who love flat sandals and need a comfortable option for everyday wear.",
        "𝗩𝗲𝗿𝘀𝗮𝘁𝗶𝗹𝗲 1.25\" 𝗣𝗹𝗮𝘁𝗳𝗼𝗿𝗺 – A stylish yet comfortable choice for casual outings, travel, and everyday wear, making them sandals women love. Ideal for pairing with beach essentials, offering a relaxed and effortless style."
      ],
      "description": "Description\n\nWomen's Cushionaire comfort Cork footbed sandal. Stay cool with these high quality sandals that will give you comfort throughout your day.",
      "parentTitle": "CUSHIONAIRE Lane Cork Footbed Sandals for Women – Comfortable Double Buckle Slip-On with Genuine Suede Footbed & Arch Support Slides for Women Footwear",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "ATHMILE T Shirts for Women Graphic Loose Fit Crewneck Short Sleeve Tops Summer Casual Blouse Y2K Basic Tee Beach",
      "imagesCSV": "71pO8bSNAIL.jpg,71QbKZL5ChL.jpg,81QajaWGjAL.jpg,7158rBES7rL.jpg,81JCCshNOaL.jpg,61yqcIoPI8L.jpg",
      "manufacturer": "N/A",
      "asin": "B0CSSPS2ZB",
      "brand": "ATHMILE",
      "features": [
        "Material: The fabric is high quality,soft and lightweight, comfortable to wear and keep you comfy everyday in spring and summer.",
        "Design:Oversized workout shirts for women,short sleeve shirtrs,plus size,round neck,loose fit tops,basic tees,oversized casual blouse,solid color never out of style,easy to match with every style.",
        "Match:This summer fashion oversized t shirts for women is easy to pair with lounge shorts,denim shorts,jeans, sneaker, casual shoes to creating a fashion and pretty looking in spring, summer and fall.",
        "Occasion: Casual lounge summer oversized tops for women,suitable for casual, daily wear,office, party, school, running, sport, gym, dancing, skating, hiking, biking, yogo, spring, summer and fall. It's also a good women clothing gift for your family and friends.",
        "Notice:Please refer to size chart before ordering(NOT AMAZON SIZE); Please feel free to contact us if you have any issues.We will provide you with a satisfactory solution within 48 hours about the oversized shirts for women"
      ],
      "description": "N/A",
      "parentTitle": "ATHMILE Womens Oversized T Shirts Loose Fit Crewneck Short Sleeve Tops Summer Casual Blouse Y2K 2025 Basic Tee Beach",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "baleaf Biker Shorts Women Yoga Gym Workout Spandex Athletic Running Volleyball Tummy Control Compression with Pockets 8\" 2-Pack Black/Black XXXL",
      "imagesCSV": "415dfY04aEL.jpg,81Gvnyz9ykL.jpg,31J+-reWRlL.jpg,41xVK2JvOkL.jpg",
      "manufacturer": "BALEAF",
      "asin": "B07FMZ1LMR",
      "brand": "baleaf",
      "features": [
        "Material: Moisture-wicking, breathable, squat proof and 4-way stretch fabric provide moderate compression and all-day comfort.",
        "High Waistband: Wide elastic waistband provides tummy control. These belly control compression shorts help you maintain a slender figure and prevent sliding while doing yoga or exercise.",
        "Serviceable Pockets: Two pockets on thighs are deep enough to fit 5.5\" smartphones, keys, wallets, and cards. One hidden pocket in the waistband. Convenient for keeping necessities when you go out.",
        "Perfect Inseam: Approx. 8\" inseam, longer inseams provide ample coverage. Gusseted crotch flat lock seams deliver freedom of movement and reduce irritation caused by chafing.",
        "Occasions: Ideal for daily casual wear or yoga, running, volleyball, workout, gym fitness, dance, tennis, cycling, or any type of exercise. Our Baleaf biker shorts combine fashion and function as great gifts for yourself."
      ],
      "description": "BALEAF Women's 8\"/ 5\"/ 3\" Biker Shorts High Waist Yoga Workout Gym Running Volleyball Spandex Shorts with Pockets",
      "parentTitle": "baleaf Women's 8\"/ 5\"/ 3\" Biker Shorts High Waist Yoga Workout Gym Running Volleyball Spandex Shorts with Pockets",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Hanes Mens Cotton, Moisture-wicking Crew Tee Undershirts, Multi-packs, White - 6 Pack, Large US",
      "imagesCSV": "51lcacCccHL.jpg,61eNaXRdPkL.jpg,61BADATB-2L.jpg,81HhCxW23JL.jpg,61FqHi9YQhL.jpg",
      "manufacturer": "Hanes Men's Underwear",
      "asin": "B00D1ARZMC",
      "brand": "Hanes",
      "features": [
        "America's #1 Men's Underwear Brand - Source: Circana/Consumer Tracking Service, U.S. Sales, Underwear Bottoms and Undershirts, 12 months ending November 2023.",
        "CLASSIC FIT - Just-right standard fit, not too tight and not too loose.",
        "QUALITY FABRIC – These men’s t-shirts are crafted from soft, breathable cotton.",
        "KEEP COOL & FEEL FRESH - Cool Comfort moisture-wicking technology wicks away moisture to keep you cool and comfortable. Advanced odor protection technology attacks odor-causing bacteria to keep you feeling fresh.",
        "STAYS TUCKED - A longer hem length is designed to stay tucked in.",
        "DESIGN DETAILS - A crewneck collar is designed to lay flat, while a tag-free interior eliminates the itch caused by scratchy tags."
      ],
      "description": "Description\n\nThese Hanes Dyed Crewneck T-Shirts feature ComfortSoft Cotton that feels great against your skin all day long. The layflat collar will never lose its shape. Available in a convenient 6 Pack.",
      "parentTitle": "Hanes Men's Cotton, Moisture-Wicking Crew Tee Undershirts, Multi-Packs Available",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Womens Plus Size Tops Dressy Casual Trendy Pleating Flowy Summer Shirts Short Sleeve Blouses Hide Belly Fat Navy 4XL",
      "imagesCSV": "71Cbn9aVCOL.jpg,71ieq2X+3vL.jpg,81OTNvZqh-L.jpg,71mWbHjy95L.jpg,71ytTWJ+xIL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DWSX97MV",
      "brand": "OFEEFAN",
      "features": [
        "Great Features: womens tops dressy casual,womens summer tops 2025,spring summer outfits for women,blouses for women dressy casual,adorable pleated front design,simple scooped neck with curved hem,available in floral and solid colors",
        "Loose Fit: this cute tops fits flowy and comfortable,the pleating design helps contour chest area and conceal tummy issues,the puff sleeves hides big arms nicely",
        "Matches:pair this tops with jeans,shorts pants, skirts, capris, or even biker shorts. The curved hem adds a stylish touch, long enough to cover the rear, making it perfect to wear with leggings",
        "Occasions: ideal for daily, casual, business, work, office, date, travel, beach vacation, parties,country concert,shopping,getaways and as a thoughtful gift",
        "Garment Care: machine wash in cold water, dry on low heat, or hang/line to dry. Iron on low settings"
      ],
      "description": "N/A",
      "parentTitle": "OFEEFAN Womens T Shirts Short Sleeve Tops Dressy Casual Blouses Spring Summer Outfits Flowy Pleated Front Scooped Neck",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "G4Free Wide Leg Pants for Women Yoga Leggings with Pockets Loose Lounge Sweatpants for Business Casual Work(Teal,XL,31\")",
      "imagesCSV": "61jC0LgaT1L.jpg,71Z8ZByW3gL.jpg,71s-hfc906L.jpg,81NKcpXNsCL.jpg,81eSS9LgJtL.jpg",
      "manufacturer": "N/A",
      "asin": "B0D794VXMH",
      "brand": "G4Free",
      "features": [
        "Crafted from skin-friendly,soft and moisture-wicking fabric at 0.61-0.64mm thickness, our yoga pants provide luxurious comfort and flexibility for yoga and daily wear. *Note: Fabric may attract dust due to static. To keep clean, use a lint roller for a quick refresh.",
        "Designed with a high waist and streamlined hips, these loose pants beautifully contour your curves, offering a flattering fit for all body types",
        "Featuring 2 front functional pockets for convenient storage, 2 decorative back pockets and faux fly giving you a business dressy and classic look",
        "Our wide leg pants effortlessly transition from elegant when paired with pumps to casual or when styled with athletic shoes, making them versatile for any occasion",
        "These comfy pants are perfect for yoga, casual wear, office attire, or simply lounging at home. Elevate Your Performance with Us! Please note: The INSEAM length provided in the details is the length of the inner leg (from the crotch to the bottom of your ankle), not the overall pant length. Make sure to check this measurement carefully against your needs before purchasing to avoid any sizing issues."
      ],
      "description": "N/A",
      "parentTitle": "G4Free Yoga Pants Women Wide Leg Pants with Pockets High Waist Stretch Dress Casual Sweatpants Petite/Regular/Tall",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "CHARMKING Compression Socks for Women & Men Circulation (3 Pairs) 15-20 mmHg is Best Athletic for Running, Flight Travel, Support, Cycling, Pregnant - Boost Performance, Durability (L/XL,Multi 60)",
      "imagesCSV": "41lr4qAWKeL.jpg,51h88FDX-GL.jpg,511v-Jwfc+L.jpg,51FKbI19AXL.jpg,51SWcPCikBL.jpg,813cRVPzrJL.jpg",
      "manufacturer": "N/A",
      "asin": "B0CHYH1656",
      "brand": "CHARMKING",
      "features": [
        "COMPRESSION SOCKS - We intend combining fashion, technology and science to bring you the triple comfort without. The material of our compression socks are upgraded with nylon percentage from 40% to 85%. Delivers 360-degree stretch for greater flexibility and durability. Breathable high performance fabric keeps an optimal temperature.",
        "COMFORT - We carefully designed and manufactured our compression socks to provide premium support, comfort, and relief without compromising your mobility. Form fitting, lightweight, and breathable fabric features maintain stability regardless of activity.",
        "EFFECTIVE - Our compression socks (15-20 mmHg) are highly recommended by preferred by trainers. These are designed to promote blood circulation and oxygen flow preventing fatigue and helps in muscle recovery. Whether you are an athlete, teacher, flight crew, receptionist, office worker, pregnant, nurturing mother, elderly, our socks are universally suitable for all work.",
        "UNISEX - Two size options available to pick from,suitable for both men and women. Best Gift for women, athletes and runners - Anyone on their feet all day. If you are struggling with a gift idea to a loved one or a casual friend, this is will reduce your anxiety without even you wearing them.",
        "SHOP WITH CONFIDENCE - Your satisfaction is our topmost priority. If you find that our socks do not meet your expectations, we are here to assist you with a solution to ensure you're content with your purchase. Simply reach out to us, and we'll work together to resolve any issues you may have, always aiming to provide you with the best possible customer experience."
      ],
      "description": "Are your foot problems affecting the quality of your daily life?\n\nOn your feet for long hours and looking for Excellent & Effective Support?\n\nHow Does Compression Socks Help You\n\n- Offers sturdiness and stability to your foot with a snug fit, and still allows for full range of motion\n\n- Insulated to keep your feet and leg warm\n\n- Stays in place and does not slide down\n\n- Retains shape even after multiple washes\n\n- Allows greater flexibility & motion with no skin chafing or irritation\n\nCommon occupations that may benefit from compression socks:\n\n- Masseurs, cosmetologists, and stylists\n\n- Frequent travelers or anyone taking a long plane flight\n\n- Teachers, Warehouse, packing, or delivery occupations\n\n- Business people with desk positions that require prolonged sitting\n\n- Construction workers, chefs, line workers, and restaurant serving staff\n\n- Jobs that require you to be on your feet a lot and MORE",
      "parentTitle": "CHARMKING Compression Socks for Women & Men Circulation (3 Pairs) 15-20 mmHg is Best Support for Athletic Running Cycling",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "XIEERDUO Womens Summer Tops Casual Tunic Tops for Women Loose Fit Dressy Short Sleeve Boho Tops for Women 2025 XXL",
      "imagesCSV": "91C+ylGQTOL.jpg,91acVShdDuL.jpg,81WiA0MfHmL.jpg,91woi1sLqkL.jpg",
      "manufacturer": "XIEERDUO",
      "asin": "B0DJ52HRXY",
      "brand": "XIEERDUO",
      "features": [
        "♥Material: Solid Color Shirts--60%Polyester,35%Rayon,5%Spandex. Floral Blouses--95%polyester 5%Spandex. Soft, breathable, comfortable and skin friendly to wear.",
        "♥Feature: Classic crew neck and cap sleeve design provides a flattering fit. Tunic tops with curved hem. Loose fit, basic, simple casual style chic and never out of date. Solid color & cute floral print for your choice.",
        "♥Match: This cute tunic tops great to pair with leggings, variety of jeans, pants, skirts, sweatpants and shorts in summer and spring. It's also nice to wear with blazer, cardigan, coats and jackets. Nice for layering in fall and winter",
        "♥Occasion: This casual tops are perfect for work, business, home, party, club, school, outdoor, shopping, street, travel and daily wear.",
        "♥Care: Machine wash in cold water/ Hang or line dry/ Do not bleach. Tips: This womnes shirts packed with vacuum bag. It may looked wrinkle after open the package. Please wash or iron it before the first wear."
      ],
      "description": "N/A",
      "parentTitle": "XIEERDUO Womens Tops Short Sleeve Shirts Blouses for Women Dressy Casual Cap Sleeve Tops with Curved Hem",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Levi's Women's 501 Original Shorts (Also Available in Plus), (New) Blow Big Horns",
      "imagesCSV": "71KMwRJaVhL.jpg,71ELnfOWrpL.jpg,9102NbKrDYL.jpg",
      "manufacturer": "Levi's",
      "asin": "B0DJVD5XYM",
      "brand": "Levi's",
      "features": [
        "Fitted Through Hip",
        "Straight Leg",
        "High rise: 10.5\"",
        "Inseam: 2.5\", Leg opening: 23 1/4\", Measurements based on size 27 waist",
        "Shrink-to-Fit"
      ],
      "description": "Description\n\nWe didn’t just invent the blue jean—we also invented the first-ever jean shorts. An iconic style that defines your waist and hugs you in all the right places, our 501® Shorts blend with your personal aesthetic for all-around wear.",
      "parentTitle": "Levi's Women's 501 Original Shorts (Also Available in Plus)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Molasus Women's Soft Cotton Underwear Briefs High Waisted Postpartum Panties Ladies Full Coverage Plus Size Underpants Pack of 5,White,3X-Large",
      "imagesCSV": "51siLc8oBxL.jpg,51Si8qMBC0L.jpg,61djI-LCGgL.jpg,61zBwhW7aOL.jpg",
      "manufacturer": "N/A",
      "asin": "B0B27PLFYH",
      "brand": "Molasus",
      "features": [
        "Cotton Stretch full coverage underwear, no pilling, no pinching, no binding,no panty lines, not too tight but not loose, the high waisted underwear offers a bit of tummy support and reduces the appearance of muffin top.",
        "Double-layer Covered waistband(About 2cm elastic inside.) sits right at the belly button. No rolling or bunching, with no compression, perfectly snug but not tight, durable and stretchy but not easy to be deformed.",
        "No riding up underpants with double-layer crotch for added protection, sweat wicking, breathable & healthy.Especially for those who are new mothers the end of pregnancy and post partum,, helping post partum C-Section recovery and post maternity.",
        "Soft & Comfortable Cotton Panties - Fits legs snugly without cutting, waist elasticity does not cut or dig.Adopting the most advanced technology (Steam Pre-shrinking) to ensure that the underwear will last fit.Best choice of female friends/mothers/grandmas.",
        "Stay In Place Cotton Briefs: Comfortable to wear all day long,Avoid embarrassing adjustment during the day Especially when working out at the gym.not sexy but just comfortable. Nice alternative to \"granny panty\" type briefs."
      ],
      "description": "N/A",
      "parentTitle": "Molasus Women's Cotton Underwear High Waisted Full Coverage Ladies Panties (Regular & Plus Size)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "VOYJOY Women Workout Impact Shorts 3.6\"/ 4.5\"/ 6\" Scrunch Butt Lifting Gym Seamless Booty Biker Shorts Mocha",
      "imagesCSV": "71SrQDdSjeL.jpg,71g7QRtAxzL.jpg,81JTxRcszZL.jpg,814hnv+dDAL.jpg,617mo3pRtTL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DPHLSPCK",
      "brand": "VOYJOY",
      "features": [
        "Impact shorts design: Tummy control, low ribbed band, the inseam protects the modesty without overheating during activities，If you are between sizes, we recommend sizing up",
        "Workout scrunch shorts: Flattering fit with the subtle glute contour and scrunch bum seam, impact shorts with the scrunch effect without the intensity of a scrunch, these shorts hug the curves in all the right places",
        "Impact shorts fabric: Sweat wicking, the moisture wicking fabric keeps me dry no matter how intense the workout, no more dreaded thighs sticking together",
        "Layering made easy: In warmer weather, these workout basic shorts pair well with a fitted tank or sports bra，for cooler studios, a matching cropped top can be added",
        "Sizes: If you are between sizes, please to choose one size up"
      ],
      "description": "N/A",
      "parentTitle": "VOYJOY Women Workout Impact Shorts 3.6\"/ 4.5\"/ 6\" Scrunch Butt Lifting Gym Seamless Booty Biker Shorts",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "ANRABESS Women Athletic Dress Summer Tennis Workout Active Sports Mini Romper Dress Built in Shorts Travel Vacation Clothes Hot Pink Medium",
      "imagesCSV": "616TJ48L3RL.jpg,61k2S+IaxNL.jpg,61njDraRCJL.jpg,61dTGymQ3gL.jpg,61FdR2lEbxL.jpg,61Q0KeHPojL.jpg,61Tr5MhCyXL.jpg,61yyOEUsbKL.jpg",
      "manufacturer": "N/A",
      "asin": "B0C69GVP3R",
      "brand": "ANRABESS",
      "features": [
        "Size - XS-(2-4 ), S=US(6-8), M=US(10-12), L=US(14-16), XL=US(18-20),XXL=US(22-24). Please refer to our size chart carefully to find your perfect fit before ordering!",
        "Features - This workout mini dress build in shapewear featured spaghetti straps, V neck, patch pockets, solid color, making it perfect for staying cool and stylish during hot summer days.",
        "Versatile Wear - Beach activities, shopping, tennis, running, daily wear, hang out, etc. This casual mini active dress is ideal for your summer wardrobe, whether you're going out or at home. It can also be paired with sandals, sneaker, boots, and other accessories to create a casual and comfy look.",
        "Fabric - The sleeveless sundress is made by 60% Polyester + 35% Rayon + 5% Spandex. It's soft, lightweight, skin friendly and breathable, keep you cool and comfortable during sports and daily wear, perfect for summer wear.",
        "Wash Care - Keep your summer romper looking its best by hand/machine washing in cold water and hanging it to dry. Iron on padded cloth."
      ],
      "description": "N/A",
      "parentTitle": "ANRABESS Women Athletic Dress Summer Tennis Workout Active Sports Mini Romper Dress Built in Shorts Travel Vacation Clothes",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Comfort Colors Adult Heavyweight Short Sleeve Tee, Style G1717/G1745, Multipack, Ivory - Khaki Logo Center (Print, 1-Pack), Small",
      "imagesCSV": "611z6wwDWYL.jpg,61J8uEvNs3L.jpg,61xsguHtSwL.jpg,71m2eCazeJL.jpg,71BWn03TubL.jpg,71gmC17V5AL.jpg",
      "manufacturer": "Comfort Colors",
      "asin": "B0DMWRT2Z1",
      "brand": "Comfort Colors",
      "features": [
        "Printed logo in Khaki color",
        "Relaxed-fit tee",
        "Soft-washed garment-dyed fabric",
        "Twill-taped neck and shoulders for comfort",
        "Double-needle collar, sleeve, and bottom hems for durability",
        "We recommend washing these garments in cold water with like-colored garments, as some of the pigment dyes may stain light or white colored garments"
      ],
      "description": "Description\n\nWish every day could feel like a laid-back Saturday morning? Just pull on the Comfort Colors G1717 adult tee. The hearty jersey fabric is knitted of the softest 100% cotton that's ring spun, then garment washed to achieve the comfort of a tee that's been washed 50 times. Plus, you can choose from a rich color palette that's as varied as nature itself. So your tee can match your mood, your message and your lifestyle.",
      "parentTitle": "Comfort Colors Short Sleeve Tee, Style G1717",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "THE GYM PEOPLE Thick High Waist Yoga Pants with Pockets, Tummy Control Workout Running Yoga Leggings for Women (Large, Bright Purple)",
      "imagesCSV": "6169LJ9otjL.jpg,61MZ1TvMBcL.jpg,51KbrUu6JXL.jpg,61RsKddRikL.jpg,61oUcN+z0XL.jpg,51aVRv8gjiL.jpg,61vKsf9+oRL.jpg",
      "manufacturer": "N/A",
      "asin": "B0BCW6XYY2",
      "brand": "THE GYM PEOPLE",
      "features": [
        "Please check the Size Chart ( Last Image ) Before Ordering. Please Note: Color May Vary Slightly From Image. and don't worry about size problems, you can through the Online Returns Center exchange it if the yoga pant size doesn't fit",
        "Comfortable High Waist: Wide Waist Elastic Waistband to Cover Navel Which provides Tummy Control and Would not Fall. Suitable for Capri, Workout, Fitness.",
        "Ultra-Stretch Fit ( Enough thickness with breathability: No See-through) Featuring the super soft and skin-friendly material, the Workout Leggings are moisture-wicking with a four-way stretch material that promotes both compression and support. In addition, a gusset crotch to maximize free movement and interlock seams to minimize rubbing and chafing make these leggings for women the perfect Yoga Pant for workout",
        "For Daily Wear:Nylon fabrics have a more natural feeling than polyester ones which makes it perfect for everyday wear.This Yoga Leggings can also act as comfortable shapewear that keeps you hugged in and looking slim",
        "Side Pockets & Inner Pocket: No more worry about your essentials such as phone, wallet, sweat towel when doing every workout thanks to two big pockets on both sides. A hidden inner pocket in the back waistband is designed to conveniently stash your keys, credit cards or other small items."
      ],
      "description": "N/A",
      "parentTitle": "THE GYM PEOPLE Thick High Waist Yoga Pants with Pockets, Tummy Control Workout Running Yoga Leggings for Women",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Amazon Essentials Women's Slim-Fit Camisole, Pack of 4, Black/Brown/Light Brown/White, Large",
      "imagesCSV": "71I4W9g41UL.jpg,71YdpMJDAfL.jpg,81GkSUeIBbL.jpg,81IXComsmyL.jpg,71gDp5+KEQL.jpg,21zApcQEBWL.jpg",
      "manufacturer": "Amazon Essentials",
      "asin": "B08XQWX7CH",
      "brand": "Amazon Essentials",
      "features": [
        "Womens Tops",
        "SLIM FIT: Close fit that hugs the body.",
        "MIDWEIGHT COTTON STRETCH: Cut from a midweight compact cotton with extra stretch. Brings all-day comfort while retaining its shape for the perfect slim fit.",
        "ESSENTIAL CAMI: This versatile cami is a classic wardrobe essential, perfect for layering under your favorite jacket or cardigan or wear on its own with a pair of jeans for easy, everyday style.",
        "DETAILS: Features a scoop neckline, and adjustable thin elastic cami straps."
      ],
      "description": "Description\n\nAmazon Essentials women’s top: Versatile: Perfect for the spring and summer seasons. It pairs seamlessly with pants, jeans, casual trousers, denim shorts, leggings, skirts and more. Occasions: Suitable for home, work, office, travel, vacation, party, weekend gathering or casual daily wear.",
      "parentTitle": "Amazon Essentials Women's Slim-Fit Camisole, Pack of 4",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "ANRABESS Womens Rompers Summer Casual Loose Sleeveless Overalls Spaghetti Strap Shorts Jumpsuit 2025 Beach Vacation Outfits X-Large",
      "imagesCSV": "81lHXLIffGL.jpg,81gmygv0pcL.jpg,71C1I4DmM0L.jpg,81uDTziRxcL.jpg,71DX10oPklL.jpg,71VeAxM8PVL.jpg,61FsMMXVxML.jpg",
      "manufacturer": "N/A",
      "asin": "B0C492GZ6B",
      "brand": "ANRABESS",
      "features": [
        "Fit Type - Loose.",
        "Size - XS=US(0-2), S=US(4-6), M=US(8-10), L=US(12-14), XL=US(16-18), XXL=US(20-22). More details in rich description.If you prefer a snug fit, choose one size smaller.",
        "Material - 60% Polyester + 35% Rayon + 5% Spandex. Stretch - Medium ，Thickness - Medium Softness - High.",
        "Washing - Machine wash cold gently with like colors. Do not bleach or iron.",
        "Features - Women's summer rompers, casual, sleeveless, spaghetti strap.This women's short jumpsuit perfect for daily wear, work, office, vacation."
      ],
      "description": "N/A",
      "parentTitle": "ANRABESS Womens Rompers Summer Casual Loose Sleeveless Overalls Spaghetti Strap Shorts Jumpsuit 2025 Beach Vacation Outfits",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Fruit of the Loom Men's Coolzone Boxer Briefs, Moisture Wicking & Breathable, Multipacks, 5 Pack-Assorted Colors",
      "imagesCSV": "81jOL-i06VL.jpg,41yW1F38itL.jpg,819zbgKfmqS.jpg",
      "manufacturer": "Fruit of the Loom",
      "asin": "B08PM9MP15",
      "brand": "Fruit of the Loom",
      "features": [
        "Eversoft fabric provides premium softness wash after wash",
        "Breathable mesh fly provides ventilation where you need it",
        "Consumer tested, expertly designed",
        "Legs don't ride up",
        "Moisture wicking"
      ],
      "description": "Description\n\nThe Fruit of the Loom® cotton boxer briefs are better than ever! We've added EverSoft® fabric that provides premium softness wash after wash. This collection of black and grey CoolZone® men's boxer briefs are designed with a mesh fly that provides ventilation and support right where you need it most. With legs that don't ride up, and strategically placed breathable mesh, our CoolZone® boxer briefs will keep you cool and comfortable all day. Each pair is carefully crafted and includes moisture wicking benefits designed to help keep you dry and fresh.",
      "parentTitle": "Fruit of the Loom Men's Coolzone Boxer Briefs, Moisture Wicking & Breathable, Assorted Color Multipacks",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "CRZ YOGA Butterluxe High Waisted Lounge Legging 25\" - Buttery Soft Workout Yoga Pants Hot Fudge Brown Small",
      "imagesCSV": "61ptkvZrsPL.jpg,61+S+lGyeuL.jpg,61bEMfi3yfL.jpg",
      "manufacturer": "N/A",
      "asin": "B0CJ9J8BNB",
      "brand": "CRZ YOGA",
      "features": [
        "Designed for yoga or lounge",
        "Butterluxe fabric features extremely soft and ultra stretchy, engineered for luxurious comfort. Very gentle compression",
        "High Rise, 25 inches, 7/8 length intended to sit above ankle",
        "High rise design holds everything in place, provides more coverage",
        "Seamless waistband and squat proof"
      ],
      "description": "Description\n\nCRZ YOGA Butterluxe High Waisted Lounge Legging 25\" - Workout Leggings for Women Buttery Soft Yoga Pants Black Tie Dye Flowers Medium",
      "parentTitle": "CRZ YOGA Butterluxe High Waisted Lounge Legging 25\" - Buttery Soft Workout Yoga Pants for Women",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "LOMON Women's 2025 Fashion Tops 3/4 Length Sleeve Business Casual Blouses Summer Tees Shirts Magenta",
      "imagesCSV": "71e7QT4nvoL.jpg,71dKEcil+dL.jpg,71UxBDujzTL.jpg,71-sLSFlQxL.jpg,71iPJcQTLyL.jpg,71Mf-d+RxHL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DZWSS58J",
      "brand": "LOMON",
      "features": [
        "【Soft and Flexible】LOMON 3/4 Smocked Sleeve Top is skin-friendly and comfortable for everyday wear.Lightweight, soft & high quality fabric (breathable but not see-through).",
        "【V-neck Bouses】LOMON 3/4 length sleeves, delicate floral tunic,V-neck blouse with ruffle cuffs sleeves.",
        "【Ruffle Cuffs】Women's ruffled top is both formal and casual with 3/4 sleeve design for comfort and convenience.",
        "【Leisure & Business】Women's tops can be worn with jeans for a casual look or with formal pants and skirts for a professional look.",
        "【Occasion】Suitable for going out, working, office, vacation, dating, party, travel, vacation and daily wear. It is a must-have trendy clothing in your spring and summer closet."
      ],
      "description": "N/A",
      "parentTitle": "LOMON Women's 2025 Fashion Tops 3/4 Length Sleeve Business Casual Blouses Summer Tees Shirts",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Women’s Longline Sports Bra Wirefree Padded Medium Support Yoga Bras Gym Running Workout Tank Tops (Jasmine Green, Medium, m)",
      "imagesCSV": "71mZ5G+nR4S.jpg,71pFF6ojeJS.jpg,71Yh6vlIw9S.jpg,61UDO42mhhS.jpg,61hZz7LAWiS.jpg,612bqnqpI+S.jpg",
      "manufacturer": "N/A",
      "asin": "B094GRHSQ4",
      "brand": "THE GYM PEOPLE",
      "features": [
        "Soft and Comfortable Material: Crop tank sports bra made of lightweight, breathable and stretchy fabric, sweat-wicking keep you dry.",
        "Full coverage U-back Design: the sports bra for additional support with a removable pad, Great for low and medium impact activities. Full figure with racerback design not only effectively protects against shock, and prevents the bra from shifting, but also beautifies your back curve, increasing the fashion sexy style.",
        "Match: Wear over your favorite sports leggings for an easy yoga workout fit, Great Matches skirts, and shorts for a casual everyday look, Dress it up with slacks or Sweatpants.",
        "Perfect for Fitness & Life: The Sports Bras & Tank Top is ideal for yoga, running, workouts, pilates, dance and daily wear.",
        "Notice: Please check the size information in the description before ordering the Sports Bras"
      ],
      "description": "N/A",
      "parentTitle": "THE GYM PEOPLE Womens' Sports Bra Longline Wirefree Padded with Medium Support",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Amazon Essentials Women's 2-Pack Tank Shirt, -purple/white, Medium",
      "imagesCSV": "61PRDhBQ5PL.jpg,41bd-a4GvfL.jpg",
      "manufacturer": "Amazon Essentials",
      "asin": "B0775PN51S",
      "brand": "Amazon Essentials",
      "features": [
        "Womens Tops",
        "SLIM FIT: Close fit that hugs the body.",
        "COTTON MODAL MICRO RIB: Super soft cotton modal micro rib with added stretch offers all-day ease and comfort, while retaining its shape for the perfect slim fit. Fabric you want to live in year round.",
        "ESSENTIAL RIB TANK: This versatile tank is a must-have wardrobe essential, perfect layered under your favorite hoodie or cardigan or wear on its own with a pair of jeans or linen shorts for easy, everyday style. The slim silhouette gives a flattering fitted look.",
        "DETAILS: Features an open scoop neckline, thin tank straps, and double needle stitching for durability."
      ],
      "description": "Description\n\nAmazon Essentials women’s top: Versatile: Perfect for the spring and summer seasons. It pairs seamlessly with pants, jeans, casual trousers, denim shorts, leggings, skirts and more. Occasions: Suitable for home, work, office, travel, vacation, party, weekend gathering or casual daily wear.",
      "parentTitle": "Amazon Essentials Women's Slim-Fit Tank Top, Pack of 2",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Alaroo Womens Summer Tops 2025 Trendy Tshirts Shirts Cap Sleeve Beach Vacation Clothes Floral Boho Hawaiian Print 24 2XL",
      "imagesCSV": "81psk5NUB1L.jpg,81hMrOfc9rL.jpg,71kRKjotiyL.jpg,81zU-HED7lL.jpg",
      "manufacturer": "N/A",
      "asin": "B0F1CX7DDP",
      "brand": "Alaroo",
      "features": [
        "Material: Print Tops-95% polyester and 5% spandex，Solid Color Tops-60%Polyester,35%Rayon,5%Spandex. This T-shirt is soft and skin-friendly, breathable but won't see through, and will give you comfort throughout the day",
        "Features: Casual Loose T-shirts with Cap Sleeves, Crew Neck. Basic shirt with some glitter design can make this top trendy. Put it on! Be the special one!",
        "Match: Versatile T-shirts are incredibly versatile and go well with variety of jeans, skirts, shorts. It is a real nice addition to your wardrobe",
        "Ocassion: They are perfect for casual, daily, school, work, party, and any other occasions in daily life. Ideal as a good gift to your friend or family.",
        "Tips: Machine Wash or Cold Hand Wash. This women's t-shirts packed with vacuum bag. It may looked wrinkle after open the package. Please wash and iron it to solve the wrinkles."
      ],
      "description": "N/A",
      "parentTitle": "Alaroo Womens Summer Tops Short Sleeve Shirts Crew Neck Cute Trendy Tunic Blouses (S-3XL)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "adidas Men's Athletic 6-Pack, Cushioned Crew Socks with Arch Compression for a Secure Fit, Preloved Fig Purple/Preloved Ink Blue/Cool Light Heather/Graphic, Large",
      "imagesCSV": "81Ao+R6J3sL.jpg,816dkh6qo7L.jpg,91MpWO1PdrL.jpg,81qaQQg55NL.jpg,91GUpI+76mL.jpg,910j6IgOBzL.jpg",
      "manufacturer": "adidas",
      "asin": "B0BZR1NRW9",
      "brand": "adidas",
      "features": [
        "CUSHIONED COMFORT: Cushioned in the foot for comfort, these mens socks provide durability, making them suitable for all-day wear as thick socks for men. Color: Preloved Fig Purple/Preloved Ink Blue/Cool Light Heather",
        "STAY DRY: Moisture-wicking yarns in these mens socks keep feet dry and comfortable",
        "SECURE FIT: Arch compression in these crew socks for men offers a snug fit, helping the socks stay in place while providing support",
        "VERSATILE DESIGN: These mens crew socks are suitable for athletic activities, casual wear, or any occasion demanding comfort, and even as stocking stuffers for adults",
        "DURABLE PERFORMANCE: Crafted to endure wear, these mens athletic socks combine quality with comfort, a staple for men's socks & hosiery in any sock collection"
      ],
      "description": "Description\n\nDiscover a blend of comfort and performance with adidas Men's Athletic Cushioned Crew Socks. These mens socks come with arch compression for a secure fit, making them ideal as arch support socks. Whether you're searching for running socks men or long socks for men, this six-pair pack offers versatility and durability. Crafted from moisture-wicking yarns, these athletic socks for men keep feet dry, giving a comfortable experience all day. The cushioned foot provides extra comfort, while the secure fit supports daily activities, making them suitable as men socks. Experience comfort with a thoughtful design and durability to support your active lifestyle. Whether for everyday wear or intense athletic routines, adidas delivers quality mens socks to meet every demand.",
      "parentTitle": "adidas Men's Athletic Cushioned 6-Pack Crew, Cushioned Crew Socks with Arch Compression for a Secure Fit",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "ODOLY Women's Cork Footbed Slide Sandal, Arch Support Summer Outdoor Sandals with Adjustable Buckle, Genuine Suede Taupe US Women Size 8-8.5, EU Women Size 39",
      "imagesCSV": "71XbQmLMMYL.jpg,717U7Qz538L.jpg,71QeQQH1V0L.jpg,81IJ1cPSy1L.jpg,713CAzZeRWL.jpg,71fcxKOK3fL.jpg",
      "manufacturer": "ODOLY",
      "asin": "B0DMMXZ2C8",
      "brand": "ODOLY",
      "features": [
        "ODOLY Fashion Slide Sandals: Elevate your style effortlessly with these classic summer sandals, suitable for various outfits and scenes. Whether you're dressing up or down, the timeless design complements any wardrobe",
        "Exceptional Arch Support: Experience unparalleled comfort with these two-strap slide sandals, boasting excellent arch support. Say goodbye to discomfort and fatigue, as these sandals are designed to cradle your feet with precision",
        "Comfortable Cork Insole: The natural cork insole of these adjustable sandals not only provides a unique and personalized fit over time but also delivers a cushioned and supportive feel with every step. Just enjoy this luxurious comfort sandal",
        "Release Foot Pain and Plantar Fasciitis: Bid farewell to foot pain and plantar fasciitis with the therapeutic benefits of these sandals. The ergonomic design and supportive features work together to alleviate discomfort, making them a go-to choice for individuals seeking relief",
        "Versatile Outdoor Wear: From leisurely strolls to outdoor adventures, these open-toe sandals are your perfect companion. Their durable construction and anti-slip outsole make them ideal for various outdoor activities, ensuring long-lasting performance."
      ],
      "description": "N/A",
      "parentTitle": "ODOLY Women's Cork Footbed Slide Sandal, Arch Support Summer Outdoor Sandals with Adjustable Buckle",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "SHAPERX Bodysuit for Women Tummy Control Shapewear Seamless Sculpting Thong Body Shaper Tank Top,SZ5215-Sienna-S/M",
      "imagesCSV": "61vpz96mwoL.jpg,614eT5do4OL.jpg,71WmBq8vlvL.jpg,81arFE7VodL.jpg,71bRpdwoEML.jpg,71qmLceaVaL.jpg",
      "manufacturer": "N/A",
      "asin": "B0D1JYVML9",
      "brand": "SHAPERX",
      "features": [
        "【Sizing Tips】Follow our size chart and measure your bust,waist and hip. You may be surprised how \"tiny\" the bodysuit looks during 1st time try-on. But don't worry, the bodysuit is purposely designed with super stretchy fabric so that it will hug you in all right places!",
        "Tummy Control Bodysuit : This seamless shapewear holds in your core, lifts your chest, and smooths your abdomen. Its whisper-soft and seamless construction makes this sculpting piece a necessity for enhancing your body' natural shape.",
        "Comfortable Material: Thong full Bodysuit is made of high-quality fabric, lightweight, stretchy, and skin-friendly. The breast area is made of breathable mesh material, easy and comfortable for all-day long wearing.",
        "No Compression Bra Design: Adjustable straps and no compression bra design fit for all cups.Full back coverage smooths upper Back.Snap closure at crotch for easy maneuvering.",
        "Occasion: The shapewear is invisible beneath your daily clothes because of its seamless surface, light color. You can wear it anywhere with any outer clothing, such as shorts, low-cut blouses, skirts. It fits Office, Daily Wear, Sleep, Party, etc."
      ],
      "description": "N/A",
      "parentTitle": "SHAPERX Women's Shapewear Bodysuit Tummy Control Body Shaper Seamless Sculpting Snatched Waist Body Suit",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "wernies Women No Show Socks Invisible Loafer Flat No Slip Rise Flats Ankle Liners Short Thin Low Cut, white, 5-8",
      "imagesCSV": "71fcxuuC-xL.jpg,71J2IparQxL.jpg,71-00z4Sp7L.jpg,61DiKbbqIEL.jpg,81ZCQLTEVfL.jpg,61CvPQ44sOL.jpg,71UIn9KzokL.jpg",
      "manufacturer": "wernies",
      "asin": "B07WT225KN",
      "brand": "wernies",
      "features": [
        "PREMIUM MATERIAL - Natural combed cottons are grown using methods and materials that have a low impact on the environment,is simply better for your health. Fibre with strong elasticity, breathable and comfortable, these women no show socks are ideal for indoor and outdoor activity",
        "WELL MADE CUFF - The Ergonomically designed with arch support well made cuff make liner invisible socks fit your feet perfectly, will not be tight and neither loose,soft, elastic,quick-drying,machine washable",
        "NOT SLIDE DOWN - No show socks women for flats with 3 silicone heel grip technology ensures non-slip and your loafer socks stay put all day long",
        "INVISIBLE WEAR - The low cut socks with basic colors creates an invisible wear inside shoes. Suitable for lady's shoes, like sneakers, loafers and sport / athletic shoes (NOTE: This socks is NOT a SUPER LOW socks for Women Flats or extreme low fashion slip-ons )",
        "OUR SERVICE - WERNIES provides top quality and excellent customer service. If you have any questions, please contact us, we will do our best to help you solve the problem"
      ],
      "description": "N/A",
      "parentTitle": "wernies No Show Socks Women Low Socks Non Slip Flat Boat Line 4/8 Pairs",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Amazon Essentials Women's Lightweight Crewneck Cardigan Sweater (Available in Plus Size), Caramel, Medium",
      "imagesCSV": "91KNLEU2YpL.jpg,41XBchQnzlL.jpg,81M1Z+csisL.jpg,811dKGEn4uL.jpg,71H0Uy2yvyL.jpg,81sij2v+npL.jpg,A1v8DAcuKtL.jpg,71hDbrNV7ZL.jpg,41JLi0SCAtL.jpg",
      "manufacturer": "Amazon Essentials",
      "asin": "B08T7JBK4N",
      "brand": "Amazon Essentials",
      "features": [
        "REGULAR FIT: Close but comfortable fit through chest, waist, and hips.",
        "COTTON BLEND LIGHTWEIGHT SWEATER YARN: Soft, lightweight sweater yarn with beautiful drape.",
        "CARDIGAN SWEATER: A modern, classic layering piece, perfect for both a polished and casual look.",
        "DETAILS: Features a crew neck and a button front closure for versatile styling. Rib detail at cuffs, and hem."
      ],
      "description": "Description\n\nWe listen to customer feedback and fine-tune every detail to ensure our clothes are more comfortable, higher quality, and longer lasting—at affordable prices for the whole family.",
      "parentTitle": "Amazon Essentials Women's Lightweight Crewneck Cardigan Sweater (Available in Plus Size)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Niidor 2025 New Magnetic Sticky Bra Strapless Adhesive Invisible Push up Silicone Bra with Magnetic Clasp for Women Backless Dress",
      "imagesCSV": "61dbHM2V7JL.jpg,71F1BZNolwL.jpg,71IjLtzJK6L.jpg,71vLz9m8KBL.jpg,71o4dC7pkRL.jpg,71LdLhi7hNL.jpg",
      "manufacturer": "N/A",
      "asin": "B0DXV6H1JR",
      "brand": "Niidor",
      "features": [
        "UPGRADED MAGNETIC CLASP STICKY BRA – Easy On/Off: Ditch flimsy plastic hooks! Niidor invisible sticky bra magnetic Clasp snaps effortlessly for a seamless look under sheer fabrics and ensures quick, damage-free removal. No more tugging or broken clasps—just smooth, secure adjustability.",
        "DOUBLE-LAYER LATEX FOR UNMATCHED SUPPORT & LIFT: Niidor strapless bra features an innovative dual-layer latex design that creates a deep V curve. Its high-strength adhesive and reinforced structure offer 2X the lift of standard sticky bras, ensuring a confident, all-day hold without wires or straps.",
        "ULTRA-STRONG ADHESIVE – Stays Put All Day & Night!: Niidor sticky bra features a 360° upgraded infant-grade adhesive, this adhesive bra grips securely to your skin—even during dancing or summer heat. Perfect for low-back gowns, strapless tops, and daring necklines that demand flawless invisibility.",
        "INVISIBLE & SKIN-LOVING COMFORT: Dermatologist-tested adhesive and latex materials prevent irritation. Lightweight, sweat-resistant design keeps you comfy for 12+ hours—no redness, no itch, just a second-skin feel.",
        "REUSABLE & EASY-CARE: Niidor’s premium design withstands repeated use, unlike single-use sticky bras. Gently hand-wash with mild soap, air-dry, and restore adhesive strength with included storage film. A cost-effective staple for weddings, vacations, or date nights!"
      ],
      "description": "N/A",
      "parentTitle": "Niidor Adhesive Strapless Bra for Women Sticky Invisible Push up Silicone Bra for Backless Dress 2025 Upgraded Clasp Bras",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "VOENXE Basic Seamless Women Underwear Thongs,No Line Ladies Panties,Comfortable Active Sports Thong,Invisible Workout Undies 5 Pack, Basic, X-Small",
      "imagesCSV": "31xMYf87xwL.jpg,310MbCvj4IL.jpg,314Hk6IkaBL.jpg,51w3O3k+1qL.jpg,31rzyCssVzL.jpg,41dKPelkRNL.jpg",
      "manufacturer": "VOENXE",
      "asin": "B0CL2BG9MQ",
      "brand": "voenxe",
      "features": [
        "(Important Reminder for Buyers)To comply with Amazon's policy,please try on underwear over clothing to avoid direct body contact.This is essential for eligibility for returns or exchanges.We recommend checking the fit as soon as you receive your items to ensure satisfaction",
        "(Innovative Design Features)Our underwear is crafted with cutting-edge materials that prioritize your comfort.The crotch is lined with ultra-soft,breathable cotton for all-day ease, while the outer layer features a thin, breathable mesh made of durable nylon that combats shrinkage and enhances airflow.This innovative design not only keeps you feeling light and fresh but also ensures that panty lines remain invisible,giving you a flawless silhouette no matter what you wear",
        "(A Colorful Selection)Express yourself with our vibrant color palette! Choose from playful floral prints to ignite romance, uplifting pinks to brighten your everyday, or classic whites that showcase your beautiful tan at the beach.No matter your mood or occasion, we have the perfect hue for you",
        "(Empowering Choices for Every Woman)Strong, confident women deserve underwear that reflects their power. Whether you're seeking comfortable loungewear for home, discreet options for work, or durable thongs that keep up with your active lifestyle, our collection is tailored to meet your needs",
        "(Your Perfect Fit Awaits)With extensive research and a detailed size database, our underwear is crafted to accommodate a diverse range of body shapes.We aim to deliver a fit that feels just right—comfortable and supportive without any restriction. (Please refer to the sizing chart in the description to discover your ideal size.)"
      ],
      "description": "N/A",
      "parentTitle": "voenxe Seamless Women Underwear Thongs,No Show Ladies Thong,No Line Workout Breathable Comfortable Panties,Soft Undies,5-Pack",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Womens Tops Summer 2025 Dressy Casual Blouses Shirts Ladies Plus Size Womens Clothing Fashion XL",
      "imagesCSV": "91HlYjty4gL.jpg,81H1ydAIcoL.jpg,819Im4mzBjL.jpg,81tlk-QYEbL.jpg,91HW6ngz0ZL.jpg",
      "manufacturer": "N/A",
      "asin": "B0F3CY79N5",
      "brand": "SAMPEEL",
      "features": [
        "✦Ruched Design: T shirts for women with feminine side shirring that hides the belly and flatters the figure. The crew neck allows you to bend over freely, while the cap sleeves enhance the silhouette of the shirt, making it look dressier than a plain t-shirt.",
        "✦Match: The versatile summer tops are easy to pair with jeans, shorts, slacks, skirts, capris, and more. You can wear it alone or layer it under a suit, blazer, or cardigan in air-conditioned rooms.",
        "✦Occasion: Simple yet stylish tshirts shirts for daily wear, around the home, office work, business casual, vacations, resorts, cruise outfits, OOTD, errands, shopping, date nights, going out, and more. It's a must-have summer staple for your closet.",
        "✦Please Refer to the SAMPEEL Size Chart before Ordering. Any other questions, please contact us anytime!",
        "✦Ideal Surprise Choice: This soft short sleeve shirt is an ideal choice for your friends and family, sure to bring a delightful surprise!"
      ],
      "description": "N/A",
      "parentTitle": "SAMPEEL Womens Summer Tops Trendy 2025 Ruched Cap Short Sleeve Tshirts Shirts Crew Neck T Shirts Fashion",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Levi's Men's 501 Original Fit Jeans (Also Available in Big & Tall), Nickel Black (Waterless), 29W x 30L",
      "imagesCSV": "41qNYVnv9yL.jpg,41YWHxunf7L.jpg,51t2uzTSrKL.jpg,51XB-eUIkfL.jpg",
      "manufacturer": "Levi's",
      "asin": "B00ALS33PA",
      "brand": "Levi's",
      "features": [
        "Regular Through The Thigh",
        "Straight leg",
        "Sits at your waist",
        "Front rise: 11 1/4\", Knee: 17 1/2\", Leg Opening: 16\", Measurements based on size 32."
      ],
      "description": "Keep it dark and clean by washing as little as possible, or repeat washings to fade them to your liking",
      "parentTitle": "Levi's Men's 501 Original Fit Jeans (Also Available in Big & Tall)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Wrangler Authentics Men's Big & Tall Relaxed Fit Stretch Cargo Pant, Black, 50W x 30L",
      "imagesCSV": "71jpUDOkZUL.jpg,71AlDhgfazL.jpg,61vL0NyBXHL.jpg,61hsEcBFzmL.jpg,715jN76yKBL.jpg,81uOQttPEZL.jpg,810g4H2OD7L.jpg",
      "manufacturer": "Wrangler Authentics",
      "asin": "B08881N7Q7",
      "brand": "Wrangler Authentics",
      "features": [
        "RELAXED FIT. These cargo pants sit at the natural waist. Designed with a relaxed fit through the seat and thigh, these cargos will keep you comfortable during any task.",
        "STRETCH TWILL. A Wrangler classic, these straight-leg men's pants have stretch and flexibility for comfort in movement. A Hollywood waistband offers extra support with your favorite belt.",
        "CLASSIC CARGO PANT. This classic cargo pant is sure to be comfortable and functional for everyday wear. From the outdoors to work, this pant is built for versatility with a timeless silhouette and extra storage.",
        "HEAVY-DUTY HARDWARE. Finished with a heavy-duty zipper fly and button closure.",
        "QUICK-ACCESS STORAGE. Equipped with (6) pockets for maximum storage capacity. (2) side cargo flap pockets, (2) slash pockets, and (2) back patch pockets, for easy-access storage. Great for safely storing your cell-phone, tools, wallet, and other personal items or gadgets."
      ],
      "description": "Description\n\nWrangler Authentics Men's Classic Cargo Stretch Twill Pant. This classic cargo pant is constructed with durable materials built for long-lasting comfort. This cargo pant sits at the natural waist and features a relaxed fit through seat and thigh. Stretch fabric moves with your body, whether you're working in the yard or busy with the family on the weekend. (6) Pockets. (2) cargo side pockets (2) back patch pockets, and (2) slash pockets.",
      "parentTitle": "Wrangler Authentics Men's Relaxed Fit Stretch Cargo Pant",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "travel inspira Luggage Scale, Portable Digital Hanging Baggage Scale for Travel, Suitcase Weight Scale with Rubber Paint, 110 Pounds, Battery Included - Black",
      "imagesCSV": "61S04DgdJSL.jpg,61zuJNc8BBL.jpg,51N7czTItjL.jpg,611w9XSE00L.jpg,71yZXx35PJL.jpg,61JFawiC+0L.jpg",
      "manufacturer": "travel inspira",
      "asin": "B01CNGXR8K",
      "brand": "travel inspira",
      "features": [
        "[Travel without stress] This hanging baggage scale easily prevents overweight baggage charges; a must-have for traveling.",
        "[110-lbs Max Capacity] The travel weight scale has 110lb/50kg weight capacity, allowing you to use it for even those oversized bags. Graduation of portable electronic scale: 0.1lb/50g. Suitcase electronic scale weights 3.5 ounces, small and convenient. No extra space is required to start your adventure.",
        "[Multifunction digital scale] Backlight LCD display is easy to read the digital luggage scale in dim light and bright light. Rubberized handle is comfortable to grip. The data lock function gives you more time to read the results.",
        "[Perfect for travel] Auto-Off feature preserves battery power. Low battery and overload indications. CR2032 battery included.",
        "[Satifaction guaranteed] The ideal gift for travellers, hikers, or anyone who frequently ships packages. Come with a 2-Year Limited warranty from travel inspira."
      ],
      "description": "N/A",
      "parentTitle": "travel inspira Luggage Scale, Portable Digital Hanging Baggage Scale for Travel, Suitcase Weight Scale with Rubber Paint, 110 Pounds, Battery Included",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Rustler Men's Classic Relaxed Fit Jean, Dark Stonewash, 42W x 34L",
      "imagesCSV": "71HVSFd9fyL.jpg,31FrpImJQUL.jpg,413ctCmzdjL.jpg,81JUXgahzoL.jpg,81OWITH0kWL.jpg,61KS+ojnxmL.jpg",
      "manufacturer": "Rustler",
      "asin": "B07LGLQ94M",
      "brand": "Rustler",
      "features": [
        "Relaxed fit thru seat and thigh",
        "5 pocket styling",
        "Straight leg",
        "Heavy weight durable denim"
      ],
      "description": "Description\n\nThank us later for jeans that you don’t have to worry about. Each pair of Rustler jeans is made to be durable and long-lasting, all without sacrificing the comfort you want and the terrific value you expect. Available in a variety of colors and fits, our straight leg men’s jeans are sure to keep up, no matter the activity.",
      "parentTitle": "Rustler Men's Classic Relaxed Fit Jean",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Levi's Men's 505 Regular Fit Jeans (Also Available in Big & Tall), Under Pressure-Stretch, 36W x 32L",
      "imagesCSV": "41eBf+8mP0L.jpg,31YsnygQ5RL.jpg,31BhPuRtETL.jpg,512k3tbqSlL.jpg",
      "manufacturer": "Levi's",
      "asin": "B084DL4G81",
      "brand": "Levi's",
      "features": [
        "LEVI'S 505: These jeans feature a classic straight leg styling created in 1967 with the original zip fly and 5 Pocket Styling.",
        "SIZE & FIT: These 505 Regular jeans sits at the waist with a straight leg opening and designed with room in the thigh for a comfortable fit.",
        "MATERIAL & FABRIC: Levi's 505 jeans are made from a cotton blend.",
        "CARE INSTRUCTIONS: Machine wash cold inside out with like colors, Do not bleach, Tumble dry medium, Hot iron if needed, Dry cleaning possible."
      ],
      "description": "Find your favorite pair of blue jeans for men, a timeless classic fit. While some denim styles may come and go, our men's jeans have always been timeless. Get Levi's men's straight leg jeans for a balanced cut that is simple and casual.",
      "parentTitle": "Levi's Men's 505 Regular Fit Jeans (Also Available in Big & Tall)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Hagon PRO Disposable Rain Ponchos for Adults (5 Pack)",
      "imagesCSV": "7177eAY1WoL.jpg,51bmYi5oOAL.jpg,71bLbEDKGEL.jpg,71VZQidrt-L.jpg,51pfqiY0DvL.jpg,71tgMYdw1uL.jpg,51k1PJgIoHL.jpg,41y-gM13REL.jpg",
      "manufacturer": "Hagon PRO",
      "asin": "B0B94627B6",
      "brand": "Hagon PRO",
      "features": [
        "Reliable Rain Protection On-the-Go: Stay dry and confident during sudden downpours with Hagon PRO disposable rain ponchos, offering full-length 48\" x 40\" coverage and a secure hood for complete weather protection. Perfect for commuters, festival-goers, emergency kits and preparedness kits, these transparent rain coats keep you ready for anything",
        "Compact, Travel-Friendly Design: Hagon PRO poncho folds into a compact 4\" x 6\" size, making it easy to pack in your bag, glove compartment, or jacket pocket. A must-have travel essential, it’s perfect for family vacations, road trips, or commutes—always be ready for sudden weather changes without taking up space",
        "Comfortable Fit for All Adults: Designed with a roomy, one-size-fits-most fit, including plus sizes, our rain ponchos easily slip over backpacks, clothing or gear. Stay cool and comfortable even on hot, humid days, thanks to a design that eliminates the sauna effect, making them the perfect rain gear for adults and a smart addition to any survival kit",
        "Extra Durable PE Plastic Material: Crafted from tear-resistant 0.035mm PE plastic, Hagon PRO heavy duty raincoat ponchos are 2x thicker and sturdier than standard disposable ponchos. Tough enough to handle wind and rain, they give you peace of mind in any weather and belong in every hurricane essentials kit",
        "Versatile Outdoor Essentials for Any Activity: Whether you’re hiking through rugged trails, attending stadium events, music festivals, camping, visiting Disneyland, amusement theme parks or universal studios, our waterproof ponchos are must-haves for outdoor adventures and essential accessories for staying dry in any condition. Stay worry-free and focus on making memories, rain or shine",
        "Waterproof Hooded Poncho for Extra Coverage: Enjoy the freedom to explore, rain or shine, with a waterproof hood that keeps your hair and face dry while offering clear visibility. Feel safe, comfortable, and carefree, knowing you’re fully protected on any sudden rainstorms",
        "Lightweight Yet Sturdy: Hagon PRO clear raincoat gear is lightweight for all-day wear yet strong enough to handle windy, rainy conditions. Its transparent, minimalist design complements any outfit, making it suitable for both casual outings and formal events. Enjoy your day with freedom and confidence, rain or shine",
        "Bulk-Ready for Any Need: The Hagon PRO disposable rain ponchos for adults 5 pack is perfect for bulk use at charity drives, group outings, or donating to homeless shelters. Designed with convenience and care, these unisex ponchos are a reliable solution for any large-scale need, from community events to emergency preparedness kits",
        "Single-Use Convenience: Designed for one-time use, these parka panchos rain for adult provide a hassle-free, disposable option for travel, outdoor activities, or unexpected weather. No cleanup required, so you can stay focused on what matters. Plus, they come in recyclable packaging, offering a more eco-conscious way to stay prepared for unexpected weather",
        "Get creative with Hagon PRO waterproof ponchos for more than just rain protection. Use them to decorate your Halloween skeletons with LED string lights for a haunting glow or add them to your Christmas stocking stuffers for a fun and practical holiday gift. Whether for festive fun, DIY crafts, or emergency kits, these ponchos bring versatility to every occasion"
      ],
      "description": "N/A",
      "parentTitle": "Hagon PRO Disposable Rain Ponchos for Adults (5 Pack)",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Crocs Unisex-Adult Classic Clogs (Best Sellers), Orange Zing, 7 Men/9 Women",
      "imagesCSV": "61bD93ai0aL.jpg,51xJaAJawHL.jpg,61FlQQIHH0L.jpg,61wdliaPxmL.jpg,51HIX6BDHpL.jpg,51pluv5YhNL.jpg,51b3dOqGHKL.jpg",
      "manufacturer": "Crocs",
      "asin": "B09774JQQY",
      "brand": "Crocs",
      "features": [
        "Size Recommendation: We recommend sizing down (e.g. if you are a 7.5, size down to a 7)",
        "Crocs for Women and Men: The Crocs Classic Clogs are not only the most comfortable shoes for women and men but also easy to clean just using soap and water and allowing for a quick dry",
        "Lightweight and Fun: Experience the ultimate in lightweight comfort with these Crocs for men and women. Their iconic Crocs comfort is perfect for all-day wear, and the ventilation ports enhance breathability while quickly shedding water and debris",
        "Material with a Purpose: The Classis Clog is made with our innovative Croslite compound, which now contains 25% bio-circular materials like cooking oil from other industries and is calculated through mass balance (ISCC PLUS Certified)",
        "Shop with Confidence: Crocs products are backed by our 90-day manufacturer's warranty for high quality and authenticity. Terms and conditions apply"
      ],
      "description": "Description\n\nCrocs Classic clog",
      "parentTitle": "Crocs Unisex Adult Classic Clog",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    },
    {
      "title": "Womens Short Cardigans Casual Cover Up Open Front Kimono Tops Bathings Suit Shawl (White Colorful Leaves,2XL)",
      "imagesCSV": "81thEc7AVCL.jpg,8194542q-9L.jpg,818oJXHFqML.jpg,81viBgZX0+L.jpg,812sWGeNjJL.jpg,81C08EMksgL.jpg",
      "manufacturer": "CHICGAL",
      "asin": "B0CJRQZF1V",
      "brand": "CHICGAL",
      "features": [
        "Womens casual tops like this fashion kimono cardigans, open front coverups, style as blouse shirt has a bit of give to make for a great fit. you’d land on a beautiful fitting shrug capes to complement your shape and style .",
        "The hawaiian cardigan is made of chiffon.The Lightweight material is comfortable and breathable. We’ve used sheer fabric that never irritates your skin. So you’ll be reeling in total comfort as you soak up for swimwear .",
        "The stylish clothing are perfect to travel, daily wear, beach,wedding,pool, home hawaii,cruise shopping, party, vacation ect. Perfect to match with all kind of ,swimsuit ,shoes,bags and hair styles.Easy to dress up or down in Spring, Summer, Fall. Perfect Christmas ,New Year ,Valentine's day , birthday gift for family and girlfriend.",
        "This cute shawl wraps for women can be worn as resort vacation must have cover ups with almost any outfit, such as Leggings or Jeans, Shorts, Skirt,dress,shirts or tanks top. Trendy & Classic little lady’s shirts and timeless open front styling, add to fashionable elements for your dress to create your charming look.",
        "S-12XL Please check the kimonos size chart before purchasing. Whether you’re petite, plus size, or somewhere in between, you’ll find perfectly-fitting cardigans from our sizes."
      ],
      "description": "N/A",
      "parentTitle": "Women's Floral Print Puff Sleeve Kimono Cardigan Loose Cover Up Casual Blouse Tops",
      "starRating": "N/A",
      "category": "Clothing, Shoes & Jewelry",
      "categoryId": 7141123011
    }
  ]
}