{
  "productDetails": [
    {
      "title": "The Let Them Theory: A Life-Changing Tool That Millions of People Can't Stop Talking About",
      "imagesCSV": "91ZVf3kNrcL.jpg",
      "manufacturer": "Hay House LLC",
      "asin": "1401971369",
      "brand": "Hay House",
      "features": [],
      "description": "#1 New York Times Bestseller\n#1 Sunday Times Bestseller\n#1 Amazon Bestseller\n#1 Audible Bestseller\n\nA Life-Changing Tool Millions of People Can’t Stop Talking About\n\nWhat if the key to happiness, success, and love was as simple as two words?\n\nIf you've ever felt stuck, overwhelmed, or frustrated with where you are, the problem isn't you. The problem is the power you give to other people. Two simple words—Let Them—will set you free. Free from the opinions, drama, and judgments of others. Free from the exhausting cycle of trying to manage everything and everyone around you. The Let Them Theory puts the power to create a life you love back in your hands—and this book will show you exactly how to do it.\n\nIn her latest groundbreaking book, The Let Them Theory, Mel Robbins—New York Times bestselling author and one of the world's most respected experts on motivation, confidence, and mindset—teaches you how to stop wasting energy on what you can't control and start focusing on what truly matters: YOU. Your happiness. Your goals. Your life.\n\nUsing the same no-nonsense, science-backed approach that's made The Mel Robbins Podcast a global sensation, Robbins explains why The Let Them Theory is already loved by millions and how you can apply it in eight key areas of your life to make the biggest impact. Within a few pages, you'll realize how much energy and time you've been wasting trying to control the wrong things—at work, in relationships, and in pursuing your goals—and how this is keeping you from the happiness and success you deserve.\n\nWritten as an easy-to-understand guide, Robbins shares relatable stories from her own life, highlights key takeaways, relevant research and introduces you to world-renowned experts in psychology, neuroscience, relationships, happiness, and ancient wisdom who champion The Let Them Theory every step of the way.\n\nLearn how to:\n\nStop wasting energy on things you can't control Stop comparing yourself to other people Break free from fear and self-doubt Release the grip of people's expectations Build the best friendships of your life Create the love you deserve Pursue what truly matters to you with confidence Build resilience against everyday stressors and distractions Define your own path to success, joy, and fulfillment . . . and so much more.\n\nThe Let Them Theory will forever change the way you think about relationships, control, and personal power. Whether you want to advance your career, motivate others to change, take creative risks, find deeper connections, build better habits, start a new chapter, or simply create more happiness in your life and relationships, this book gives you the mindset and tools to unlock your full potential.\n\nOrder your copy of The Let Them Theory now and discover how much power you truly have. It all begins with two simple words.\n\nThe cover has been updated to include the name of co-author Sawyer Robbins. Customers may receive either version of the cover at random.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Sunrise on the Reaping (A Hunger Games Novel) (The Hunger Games)",
      "imagesCSV": "61o5Q8IIq4L.jpg,41f9LHDfOsL.jpg,71lV+xZyebL.jpg,71gQojIKSoL.jpg",
      "manufacturer": "Scholastic Press",
      "asin": "1546171460",
      "brand": "N/A",
      "features": [],
      "description": "The phenomenal fifth book in the Hunger Games series!\n\nWhen you’ve been set up to lose everything you love, what is there left to fight for?\n\nAs the day dawns on the fiftieth annual Hunger Games, fear grips the districts of Panem. This year, in honor of the Quarter Quell, twice as many tributes will be taken from their homes.\n\nBack in District 12, Haymitch Abernathy is trying not to think too hard about his chances. All he cares about is making it through the day and being with the girl he loves.\n\nWhen Haymitch’s name is called, he can feel all his dreams break. He’s torn from his family and his love, shuttled to the Capitol with the three other District 12 tributes: a young friend who’s nearly a sister to him, a compulsive oddsmaker, and the most stuck-up girl in town. As the Games begin, Haymitch understands he’s been set up to fail. But there’s something in him that wants to fight . . . and have that fight reverberate far beyond the deadly arena.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Try Not to Laugh Challenge, Easter Joke Book for Kids: Easter Basket Stuffer for Boys, Girls, Teens & Adults, Fun Easter Activity Book with Cute ... Easter Activities for the Whole Family!",
      "imagesCSV": "41XZlhQ+5NL.jpg,51FImkBN5UL.jpg",
      "manufacturer": "CreateSpace Independent Publishing Platform",
      "asin": "1986554902",
      "brand": "N/A",
      "features": [],
      "description": "Great Easter Joke Book for all Ages! This Easter Joke Book has over 275 Eggs-tra Funny Jokes, Silly Riddles and Laugh out loud Knock-Knock Jokes along with Comical Art Work! The Easter Gift that will provide hours of Fun for Friends & Family! Perfect for all ages! Best Easter Basket Stuffer for all! The Rules are Simple: Pick your team, or go one on one. Sit across from each other & make eye contact. Take turns reading jokes to each other. You can make silly faces, funny sound effects, etc. When your opponent laughs, you get a point! First team to win 3 points, WINS! If You’re Laughing, You’re Losing!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Pete the Cat and the Easter Basket Bandit: Includes Poster, Stickers, and Easter Cards!: An Easter And Springtime Book For Kids",
      "imagesCSV": "91yskyVPAmL.jpg,51JTb3mTm0L.jpg,51xfzt8tD4L.jpg,41aTvR9snCL.jpg,516LeqDVw9L.jpg",
      "manufacturer": "HarperCollins",
      "asin": "0062868373",
      "brand": "HarperCollins",
      "features": [],
      "description": "Pete and his friends hunt for his missing Easter basket in this storybook—complete with a fold-out poster, stickers, and cards perfect for Easter celebrations!\nIt’s Easter morning, and Pete's Easter basket is nowhere to be found! Who could’ve taken it?\nReaders will love helping Pete and his friends find the Easter Basket Bandit and learn that sharing is the sweetest gift of all!\nPete the Cat and the Easter Basket Bandit is a must-have gift for Easter baskets!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "How To Draw Everything: 300 Drawings of Cute Stuff, Animals, Food, Gifts, and other Amazing Things | Book For Kids",
      "imagesCSV": "51FaEQi313L.jpg,51hc6blgoRL.jpg",
      "manufacturer": "Independently published",
      "asin": "B0CNQ5X4Y1",
      "brand": "Independently Published",
      "features": [],
      "description": "Bring the Drawing Magic to Your Kids with this How to Draw Book with 300 Drawings!\nIntroduce your child to the enchanting world of drawing with this easy-to-follow guide that is perfect for helping kids develop sketching, creative and coloring skills.\nFeatures of this book: Simple Step-by-Step Instructions with clear directions, arrows, and illustrations, children can quickly learn to draw cute animals, fruits, and many other amazing things Practice Space with a dedicated area for freehand drawing and experimenting. Coloring Funafter drawing, when kids can color their creations, enhancing their artistic expression. Awesome Gift for Kids to share special moments together and having a fun experience.\nGet this delightful drawing book today and unlock your child's artistic potential!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Don't Push the Button! An Easter Surprise: (Easter Board Book, Interactive Books For Toddlers, Childrens Easter Books Ages 1-3)",
      "imagesCSV": "81DdjyAKpiL.jpg,31h0RD7hEDL.jpg,317P8L40+NL.jpg,41wtD34vFKL.jpg,41BJP8-W05L.jpg,41IvQHcoM-L.jpg,31v2DmP+OuL.jpg,418JI9QqF5L.jpg",
      "manufacturer": "Sourcebooks Jabberwocky",
      "asin": "1492680117",
      "brand": "Sourcebooks Jabberwocky",
      "features": [],
      "description": "The perfect Easter basket stuffer! Go on a festive and fun-filled adventure with Larry the monster in this interactive Easter edition of the USA Today bestselling series, Don't Push the Button!\nLarry is SO excited for Easter! Aren't you?\nI don't think the Easter Bunny is watching; but…\nWhatever you do…DON'T PUSH THE BUTTON!\nWhen it comes to Easter basket gifts for babies and toddlers, this adorable, interactive book is a MUST!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "How to Giggle: A Guide to Taking Life Less Seriously",
      "imagesCSV": "51LKK0z--SL.jpg,416canfv9BL.jpg,31n92PxsFoL.jpg,41bAhUkqQEL.jpg,41GnkMk9SgL.jpg,51OwiimVlvL.jpg,4121fVSNNuL.jpg",
      "manufacturer": "S&S/Simon Element",
      "asin": "1668056003",
      "brand": "N/A",
      "features": [],
      "description": "From the wildly popular podcast Giggly Squad, best friends Hannah Berner and Paige DeSorbo share hilarious and heartwarming advice on how to take life a little bit less seriously.\n\nFinding joy and laughter in the mundane can be challenging at times, but Hannah Berner and Paige DeSorbo have mastered the art of not taking life too seriously. Brought together under the bright lights of reality television, these best friends bonded in incredibly intense circumstances. They quickly came to realize that one of the bedrocks of their friendship is their shared experience with social anxiety. As their friendship deepened, they found themselves constantly devolving into laughter, earning them the nickname “The Giggly Squad,” and with that, their superpower—laughing through life’s hardest moments—was born. Their podcast, Giggly Squad, feels like calling your best friend for a long overdue catch-up. No topic is off limits. No subject too small. And, most importantly, nothing is so serious that you can’t find a way to make it seem less scary by poking fun at it.\n\nHow to Giggle covers topics like:\n-Overcoming awkward situations\n-Red flags in female friendships and romantic relationships\n-Using delusion and manifestation to achieve your goals\n-Decentering men from your life\n-And more!\n\nSprinkled with inside jokes and Hannah and Paige’s riotous humor, How to Giggle feels like you’re at a slumber party with your besties giving you juicy advice on sex, flirting, and social media etiquette. You’ll find the nostalgia of your teen magazines with fun, interactive quizzes, and tips like finding your personal style and wellness hacks. If you’re a longtime Giggler or are simply craving some unfiltered advice to get you through hard times, look no further than How to Giggle.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Forgotten Home Apothecary : 250 Powerful Remedies at Your Fingertips",
      "imagesCSV": "81+efMYN9wL.jpg,81s9HTanzwL.jpg,81NDLmdOrXL.jpg,815W11WX3EL.jpg,91MaqqlkycL.jpg,81Isf4d6ohL.jpg,81UHp5L435L.jpg,71GRrvWnNJL.jpg",
      "manufacturer": "Global Brother",
      "asin": "B0DJQVYV99",
      "brand": "Claude Davis",
      "features": [],
      "description": "This natural home remedies book gives you a 250-remedy Apothecary in your own home, ready to help you whenever you are in need.\nThe book is written by Dr. Nicole Apelian, an expert herbalist with over 30 years of hands-on practice in healing with herbal remedies.\nThe first thing you’ll see when you open this natural medicine book is your new Apothecary—250 remedies, organized on shelves for specific ailments.\n\nWhat You’ll Discover Inside:\n288 color pages featuring all 250 powerful remedies for every part of your body. Easy-to-navigate appendix that visually shows all the natural remedies and the page where you’ll find them, along with step-by-step instructions, color photos, accurate measurements, and dosages. The Natural Brain-Booster: a potent recipe for focus, memory, and mental clarity (page 129). The same 3 Mushroom Tinctures Dr. Apelian used to get back on her feet and manage her MS symptoms (page 220). Grandma’s Hot Salve: the powerful back remedy that was almost lost to history (page 175). The Herbal Sleep Aid to take before bed (page 147). Discover the Best Natural Probiotic you can make at home (page 82). Find out what happens if you pour honey over cinnamon and all the other herbal recipes that were once a part of every home.\n\nWhether you’re an experienced plant medicine user or just looking for a natural approach to managing your health and healing with herbal remedies, The Forgotten Home Apothecary is for you.\nThis is the only holistic medicine book out there where you’ll find the time-tested natural remedies our grandparents relied on, back when apothecaries hadn’t yet been replaced by pharmacies.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Would You Rather Book For Kids - 300+ Hilarious, Silly, and Challenging Questions To Make You Laugh (Funny Jokes and Activities - Ages 7-13)",
      "imagesCSV": "61On4Ig-0DL.jpg,61ZYuVUdeHL.jpg",
      "manufacturer": "Independently published",
      "asin": "B09GXDQ122",
      "brand": "Independently Published",
      "features": [],
      "description": "***If You Want to Spend Quality Time with Your Kids in a Way That is Fun for Both of You, Then You Are in The Right Place***\nWe all know that spending time with our kids is important, but it's not always easy.\nWhether they are bored or just plain naughty, sometimes getting them to sit still and pay attention can be a real challenge.\nWouldn't it be great if you could get through the day without having to hear \"I'm Bored!\" one more time?\nThat's why we created Would You Rather Book for Kids – an engaging book of questions that will keep your kids entertained for hours!\nIf you're looking for a way to engage your kids in an activity that will keep them entertained, then this is the book for you.\nThis would you rather questions collection is sure to bring hours of laughter and fun-filled joy into any household.\nIt's guaranteed to provide hours of fun for the whole family, now spending time with your kids in a way that you both enjoy has never been easier.\nThis book is one of the best books you will find in bookstores that provides such fantastic and engaging activities.\nIt's not just a fantastic product but also an incredible experience you can have every day of your life.\nThere's no need to worry anymore - because now YOU are in control!\nIt doesn't matter if they are home alone after school. One sure thing is that they will never have another boring moment again, thanks to Would You Rather Book for Kids!\nThis unique blueprint will: Motivate your kids to develop reading skills Encourage good behavior through the 300+ hilarious and silly questions Challenge your kids intellectually with the stimulating questions Stop the battle of wills by having a fun way to keep your kids on track Provides tools to improve parent-child relations with family discussions Engages and interests kids in conversation, letting them tell their side of the story\nAnd much, much more!\nScroll up, Click on \"Buy Now with 1-Click\", and Grab a Copy of This Awesome Would You Rather Book for Kids Today!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Little Blue Truck's Springtime: An Easter And Springtime Book For Kids",
      "imagesCSV": "81uv7QtqJ0L.jpg",
      "manufacturer": "Clarion Books",
      "asin": "0544938097",
      "brand": "Clarion",
      "features": [],
      "description": "Celebrate the beauty of springtime with the #1 New York Times best-selling Little Blue Truck!\nBeep! Beep! Little Blue Truck is out for a ride with his good friend Toad. The sun is shining and the flowers are blooming—it's a beautiful spring day! Who will they see along the way?\nOpen the flaps to meet all of the sweet baby animals just born on the farm. Peep! Peep!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Biscuit's Pet & Play Easter: A Touch & Feel Book: An Easter And Springtime Book For Kids",
      "imagesCSV": "81GJOw+PrfL.jpg",
      "manufacturer": "HarperCollins",
      "asin": "0061128392",
      "brand": "HarperCollins",
      "features": [],
      "description": "Cozy up for Easter fun with Biscuit, everyone's favorite little yellow puppy!\nPet the fuzzy yellow chick and hunt for shiny Easter eggs as you join Biscuit in this Easter touch-and-feel adventure! The sturdy board book pages and simple text are just right for babies and toddlers.\nThis Easter touch-and-feel book is a sweet way to share the holiday spirit with little ones. Woof, woof!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Fearless (The Powerless Trilogy)",
      "imagesCSV": "91UN+1U66JL.jpg",
      "manufacturer": "Simon & Schuster Books for Young Readers",
      "asin": "1665955465",
      "brand": "N/A",
      "features": [],
      "description": "Paedyn and Kai are reunited but face a terrible decision in this thrilling conclusion to the New York Times bestselling romantasy trilogy perfect for fans of Sarah J. Maas and The Red Queen.\n\nPaedyn Gray and Kai Azer return to the Kingdom of Ilya…\n\nAnd Paedyn has a life-altering choice to make. Whatever she decides will determine her fate—and the fate of those around her—forever.\n\nIn the ultimate battle of love and loyalty, who wins?",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Bluey: Easter",
      "imagesCSV": "81QkbRlPEEL.jpg,41dcT0DuYzL.jpg,41WB3xrzE+L.jpg,41SXNENnRCL.jpg,41SAsy0jJrL.jpg,51nGwvVe8WL.jpg,51uT9KOCrIL.jpg",
      "manufacturer": "Penguin Young Readers Licenses",
      "asin": "0593658388",
      "brand": "Bluey",
      "features": [],
      "description": "Celebrate Easter with Bluey and Bingo in this fun storybook! Based on the wildly successful animated series Bluey, as seen on Disney+\n\nIt's Easter! Bluey and Bingo are worried that the Easter Bunny has forgotten them, until they find a clue that takes them on an egg hunt. Will Bluey and Bingo find their Easter eggs? Read along to find out!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
      "imagesCSV": "81ANaVZk5LL.jpg",
      "manufacturer": "Avery",
      "asin": "0735211299",
      "brand": "Random House Books for Young Readers",
      "features": [],
      "description": "The #1 New York Times bestseller. Over 20 million copies sold!\n\nTiny Changes, Remarkable Results\n\nNo matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\n\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.\n\nLearn how to:\n\nmake time for new habits (even when life gets crazy);\novercome a lack of motivation and willpower; design your environment to make success easier; get back on track when you fall off course; ...and much more.\n\nAtomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Interesting Facts For Curious Minds: 1572 Random But Mind-Blowing Facts About History, Science, Pop Culture And Everything In Between",
      "imagesCSV": "718SstStV3L.jpg,51subzYNImL.jpg",
      "manufacturer": "Red Panda Press",
      "asin": "B0B6XFT4RH",
      "brand": "N/A",
      "features": [],
      "description": "Want to impress your friends and family with both useful, worthless but undeniably interesting facts?\nThen Interesting Facts For Curious Minds: 1572 Random But Mind Blowing Facts About History, Science, Pop Culture and Everything in Between is the book for you!\nIn this book you’ll find the answers to questions such as: When did zero become a number? Who was the inventor of Bitcoin? What did the Big Bang sound like? How have sports changed around the world? What’s a malapropism?\nInteresting Facts For Curious Minds gives you the answer to all these and many, many more questions that I know have crossed your mind from time to time. This book is divided into 63 chapters by topic for your convenience, bringing you a nice mix of science, history, pop culture, and all sorts of stuff in between. Each chapter contains 25 concise yet engaging factoids that are sure to make you think and at times laugh.\nHow you read this book is entirely up to you. I’m sure most of you will read it cover to cover at some point, but when you’re with friends and family you can pick the chapters out that most appeal to all of you.\nHowever you read this book, I guarantee you’ll find it one of the best tools to pass some time, relax alone, or connect with others. So sit back, relax, and get ready to learn some truly interesting facts!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Let Them Theory: A Life-Changing Tool That Millions of People Can't Stop Talking About",
      "imagesCSV": "91ZVf3kNrcL.jpg",
      "manufacturer": "Hay House LLC",
      "asin": "1401971369",
      "brand": "Hay House",
      "features": [],
      "description": "#1 New York Times Bestseller\n#1 Sunday Times Bestseller\n#1 Amazon Bestseller\n#1 Audible Bestseller\n\nA Life-Changing Tool Millions of People Can’t Stop Talking About\n\nWhat if the key to happiness, success, and love was as simple as two words?\n\nIf you've ever felt stuck, overwhelmed, or frustrated with where you are, the problem isn't you. The problem is the power you give to other people. Two simple words—Let Them—will set you free. Free from the opinions, drama, and judgments of others. Free from the exhausting cycle of trying to manage everything and everyone around you. The Let Them Theory puts the power to create a life you love back in your hands—and this book will show you exactly how to do it.\n\nIn her latest groundbreaking book, The Let Them Theory, Mel Robbins—New York Times bestselling author and one of the world's most respected experts on motivation, confidence, and mindset—teaches you how to stop wasting energy on what you can't control and start focusing on what truly matters: YOU. Your happiness. Your goals. Your life.\n\nUsing the same no-nonsense, science-backed approach that's made The Mel Robbins Podcast a global sensation, Robbins explains why The Let Them Theory is already loved by millions and how you can apply it in eight key areas of your life to make the biggest impact. Within a few pages, you'll realize how much energy and time you've been wasting trying to control the wrong things—at work, in relationships, and in pursuing your goals—and how this is keeping you from the happiness and success you deserve.\n\nWritten as an easy-to-understand guide, Robbins shares relatable stories from her own life, highlights key takeaways, relevant research and introduces you to world-renowned experts in psychology, neuroscience, relationships, happiness, and ancient wisdom who champion The Let Them Theory every step of the way.\n\nLearn how to:\n\nStop wasting energy on things you can't control Stop comparing yourself to other people Break free from fear and self-doubt Release the grip of people's expectations Build the best friendships of your life Create the love you deserve Pursue what truly matters to you with confidence Build resilience against everyday stressors and distractions Define your own path to success, joy, and fulfillment . . . and so much more.\n\nThe Let Them Theory will forever change the way you think about relationships, control, and personal power. Whether you want to advance your career, motivate others to change, take creative risks, find deeper connections, build better habits, start a new chapter, or simply create more happiness in your life and relationships, this book gives you the mindset and tools to unlock your full potential.\n\nOrder your copy of The Let Them Theory now and discover how much power you truly have. It all begins with two simple words.\n\nThe cover has been updated to include the name of co-author Sawyer Robbins. Customers may receive either version of the cover at random.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Try Not to Laugh Challenge, Easter Joke Book for Kids: Easter Basket Stuffer for Boys, Girls, Teens & Adults, Fun Easter Activity Book with Cute ... Easter Activities for the Whole Family!",
      "imagesCSV": "41XZlhQ+5NL.jpg,51FImkBN5UL.jpg",
      "manufacturer": "CreateSpace Independent Publishing Platform",
      "asin": "1986554902",
      "brand": "N/A",
      "features": [],
      "description": "Great Easter Joke Book for all Ages! This Easter Joke Book has over 275 Eggs-tra Funny Jokes, Silly Riddles and Laugh out loud Knock-Knock Jokes along with Comical Art Work! The Easter Gift that will provide hours of Fun for Friends & Family! Perfect for all ages! Best Easter Basket Stuffer for all! The Rules are Simple: Pick your team, or go one on one. Sit across from each other & make eye contact. Take turns reading jokes to each other. You can make silly faces, funny sound effects, etc. When your opponent laughs, you get a point! First team to win 3 points, WINS! If You’re Laughing, You’re Losing!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Rainbow Fish",
      "imagesCSV": "81YNkSjQ+XL.jpg",
      "manufacturer": "NorthSouth Books",
      "asin": "1558585362",
      "brand": "Simon & Schuster",
      "features": [
        "Northsouth (ny)",
        "Language: english",
        "Book - the rainbow fish"
      ],
      "description": "For the youngest readers, the board book edition from the New York Times bestselling Rainbow Fish series.\n\nThe award-winning book about a beautiful fish who finds friendship and happiness when he learns to share.\n\nEye-catching foil stamping, glittering on every page, will delight every child, but it is the universal message at the heart of this simple story about a beautiful fish who learns to make friends by sharing his most prized possessions that gives this book its enduring value.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Be Smart Pay Zero Taxes: Use the Buy, Borrow, Die Strategy to Get Rich and Stay Rich",
      "imagesCSV": "7167BCcTWeL.jpg",
      "manufacturer": "Humanix Books",
      "asin": "163006310X",
      "brand": "N/A",
      "features": [],
      "description": "BUILD WEALTH. KEEP MORE. LIVE TAX-FREE.\nDiscover the strategies the ultra-wealthy use to grow their fortunes and legally avoid taxes — made simple for EVERYONE — with the ultimate guide to reducing your tax bill to zero. Learn the secrets the rich use to get rich, and STAY RICH, including:\nMaster the S.M.A.R.T. system: Strategies to Maximize Assets and Reduce Taxes. Build your “Perfect Portfolio”: It is LIFE-CHANGING! Leverage “The Five Pillars” of investing — stocks, real estate, life insurance, cryptocurrency, and precious metals — a bulletproof, tax-free financial plan. Implement the “Buy, Borrow, Die” strategy to grow and protect tax free wealth. Live off the “Borrow Button”: Unlock tax-free financial freedom by borrowing against your investments and never selling your assets. Learn how ANYONE can build $6 million in wealth, retire early, and live tax-free without relying on traditional retirement accounts. Turn modest earnings into millions, be financially independent, and LIVE RICH!\n\nNEWSMAX: “If you want to pay NO TAXES get: BE SMART PAY ZERO TAXES: Use the Buy, Borrow, Die Strategy to Get Rich and Stay Rich! It’s possible!”",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Next Conversation: Argue Less, Talk More",
      "imagesCSV": "71nr20MzkbL.jpg",
      "manufacturer": "Tarcher",
      "asin": "0593718720",
      "brand": "N/A",
      "features": [],
      "description": "THE INSTANT NEW YORK TIMES BESTSELLER\n\nFrom communication expert Jefferson Fisher, the definitive book on making your next conversation the one that changes everything\n\nNo matter who you’re talking to, The Next Conversation gives you immediately actionable strategies and phrases that will forever change how you communicate. Jefferson Fisher, trial lawyer and one of the leading voices on real-world communication, offers a tried-and-true framework that will show you how to transform your life and your relationships by improving your next conversation.\n\nFisher has gained millions of followers through short, simple, practical videos teaching people how to argue less and talk more. Whether it’s handling a heated conversation, dealing with a difficult personality, or standing your ground with confidence, his down-to-earth teachings have helped countless people navigate life’s toughest situations. Now for the first time, Fisher has distilled his three-part communication system (Say it with control, Say it with confidence, Say it to connect) that can easily be applied to any situation.\n\nYou will learn:\nWhy you should never “win” an argument How to assert yourself and communicate with intention How to set boundaries and frame conversations Why saying less is often more How to overcome conflict with connection\nThe Next Conversation will give you practical phrases that will lead to powerful results, from breaking down defensiveness in a hard talk with a family member to finding your own assertive voice at the boardroom conference table. Your every word matters, and by controlling how you communicate every day, you will create waves of positive impact that will resonate throughout your relationships to last a lifetime.\n\nEverything you want to say, and how you want to say it, can be found in The Next Conversation.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Abundance",
      "imagesCSV": "71dn+hvNIOL.jpg,41nEx1Py8QL.jpg",
      "manufacturer": "Avid Reader Press / Simon & Schuster",
      "asin": "1668023482",
      "brand": "N/A",
      "features": [],
      "description": "NEW YORK TIMES BESTSELLER\n\n“A terrific book...Powerful and persuasive.” —Fareed Zakaria\n\n“Spectacular…Offers a comprehensive indictment of the current problems and a clear path forward…Klein and Thompson usher in a mood shift. They inspire hope and enlarge the imagination.” —David Brooks, The New York Times\n\nFrom bestselling authors and journalistic titans Ezra Klein and Derek Thompson, Abundance is a once-in-a-generation, paradigm-shifting call to renew a politics of plenty, face up to the failures of liberal governance, and abandon the chosen scarcities that have deformed American life.\n\nTo trace the history of the twenty-first century so far is to trace a history of unaffordability and shortage. After years of refusing to build sufficient housing, America has a national housing crisis. After years of limiting immigration, we don’t have enough workers. Despite decades of being warned about the consequences of climate change, we haven’t built anything close to the clean-energy infrastructure we need. Ambitious public projects are finished late and over budget—if they are ever finished at all. The crisis that’s clicking into focus now has been building for decades—because we haven’t been building enough.\n\nAbundance explains that our problems today are not the results of yesteryear’s villains. Rather, one generation’s solutions have become the next generation’s problems. Rules and regulations designed to solve the problems of the 1970s often prevent urban-density and green-energy projects that would help solve the problems of the 2020s. Laws meant to ensure that government considers the consequences of its actions have made it too difficult for government to act consequentially. In the last few decades, our capacity to see problems has sharpened while our ability to solve them has diminished.\n\nProgress requires facing up to the institutions in life that are not working as they need to. It means, for liberals, recognizing when the government is failing. It means, for conservatives, recognizing when the government is needed. In a book exploring how we can move from a liberalism that not only protects and preserves but also builds, Klein and Thompson trace the political, economic, and cultural barriers to progress and propose a path toward a politics of abundance. At a time when movements of scarcity are gaining power in country after country, this is an answer that meets the challenges of the moment while grappling honestly with the fury so many rightfully feel.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Chicka Chicka Boom Boom (Board Book)",
      "imagesCSV": "51WABgZmdWL.jpg",
      "manufacturer": "Little Simon",
      "asin": "1442450703",
      "brand": "Simon & Schuster",
      "features": [],
      "description": "There is always enough room on your child’s bookshelf for this Classic Board Book edition of the rollicking alphabet chant that has been a children’s favorite for over thirty years!\n\nA told B,\nand B told C,\n“I’ll meet you at the\ntop of the coconut tree”\n\nIn this lively alphabet rhyme, all the letters of the alphabet race each other up the coconut tree. Will there be enough room? Oh, no—Chicka Chicka Boom! Boom!\n\nCountless children—and their parents—can joyfully recite the familiar words of this beloved alphabet chant. Bill Martin, Jr., and John Archambault’s rhythmic text keeps the beat with Caldecott Honor illustrator Lois Ehlert’s bold, cheerful art. This winning combination has made the Chicka Chicka series an enduring classic.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "How to Catch the Easter Bunny",
      "imagesCSV": "81q6ckUXE5L.jpg,411G8iibTPL.jpg,41kbjo8XHaL.jpg",
      "manufacturer": "Sourcebooks Wonderland",
      "asin": "149263817X",
      "brand": "DK",
      "features": [
        "111"
      ],
      "description": "The New York Times and USA Today Bestseller! The best Easter basket stuffer and fun spring picture book for kids!\nFinding eggs is easy, but can YOU catch the Easter Bunny in action this year? He has a basket full of treats and tricks for staying hidden―plus that bunny hippity hops with lightning speed! Start a new tradition with this bright and funny children's Easter book and get inspired to build STEAM traps of your own to pair with the readaloud! Educators, families, and children will love this wonderfully creative opportunity to have fun and celebrate the holiday together.\nI've been working long and hard\nwith all my peeps and crew.\nWe've made the eggs, and now I'm here\nto bring them all to you!\nLooking for easy Easter basket stuffers? Look no further than the complete How to Catch series!\nAlso in the How to Catch Series: How to Catch a Unicorn How to Catch an Elf How to Catch a Turkey How to Catch a Leprechaun How to Catch a Monster and more!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Easter Eggstravaganza Mad Libs: World's Greatest Word Game",
      "imagesCSV": "818PqOiT44L.jpg",
      "manufacturer": "Mad Libs",
      "asin": "0843172525",
      "brand": "Penguin",
      "features": [],
      "description": "Mad Libs is the world’s greatest word game and a great gift or activity for anyone who likes to laugh! Write in the missing words on each page to create your own hilariously funny stories all about Easter.\n\nIt's hopping good fun for the whole NOUN! With 21 \"fill-in-the-blank\" stories about chocolate, Easter baskets, and the magic of springtime, there's something for everyone. Play alone, in a group, or with some-bunny you love. Mad Libs are a fun family activity recommended for ages 8 to NUMBER.\n\nEaster Eggstravaganza Mad Libs includes:\n\n- Silly stories: 21 \"fill-in-the-blank\" stories all about Easter fun!\n- Language arts practice: Mad Libs are a great way to build reading comprehension and grammar skills.\n- Fun With Friends: each story is a chance for friends to work together to create unique stories!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Housemaid's Secret",
      "imagesCSV": "81LZXcfKqJL.jpg",
      "manufacturer": "Bookouture",
      "asin": "0349132615",
      "brand": "Mobius",
      "features": [],
      "description": "As he continues showing me their incredible penthouse apartment, I have a terrible feeling about the woman behind closed doors. But I can't risk losing this job - not if I want to keep my darkest secret safe . . . It's hard to find an employer who doesn't ask too many questions about my past. So I thank my lucky stars that the Garricks miraculously give me a job, cleaning their stunning penthouse with views across the city and preparing fancy meals in their shiny kitchen. I can work here for a while, stay quiet until I get what I want. It's almost perfect. But I still haven't met Mrs Garrick, or seen inside the guest bedroom. I'm sure I hear her crying. I notice spots of blood around the neck of her white nightgowns when I'm doing laundry. And one day I can't help but knock on the door. When it gently swings open, what I see inside changes everything.... That's when I make a promise. After all, I've done this before. I can protect Mrs. Garrick while keeping my own secrets locked up safe. Douglas Garrick has done wrong. He is going to pay. It's simply a question of how far I'm willing to go.... An unbelievably twisty read that will have you glued to the pages late into the night. Anyone who loves The Woman in the Window, The Wife Between Us and The Girl on the Train will be completely hooked!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Baby Touch and Feel: Bunny",
      "imagesCSV": "81ZlVuSrPDL.jpg,81XK4MRYMrL.jpg,81YsJHNQVTL.jpg,71imsPxN2EL.jpg,41vt41+SnjL.jpg,41wV1xaReiL.jpg",
      "manufacturer": "DK Children",
      "asin": "0756689872",
      "brand": "DK",
      "features": [],
      "description": "An interactive touch and feel book for babies with lovable, furry bunnies and read-aloud text! Tactile elements and delightful imagery will encourage the development of motor skills and early learning.\n\nBaby Touch and Feel: Bunny is an interactive and fun way to help your child learn not only words but shapes and textures too. Bold, bright pictures and colorful animal-inspired illustrations will be more than enough to keep your baby’s attention. This adorable picture book is a perfect first book for toddlers and makes for an ideal baby gift.\n\nMeet cute bunnies and read all about their long ears and furry tails! Not too big and not too small, this sturdy, padded sensory book is just the right size for little hands to hold. No need for Mom and Dad to turn the pages! Babies and toddlers can turn the tough board book pages themselves, which helps to develop their fine motor skills while building an early language foundation.\n\nThis charming board book for babies includes:\n\n- An amazing range of different textures to explore.\n- Cleary labeled pictures and a simple, easy to follow design.\n- Easy to read text to encourage early vocabulary building.\n- A texture or eye-catching area on every page.\n- Rounded edges and chunky pages, protecting babies and their growing teeth.\n\nLearning to read should always be this fun. Kids will get hours of play from this sturdy board book for babies and toddlers, from making the noises and reading the names to feeling the different textures, like the soft fur of a golden bunny. This touchy-feely book, with its strong, baby-safe cover, makes for an ideal baby gift. Packed full of shiny objects and some bumps and grooves, this educational book will engage small children and stimulate early childhood development in different ways.\n\nComplete the Series\n\nThis delightful book is part of the Baby Touch and Feel range of board books for babies and toddlers from DK Books and includes titles like Baby Touch and Feel I Love You, Baby Touch and Feel Bedtime, Baby Touch and Feel Colors and Shapes, and more for your little one to enjoy!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Don't Push the Button! An Easter Surprise: (Easter Board Book, Interactive Books For Toddlers, Childrens Easter Books Ages 1-3)",
      "imagesCSV": "81DdjyAKpiL.jpg,31h0RD7hEDL.jpg,317P8L40+NL.jpg,41wtD34vFKL.jpg,41BJP8-W05L.jpg,41IvQHcoM-L.jpg,31v2DmP+OuL.jpg,418JI9QqF5L.jpg",
      "manufacturer": "Sourcebooks Jabberwocky",
      "asin": "1492680117",
      "brand": "Sourcebooks Jabberwocky",
      "features": [],
      "description": "The perfect Easter basket stuffer! Go on a festive and fun-filled adventure with Larry the monster in this interactive Easter edition of the USA Today bestselling series, Don't Push the Button!\nLarry is SO excited for Easter! Aren't you?\nI don't think the Easter Bunny is watching; but…\nWhatever you do…DON'T PUSH THE BUTTON!\nWhen it comes to Easter basket gifts for babies and toddlers, this adorable, interactive book is a MUST!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Would You Rather Book For Kids - 300+ Hilarious, Silly, and Challenging Questions To Make You Laugh (Funny Jokes and Activities - Ages 7-13)",
      "imagesCSV": "61On4Ig-0DL.jpg,61ZYuVUdeHL.jpg",
      "manufacturer": "Independently published",
      "asin": "B09GXDQ122",
      "brand": "Independently Published",
      "features": [],
      "description": "***If You Want to Spend Quality Time with Your Kids in a Way That is Fun for Both of You, Then You Are in The Right Place***\nWe all know that spending time with our kids is important, but it's not always easy.\nWhether they are bored or just plain naughty, sometimes getting them to sit still and pay attention can be a real challenge.\nWouldn't it be great if you could get through the day without having to hear \"I'm Bored!\" one more time?\nThat's why we created Would You Rather Book for Kids – an engaging book of questions that will keep your kids entertained for hours!\nIf you're looking for a way to engage your kids in an activity that will keep them entertained, then this is the book for you.\nThis would you rather questions collection is sure to bring hours of laughter and fun-filled joy into any household.\nIt's guaranteed to provide hours of fun for the whole family, now spending time with your kids in a way that you both enjoy has never been easier.\nThis book is one of the best books you will find in bookstores that provides such fantastic and engaging activities.\nIt's not just a fantastic product but also an incredible experience you can have every day of your life.\nThere's no need to worry anymore - because now YOU are in control!\nIt doesn't matter if they are home alone after school. One sure thing is that they will never have another boring moment again, thanks to Would You Rather Book for Kids!\nThis unique blueprint will: Motivate your kids to develop reading skills Encourage good behavior through the 300+ hilarious and silly questions Challenge your kids intellectually with the stimulating questions Stop the battle of wills by having a fun way to keep your kids on track Provides tools to improve parent-child relations with family discussions Engages and interests kids in conversation, letting them tell their side of the story\nAnd much, much more!\nScroll up, Click on \"Buy Now with 1-Click\", and Grab a Copy of This Awesome Would You Rather Book for Kids Today!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Forgotten Home Apothecary : 250 Powerful Remedies at Your Fingertips",
      "imagesCSV": "81+efMYN9wL.jpg,81s9HTanzwL.jpg,81NDLmdOrXL.jpg,815W11WX3EL.jpg,91MaqqlkycL.jpg,81Isf4d6ohL.jpg,81UHp5L435L.jpg,71GRrvWnNJL.jpg",
      "manufacturer": "Global Brother",
      "asin": "B0DJQVYV99",
      "brand": "Claude Davis",
      "features": [],
      "description": "This natural home remedies book gives you a 250-remedy Apothecary in your own home, ready to help you whenever you are in need.\nThe book is written by Dr. Nicole Apelian, an expert herbalist with over 30 years of hands-on practice in healing with herbal remedies.\nThe first thing you’ll see when you open this natural medicine book is your new Apothecary—250 remedies, organized on shelves for specific ailments.\n\nWhat You’ll Discover Inside:\n288 color pages featuring all 250 powerful remedies for every part of your body. Easy-to-navigate appendix that visually shows all the natural remedies and the page where you’ll find them, along with step-by-step instructions, color photos, accurate measurements, and dosages. The Natural Brain-Booster: a potent recipe for focus, memory, and mental clarity (page 129). The same 3 Mushroom Tinctures Dr. Apelian used to get back on her feet and manage her MS symptoms (page 220). Grandma’s Hot Salve: the powerful back remedy that was almost lost to history (page 175). The Herbal Sleep Aid to take before bed (page 147). Discover the Best Natural Probiotic you can make at home (page 82). Find out what happens if you pour honey over cinnamon and all the other herbal recipes that were once a part of every home.\n\nWhether you’re an experienced plant medicine user or just looking for a natural approach to managing your health and healing with herbal remedies, The Forgotten Home Apothecary is for you.\nThis is the only holistic medicine book out there where you’ll find the time-tested natural remedies our grandparents relied on, back when apothecaries hadn’t yet been replaced by pharmacies.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Biscuit's Pet & Play Easter: A Touch & Feel Book: An Easter And Springtime Book For Kids",
      "imagesCSV": "81GJOw+PrfL.jpg",
      "manufacturer": "HarperCollins",
      "asin": "0061128392",
      "brand": "HarperCollins",
      "features": [],
      "description": "Cozy up for Easter fun with Biscuit, everyone's favorite little yellow puppy!\nPet the fuzzy yellow chick and hunt for shiny Easter eggs as you join Biscuit in this Easter touch-and-feel adventure! The sturdy board book pages and simple text are just right for babies and toddlers.\nThis Easter touch-and-feel book is a sweet way to share the holiday spirit with little ones. Woof, woof!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Strangers in Time: A World War II Novel",
      "imagesCSV": "816QI0pfuRL.jpg",
      "manufacturer": "Grand Central Publishing",
      "asin": "1538742055",
      "brand": "Grand Central Publishing",
      "features": [],
      "description": "From the #1 New York Times bestselling author of A Calamity of Souls comes David Baldacci’s newest novel, set in London in 1944, about a bereaved bookshop owner and two teenagers scarred by the Second World War, and the healing and hope they find in one another.\nFourteen-year-old Charlie Matters is up to no good, but for a very good reason. Without parents, peerage, or merit, he steals what he needs, living day-to-day until he’s old enough to enlist to fight the Germans. After barely surviving the Blitz, Charlie knows there’s no telling when a falling bomb might end his life.\nFifteen-year-old Molly Wakefield has just returned to a nearly unrecognizable London. One of millions of children to have been evacuated to the countryside Molly has been away from her home for nearly five years. Her return, however, is not the homecoming she’d hoped for as she’s confronted by a devastating reality: neither of her parents are there.\nWithout guardians and stability, Charlie and Molly find an unexpected ally and protector in Ignatius Oliver, and solace at his bookshop, The Book Keep. Mourning the recent loss of his wife, Ignatius forms a kinship with both children, and in each other they rediscover the spirit of family each has lost.\nBut Charlie’s escapades in the city have not gone unnoticed, and someone’s been following Molly since she returned to London. And Ignatius is harboring his own secrets, which could have terrible consequences for all of them.\n\nAs bombs continue to bear down on the city, Charlie, Molly, and Ignatius learn that while the perils of war rage on, their coming together and trusting one another may be the only way for them to survive.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Perfect Divorce",
      "imagesCSV": "813dTocDnuL.jpg",
      "manufacturer": "Blackstone Publishing, Inc.",
      "asin": "B0DGY5F5JX",
      "brand": "Blackstone Publishing",
      "features": [],
      "description": "From the author of the multimillion-copy bestselling thriller The Perfect Marriage\nTill death do us part. Yours. Not Mine.\nIt's been eleven years since high-powered attorney Sarah Morgan defended her husband, Adam, against the charge of murdering his mistress. Sarah has long since moved on, starting a family with her new husband, Bob Miller, and changing careers. Her life is back to being exactly how she always wanted ... or is it?\nAfter discovering Bob engaged in a one-night stand, Sarah wastes no time filing for divorce. However, amid their ugly separation, new DNA evidence is uncovered in the case against Adam, forcing the police to reopen the investigation and putting Sarah right back in the spotlight. Everyone wants to know what really happened, most of all former Deputy Hudson, who is hell-bent on finding the truth.\nBut when the woman Bob slept with is reported missing, he and Sarah start to fight dirty, and a high-stakes game of cat and mouse ensues. Filled with page-turning suspense and Jeneva Rose's signature twists and turns, this book will have readers wondering: Can Bob and Sarah achieve the perfect divorce? Or will it be \"'til death do us part\"?",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Little Blue Truck's Springtime: An Easter And Springtime Book For Kids",
      "imagesCSV": "81uv7QtqJ0L.jpg",
      "manufacturer": "Clarion Books",
      "asin": "0544938097",
      "brand": "Clarion",
      "features": [],
      "description": "Celebrate the beauty of springtime with the #1 New York Times best-selling Little Blue Truck!\nBeep! Beep! Little Blue Truck is out for a ride with his good friend Toad. The sun is shining and the flowers are blooming—it's a beautiful spring day! Who will they see along the way?\nOpen the flaps to meet all of the sweet baby animals just born on the farm. Peep! Peep!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Fearless (The Powerless Trilogy)",
      "imagesCSV": "91UN+1U66JL.jpg",
      "manufacturer": "Simon & Schuster Books for Young Readers",
      "asin": "1665955465",
      "brand": "N/A",
      "features": [],
      "description": "Paedyn and Kai are reunited but face a terrible decision in this thrilling conclusion to the New York Times bestselling romantasy trilogy perfect for fans of Sarah J. Maas and The Red Queen.\n\nPaedyn Gray and Kai Azer return to the Kingdom of Ilya…\n\nAnd Paedyn has a life-altering choice to make. Whatever she decides will determine her fate—and the fate of those around her—forever.\n\nIn the ultimate battle of love and loyalty, who wins?",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Bluey: Easter",
      "imagesCSV": "81QkbRlPEEL.jpg,41dcT0DuYzL.jpg,41WB3xrzE+L.jpg,41SXNENnRCL.jpg,41SAsy0jJrL.jpg,51nGwvVe8WL.jpg,51uT9KOCrIL.jpg",
      "manufacturer": "Penguin Young Readers Licenses",
      "asin": "0593658388",
      "brand": "Bluey",
      "features": [],
      "description": "Celebrate Easter with Bluey and Bingo in this fun storybook! Based on the wildly successful animated series Bluey, as seen on Disney+\n\nIt's Easter! Bluey and Bingo are worried that the Easter Bunny has forgotten them, until they find a clue that takes them on an egg hunt. Will Bluey and Bingo find their Easter eggs? Read along to find out!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Berenstain Bears and the Easter Story: An Easter And Springtime Book For Kids (Berenstain Bears/Living Lights: A Faith Story)",
      "imagesCSV": "911c6G-ZTrL.jpg,91wc+TIzf8L.jpg,91itWq9KdYL.jpg,51hAg9xkKFL.jpg,51Gi0cLL9dL.jpg",
      "manufacturer": "Zonderkidz",
      "asin": "0310720877",
      "brand": "Zonderkidz",
      "features": [],
      "description": "Young readers will understand the real meaning behind Easter in this addition to the Living Lights™ series of Berenstain Bears books. Children will discover that Easter is more than candy and egg hunts as they read about the Bear cubs at Sunday school learning about Jesus’ resurrection and salvation.\nJoin the Berenstain Bears as they explore the true meaning of Easter Sunday and the resurrection of Jesus. Children will discover ways to implement traditional religious values and share God’s goodness in Zonderkidz The Berenstain Bears Living Lights™ series of books with over 13 million copies sold.\nThe Berenstain Bears and the Easter Story: Encourages age appropriate discussions about salvation and Jesus’ resurrection Is an engaging story about how Easter is more than the Easter bunny, candy, and egg rolls, and is a season of faith Perfect for early reader ages 4-8, reading out loud at home, in a classroom, or Sunday school Perfect for independent reading, Easter basket gift, and holiday?gift-giving\n\nThe Berenstain Bears Living Lights™ series: Is written and illustrated by Mike Berenstain Features the hand-drawn artwork of the Berenstain family Continues in the much-loved footsteps of Stan and Jan Berenstain with the Berenstain Bears series of books Is part of one of the bestselling children’s book series ever created, with more than 250 books published and nearly 300 million copies sold to date\n\nLook for additional inspirational children’s picture books in The Berenstain Bears Living Lights™ series, including: The Berenstain Bears and the Easter Story for Little Ones The Berenstain Bears The Very First Easter The Berenstain Bears' Easter Sunday",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Interesting Facts For Curious Minds: 1572 Random But Mind-Blowing Facts About History, Science, Pop Culture And Everything In Between",
      "imagesCSV": "718SstStV3L.jpg,51subzYNImL.jpg",
      "manufacturer": "Red Panda Press",
      "asin": "B0B6XFT4RH",
      "brand": "N/A",
      "features": [],
      "description": "Want to impress your friends and family with both useful, worthless but undeniably interesting facts?\nThen Interesting Facts For Curious Minds: 1572 Random But Mind Blowing Facts About History, Science, Pop Culture and Everything in Between is the book for you!\nIn this book you’ll find the answers to questions such as: When did zero become a number? Who was the inventor of Bitcoin? What did the Big Bang sound like? How have sports changed around the world? What’s a malapropism?\nInteresting Facts For Curious Minds gives you the answer to all these and many, many more questions that I know have crossed your mind from time to time. This book is divided into 63 chapters by topic for your convenience, bringing you a nice mix of science, history, pop culture, and all sorts of stuff in between. Each chapter contains 25 concise yet engaging factoids that are sure to make you think and at times laugh.\nHow you read this book is entirely up to you. I’m sure most of you will read it cover to cover at some point, but when you’re with friends and family you can pick the chapters out that most appeal to all of you.\nHowever you read this book, I guarantee you’ll find it one of the best tools to pass some time, relax alone, or connect with others. So sit back, relax, and get ready to learn some truly interesting facts!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
      "imagesCSV": "81ANaVZk5LL.jpg",
      "manufacturer": "Avery",
      "asin": "0735211299",
      "brand": "Random House Books for Young Readers",
      "features": [],
      "description": "The #1 New York Times bestseller. Over 20 million copies sold!\n\nTiny Changes, Remarkable Results\n\nNo matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.\n\nIf you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights.\n\nClear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field.\n\nLearn how to:\n\nmake time for new habits (even when life gets crazy);\novercome a lack of motivation and willpower; design your environment to make success easier; get back on track when you fall off course; ...and much more.\n\nAtomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Good Egg Presents: The Great Eggscape!: Over 150 Stickers Inside: An Easter And Springtime Book For Kids (The Food Group)",
      "imagesCSV": "81Ew9W9jQVL.jpg",
      "manufacturer": "HarperCollins",
      "asin": "0062975676",
      "brand": "HarperCollins",
      "features": [
        "The Bad Seed",
        "The Good Egg",
        "The Cool Bean",
        "The Couch Potato",
        "The Good Egg Presents: The Great Eggscape!",
        "The Bad Seed Presents: The Good, the Bad, the Spooky!",
        "The Cool Bean Presents: As Cool as It Gets",
        "That’s What Dinosaurs Do"
      ],
      "description": "A New York Times Bestseller!\nBased on the #1 New York Times bestselling picture book sensation The Good Egg, Jory John and Pete Oswald present: The Great Eggscape! Includes two sticker sheets, perfect for decorating your own eggs.\nThe Great Eggscape is when the Good Egg and his pals escape their carton and drop into the store for a morning of fun, enjoyed by everybody.\nWell, almost everybody.\nShel (an egg) isn’t a huge fan of group activities, especially when he’s made to be “It” for a game of hide-and-seek. Nevertheless, Shel doesn’t want to let his friends down, so he reluctantly plays. But after a morning of hiding and seeking, somebody’s still missing. Will the dozen eggs friends ever be reunited?\nFind out in this hilarious egg hunt adventure that reminds us to break out of our shells and help our friends in need! A funny book to share anytime, and the two sticker sheets make it especially egg-cellent for Easter.\nCheck out Jory John and Pete Oswald’s funny, bestselling books for kids 4-8 and anyone who wants a laugh: The Bad Seed The Good Egg The Cool Bean The Couch Potato The Good Egg Presents: The Great Eggscape! The Bad Seed Presents: The Good, the Bad, the Spooky! The Cool Bean Presents: As Cool as It Gets That’s What Dinosaurs Do",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Cozy Friends: Coloring Book for Adults and Teens Featuring Super Cute Animal Characters with Easy and Simple Designs for Relaxation",
      "imagesCSV": "51XqmEHheYL.jpg,61+uAqpwNxL.jpg,51RY0fhopjL.jpg,51qeCbouFJL.jpg,519wFVMnBAL.jpg,51YBjLFUOML.jpg,51W+Dm7CdiL.jpg,51CLldspyKL.jpg,51maCFd6Z6L.jpg",
      "manufacturer": "Independently published",
      "asin": "B0D4YLQRMP",
      "brand": "QUIQEI",
      "features": [],
      "description": "This book is filled with familiar everyday activities of super cute animal characters. You'll discover many interesting hidden stories. Things like doing laundry, cooking, and cleaning have never been this fun! And it's even better when you do them with Cozy Friends.\nGet comfy and grab your colors to create some awesome and fun pictures.\nThis 'Cozy Friends Coloring Book' includes: 40 hand-drawn pages ready for coloring. Super cute coloring pages for stress relief and relaxation. Single-sided pages to prevent bleed-through (if using markers, remember to place a protective sheet behind the page you're coloring) A convenient size of 8.5 x 8.5 inches for easy handling. High-resolution prints for clear, crisp images.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "It's Not Easy Being a Bunny: An Early Reader Book for Kids (Beginner Books)",
      "imagesCSV": "71ihGxMQEBL.jpg",
      "manufacturer": "Random House Books for Young Readers",
      "asin": "0394861027",
      "brand": "Random House Books for Young Readers",
      "features": [],
      "description": "NATIONAL BESTSELLER • P.J. Funnybunny doesn't want to be a bunny anymore! In this hilarious Beginner Book, a young bunny explores life with different animal friends. And don’t miss the charming follow-up, It’s Better Being a Bunny, available now! This is a perfect gift for Easter or celebrating bunnies all year round.\n\nP.J. Funnybunny is tired of cooked carrots and his big ears. It would be way more fun to be a bear, a bird, or a pig...right? Read along as P.J. leaves home and tries to determine who he is—and where he belongs. But this bunny might just learn that all he wants to be is...himself!\n\nBeginner Books are fun, funny, and easy to read! Launched by Dr. Seuss in 1957 with the publication of The Cat in the Hat, this beloved early reader series motivates children to read on their own by using simple words with illustrations that give clues to their meaning. Featuring a combination of kid appeal, supportive vocabulary, and bright, cheerful art, Beginner Books will encourage a love of reading in children.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Housemaid",
      "imagesCSV": "81AHTyq2wVL.jpg",
      "manufacturer": "Grand Central Publishing",
      "asin": "1538742578",
      "brand": "Grand Central Publishing",
      "features": [],
      "description": "Over 2 Million Copies Sold and Soon to Be a Major Motion Picture Starring Sydney Sweeney and Amanda Seyfried!\n\nDon't miss the #1 New York Times and USA Today bestseller and addictive psychological thriller with a jaw-dropping twist that’s burning up Instagram and TikTok--Freida McFadden’s The Housemaid is perfect for fans of Ruth Ware, Lisa Jewell, and Verity.\n\nEvery day I clean the Winchesters’ beautiful house top to bottom. I collect their daughter from school. And I cook a delicious meal for the whole family before heading up to eat alone in my tiny room on the top floor.\n\nI try to ignore how Nina makes a mess just to watch me clean it up. How she tells strange lies about her own daughter. And how her husband Andrew seems more broken every day. But as I look into Andrew’s handsome brown eyes, so full of pain, it’s hard not to imagine what it would be like to live Nina’s life. The walk-in closet, the fancy car, the perfect husband.\n\nI only try on one of Nina’s pristine white dresses once. Just to see what it’s like. But she soon finds out… and by the time I realize my attic bedroom door only locks from the outside, it’s far too late.\n\nBut I reassure myself: the Winchesters don’t know who I really am.\n\nThey don’t know what I’m capable of…",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Action Bible: God's Redemptive Story",
      "imagesCSV": "81ydk0sI7HL.jpg,51jqrRtedzL.jpg,51Qmj0jASDL.jpg,51OxbywIPgL.jpg,51Wt7fGmIML.jpg,51PDNW1GiCL.jpg,51uSmSaQT5L.jpg",
      "manufacturer": "David C Cook",
      "asin": "083077744X",
      "brand": "David C Cook",
      "features": [],
      "description": "USA TODAY BESTSELLER - The Action Bible, the all-time bestselling illustrated Bible with over 3 million copies sold, featuring 230 illustrated stories that makes it easy and fun to understand the stories of the Bible.\n\nFeatures include:\nEasy-to-read stories in comic book form Vivid illustrations for each story Bible stories are in chronological order, from Genesis to Revelation Call out boxes add additional information and context Bible Book Index\nEvery page sparks excitement to explore God’s Word and know Him personally. Witness God’s active presence in the world through stories from the life of Jesus and great heroes of the faith. These stories will inspire you to know more about God’s Word and grow your faith in Christ.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Happy Easter, Little Pookie",
      "imagesCSV": "61z0twa6u4L.jpg,5146W37aQpL.jpg,41Syi3Dht2L.jpg,41j4bfScaNL.jpg,41grbPFU1NL.jpg,41oS9a1TjDL.jpg,41SMXFWKWsL.jpg",
      "manufacturer": "Boynton Bookworks",
      "asin": "1665928387",
      "brand": "Readerlink",
      "features": [],
      "description": "Pookie gets ready for Easter in this adorable board book from the bestselling and beloved Sandra Boynton.\n\nIt’s Easter! Join Mom and her little Pookie as they prepare for the sweetest of holidays. Pookie’s mom arranges an Easter play date with their friend, Bean, where they hop around like bunnies and decorate eggs. At the end of the day, Pookie dreams of the Easter Bunny and, of course, chocolate!\n\nWe have egg paints! And crayons!\nAnd stickers galore!\nYou can decorate eggs\ntill there aren’t any more.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Big Book of Silly Jokes for Kids",
      "imagesCSV": "81AgoOPzO6L.jpg,51rdc1IGH0L.jpg,51rRvm3psYL.jpg,5157GPH+c8L.jpg,41dpDBsw9lL.jpg,41wn-BcUXpL.jpg,41rkT+oePTL.jpg",
      "manufacturer": "Callisto Kids",
      "asin": "1641526378",
      "brand": "Rockridge Press",
      "features": [],
      "description": "Why do fish live in salt water? Because pepper makes them sneeze! Discover more than 800 silly jokes for kids in this hilarious kids joke book\nReading jokes can tickle your funny bone AND help boost reading skills. The Big Book of Silly Jokes for Kids is chock-full of knock-knock jokes, riddles, tongue twisters, and puns you can share with your friends and family for hours and hours of laughing!\nFunny facts and illustrations―Find some very silly illustrations that match the jokes, and fun trivia about the joke topics―did you know that elephants can't jump?\nBeginner joke-writing tips―This joke book for kids explains how setups and punchlines works and includes tips and exercises to help you write your own jokes.\nTake jokes anywhere―Bring this book on road trips, plane trips, and more so you can have fun everywhere you go.\nGive the gift of laughter―Whether it's a birthday gift, an Easter basket stuffer, or a present for any occasion, this book makes an educational and hilarious gift for every kid who loves to laugh!\nThe perfect joke book for kids of all ages, The Big Book of Silly Jokes for Kids promises to keep the young readers entertained and amused.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Difficult Riddles For Smart Kids: 300 Difficult Riddles And Brain Teasers Families Will Love (Thinking Books for Kids)",
      "imagesCSV": "71PGXt2n9uL.jpg,5175cNj9ygL.jpg",
      "manufacturer": "CreateSpace Independent Publishing Platform",
      "asin": "1546595902",
      "brand": "CREATESPACE",
      "features": [],
      "description": "Brain Teasers for Kids - Riddles for the Whole Family\n“The mind once stretched by a new idea, never returns to its original dimensions.” Ralph Waldo Emerson\nThis kids book is a collection of 300 brain teasing riddles and puzzles. Their purpose is to encourage children to think and stretch their minds. They are designed to test logic, lateral thinking as well as memory and to engage the brain in seeing patterns and connections between different things and circumstances.\nThey are laid out in three chapters which get more difficult as you go through the book, in the author’s opinion at least. The answers are at the back of the book if all else fails.\nThese are more difficult riddles for kids and are designed to be attempted by children from 10 years onwards, as well as participation from the rest of the family.\nIt is a perfect activity book for kids who like problem solving. These activities can be shared with the whole family.\n\nThis book is one of a series of puzzle books for kids. The aim of all of them is to stretch children’s brains through kids riddles and puzzles. They are kids books designed to challenge children to think laterally and more creatively.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "My First Learn-to-Write Workbook: Practice for Kids with Pen Control, Line Tracing, Letters, and More!",
      "imagesCSV": "71c+ReofeoL.jpg,51QOcUOUUOL.jpg,416CsJll11L.jpg,41PWak0zqhL.jpg,41fHLfa6iHL.jpg,41UskJ-l8-L.jpg,41wzez75TbL.jpg,41jhihgZn6L.jpg,41-KVmL9LRL.jpg",
      "manufacturer": "Callisto Kids",
      "asin": "1641526270",
      "brand": "Rockridge Press",
      "features": [],
      "description": "THE USA TODAY BESTSELLER!\nHelp your little one build communication skills with the ultimate writing workbook for kids ages 3 to 5. More than 2 million copies sold!\nSet kids up to succeed in school with a learn to write for kids guide that offers letter, shape, and number practice for kindergarten―and beyond. My First Learn-to-Write Workbook introduces early writers to proper pen control, line tracing, and more with dozens of handwriting exercises that engage their minds and boost their reading and writing comprehension.\nGet the best in learning books for 3+ year olds with:\nComprehensive skill building―As they explore these preschool and kindergarten learning activities, kids will build a strong foundation of reading comprehension, the alphabet, penmanship, and fine motor skills.\n75+ practice pages―Tons of engaging pencil-on-paper activities like connect-the-dots and fill-in-the-blanks offer enough repetition for real learning but enough variety to keep kids interested.\nColorful fun―This bestselling workbook is full of helpful (and slightly silly) pictures and illustrations that will spark kids' imaginations and get them excited to keep practicing.\nGet your child on the path to success with toddler learning activities that help them develop essential skills!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Broken Country (Reese's Book Club)",
      "imagesCSV": "81565rjI6fL.jpg",
      "manufacturer": "Simon & Schuster",
      "asin": "166807818X",
      "brand": "N/A",
      "features": [],
      "description": "A REESE’S BOOK CLUB PICK | A NEW YORK TIMES BESTSELLER\n\n“Broken Country by Clare Leslie Hall is an unforgettable story of love, loss, and the choices that shape our lives…but it’s also a masterfully crafted mystery that will keep you guessing until the very last page. Seriously, that ending?! I did not see it coming.” —Reese Witherspoon\n\n“Stirring and mysterious…fires directly at the human heart and hits the mark.” —Delia Owens, New York Times bestselling author of Where the Crawdads Sing\n\nA love triangle unearths dangerous, deadly secrets from the past in this thrilling tale perfect for fans of The Paper Palace and Where the Crawdads Sing.\n\n“The farmer is dead. He is dead, and all anyone wants to know is who killed him.”\n\nBeth and her gentle, kind husband Frank are happily married, but their relationship relies on the past staying buried. But when Beth’s brother-in-law shoots a dog going after their sheep, Beth doesn’t realize that the gunshot will alter the course of their lives. For the dog belonged to none other than Gabriel Wolfe, the man Beth loved as a teenager—the man who broke her heart years ago. Gabriel has returned to the village with his young son Leo, a boy who reminds Beth very much of her own son, who died in a tragic accident.\n\nAs Beth is pulled back into Gabriel’s life, tensions around the village rise and dangerous secrets and jealousies from the past resurface, this time with deadly consequences. Beth is forced to make a choice between the woman she once was, and the woman she has become.\n\nA sweeping love story with the pace and twists of a thriller, Broken Country is a novel of simmering passion, impossible choices, and explosive consequences that toggles between the past and present to explore the far-reaching legacy of first love.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The New Menopause: Navigating Your Path Through Hormonal Change with Purpose, Power, and Facts",
      "imagesCSV": "717+yh0POUL.jpg",
      "manufacturer": "Rodale Books",
      "asin": "059379625X",
      "brand": "N/A",
      "features": [],
      "description": "#1 NEW YORK TIMES BESTSELLER • Filling a gaping hole in menopause care, everything a woman needs to know to thrive during her hormonal transition and beyond, as well as the tools to help her take charge of her health at this pivotal life stage—by the bestselling author of The Galveston Diet.\n\nA NEW YORK POST BEST BOOK OF THE YEAR\n\nMenopause is inevitable, but suffering through it is not! This is the empowering approach to self-advocacy that pioneering women’s health advocate Dr. Mary Claire Haver takes for women in the midst of hormonal change in The New Menopause. A comprehensive, authoritative book of science-backed information and lived experience, it covers every woman's needs:\n\n• From changes in your appearance and sleep patterns to neurological, musculoskeletal, psychological, and sexual issues, a comprehensive A to Z toolkit of science-backed options for coping with symptoms.\n• What to do to mediate the risks associated with your body's natural drop in estrogen production, including for diabetes, dementia, Alzheimer’s, osteoporosis, cardiovascular disease, and weight gain.\n• How to advocate and prepare for annual midlife wellness visits, including questions for your doctor and how to insist on whole life care.\n• The very latest research on the benefits and side effects of hormone replacement therapy.\n\nArming women with the power to secure vibrant health and well-being for the rest of their lives, The New Menopause is sure to become the bible of midlife wellness for present and future generations.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Frozen River: A GMA Book Club Pick: A Novel",
      "imagesCSV": "91ulu+khYLL.jpg",
      "manufacturer": "Vintage",
      "asin": "0593312074",
      "brand": "N/A",
      "features": [],
      "description": "NEW YORK TIMES BESTSELLER • GMA BOOK CLUB PICK • AN NPR BOOK OF THE YEAR • From the New York Times bestselling author of I Was Anastasia and Code Name Hélène comes a gripping historical mystery inspired by the life and diary of Martha Ballard, a renowned 18th-century midwife who defied the legal system and wrote herself into American history.\n\n\"Fans of Outlander’s Claire Fraser will enjoy Lawhon’s Martha, who is brave and outspoken when it comes to protecting the innocent. . . impressive.\"—The Washington Post\n\n\"Once again, Lawhon works storytelling magic with a real-life heroine.\" —People Magazine\n\nMaine, 1789: When the Kennebec River freezes, entombing a man in the ice, Martha Ballard is summoned to examine the body and determine cause of death. As a midwife and healer, she is privy to much of what goes on behind closed doors in Hallowell. Her diary is a record of every birth and death, crime and debacle that unfolds in the close-knit community. Months earlier, Martha documented the details of an alleged rape committed by two of the town’s most respected gentlemen—one of whom has now been found dead in the ice. But when a local physician undermines her conclusion, declaring the death to be an accident, Martha is forced to investigate the shocking murder on her own.\n\nOver the course of one winter, as the trial nears, and whispers and prejudices mount, Martha doggedly pursues the truth. Her diary soon lands at the center of the scandal, implicating those she loves, and compelling Martha to decide where her own loyalties lie.\n\nClever, layered, and subversive, Ariel Lawhon’s newest offering introduces an unsung heroine who refused to accept anything less than justice at a time when women were considered best seen and not heard. The Frozen River is a thrilling, tense, and tender story about a remarkable woman who left an unparalleled legacy yet remains nearly forgotten to this day.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Next Day: Transitions, Change, and Moving Forward",
      "imagesCSV": "61mKR7hMwWL.jpg",
      "manufacturer": "Flatiron Books",
      "asin": "1250378656",
      "brand": "N/A",
      "features": [],
      "description": "In a rare window into some of her life’s pivotal moments, Melinda French Gates draws from previously untold stories to offer a new perspective on encountering transitions.\n\n“You don’t get to be my age without navigating all kinds of transitions. Some you embraced and some you never expected. Some you hoped for and some you fought as hard as you could.”\n– Melinda French Gates\n\nTransitions are moments in which we step out of our familiar surroundings and into a new landscape―a space that, for many people, is shadowed by confusion, fear, and indecision. The Next Day accompanies readers as they cross that space, offering guidance on how to make the most of the time between an ending and a new beginning and how to move forward into the next day when the ground beneath you is shifting.\n\nIn this book, Melinda will reflect, for the first time in print, on some of the most significant transitions in her own life, including becoming a parent, the death of a dear friend, and her departure from the Gates Foundation. The stories she tells illuminate universal lessons about loosening the bonds of perfectionism, helping friends navigate times of crisis, embracing uncertainty, and more.\n\nEach one of us, no matter who we are or where we are in life, is headed toward transitions of our own. With her signature warmth and grace, Melinda candidly shares stories of times when she was in need of wisdom and shines a path through the open space stretching out before us all.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "World of Eric Carle, Around the Farm 30-Button Animal Sound Book - Great for First Words - PI Kids",
      "imagesCSV": "91WyMdm13iL.jpg,81-gBlf08DL.jpg,818hLaeybWL.jpg,814K5Ak19zL.jpg,51sQd9XM0YL.jpg,41y1IImlvwL.jpg,41V0zdVW2gL.jpg",
      "manufacturer": "PI Kids",
      "asin": "1450805752",
      "brand": "PI Kids",
      "features": [
        "30 sound buttons, each representing a different animal.",
        "Children press button to hear animal name and sound associated with animal.",
        "Recommended for children ages 3 and older.",
        "Illustrated by renown children's book creator Eric Carle."
      ],
      "description": "Put on your overalls and have a stroll Around The Farm in this amazing sound book! Your little one can press 30 different sound buttons while they read to bring the amazing art stylings of Eric Carle to life! This sound books is special because: Hands on interaction engages young readers Multisensory reading experiences stimulate the imaginations of young readers Sharing books with your little one strengthens your bond Features the art stylings of Eric Carle, writer and illustrator of The Very Hungry Caterpillar Includes an amazing amount of animals: bull, cow, goat, pig, sheep, lamb, donkey, horse, hen, turkey, chick, rooster, cat, dog, mouse, frog, duck, turtle, fish, crow, sparrow, owl, woodpecker, snake, rabbit, cricket, dragonfly, bee, butterfly, and Eric Carle’s famous very hungry caterpillar",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidemic of Mental Illness",
      "imagesCSV": "81Rz9l29NiL.jpg",
      "manufacturer": "Penguin Press",
      "asin": "0593655036",
      "brand": "Penguin Publishing Group",
      "features": [],
      "description": "THE INSTANT #1 NEW YORK TIMES BESTSELLER • A Wall Street Journal Top 10 Book of 2024 • A New York Times and Washington Post Notable Book • One of Barack Obama's Favorite Books of 2024 • A TIME 100 Must-Read Book of 2024 • Named a Best Book of 2024 by the Economist, the New York Post, and Town & Country • The Goodreads Choice Award Nonfiction Book of the Year • Finalist for the PEN Literary Awards\n\nA must-read for all parents: the generation-defining investigation into the collapse of youth mental health in the era of smartphones, social media, and big tech—and a plan for a healthier, freer childhood.\n\n“With tenacity and candor, Haidt lays out the consequences that have come with allowing kids to drift further into the virtual world . . . While also offering suggestions and solutions that could help protect a new generation of kids.” —Shannon Carlin, TIME, 100 Must-Read Books of 2024\n\nAfter more than a decade of stability or improvement, the mental health of adolescents plunged in the early 2010s. Rates of depression, anxiety, self-harm, and suicide rose sharply, more than doubling on many measures. Why?\n\nIn The Anxious Generation, social psychologist Jonathan Haidt lays out the facts about the epidemic of teen mental illness that hit many countries at the same time. He then investigates the nature of childhood, including why children need play and independent exploration to mature into competent, thriving adults. Haidt shows how the “play-based childhood” began to decline in the 1980s, and how it was finally wiped out by the arrival of the “phone-based childhood” in the early 2010s. He presents more than a dozen mechanisms by which this “great rewiring of childhood” has interfered with children’s social and neurological development, covering everything from sleep deprivation to attention fragmentation, addiction, loneliness, social contagion, social comparison, and perfectionism. He explains why social media damages girls more than boys and why boys have been withdrawing from the real world into the virtual world, with disastrous consequences for themselves, their families, and their societies.\n\nMost important, Haidt issues a clear call to action. He diagnoses the “collective action problems” that trap us, and then proposes four simple rules that might set us free. He describes steps that parents, teachers, schools, tech companies, and governments can take to end the epidemic of mental illness and restore a more humane childhood.\n\nHaidt has spent his career speaking truth backed by data in the most difficult landscapes—communities polarized by politics and religion, campuses battling culture wars, and now the public health emergency faced by Gen Z. We cannot afford to ignore his findings about protecting our children—and ourselves—from the psychological damage of a phone-based life.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Would You Rather? Family Card Game: Fun Questions, Hilarious Answers, Lively Conversations!",
      "imagesCSV": "81rzcYdUWgL.jpg,61D9rXPUXHL.jpg,71tioOWopeL.jpg,81lFXIXYXVL.jpg,812XIJSQ8TL.jpg,51I2yMvLn2L.jpg,51N+xCtsBHL.jpg,31u-ycLLEwL.jpg,41Fxy3EL07L.jpg,51yTkNHpAAL.jpg,51pGuKYeFML.jpg",
      "manufacturer": "Z Kids",
      "asin": "0593690192",
      "brand": "N/A",
      "features": [],
      "description": "Converse and compete with this exciting card game for families!\n\nStart a competition and spirited conversations with these thought-provoking “Would You Rather?” questions. Are you the funniest, most creative, or most logical member of your family? Out-think and outsmart others with your best answers to these exciting brainteasers!\n200 uproarious questions for kids, teens, parents, grandparents, and anyone who enjoys a hilarious game night! Different ways to play this exciting game to fit everyone’s needs Screen-free entertainment and thought-provoking conversation starters for all ages Compact size to play on the go: perfect for road trips, waiting at restaurants, holiday get-togethers, camping, and more Lots of laughs! The questions are funny; players can make the answers even funnier Cool categories ranging from entertainment and sports to history and nature The perfect gift for your favorite friends and family",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Very Hungry Caterpillar",
      "imagesCSV": "81qsstEtrgL.jpg",
      "manufacturer": "World of Eric Carle",
      "asin": "0399226907",
      "brand": "Penguin",
      "features": [
        "Now even younger children can follow the little green caterpillar as he eats his way to becoming a beautiful butterfly in this sturdy board book",
        "Great for early development",
        "Children will enjoy this delightful tale",
        "Ages 2 to 5"
      ],
      "description": "THE ICONIC #1 BESTSELLER • The all-time classic starring the world’s favorite caterpillar! This beautiful, sturdy board book is a perfect gift for new babies, baby showers, birthdays, and other new beginnings!\n\n“Gorgeously illustrated, brilliantly innovative.”—The New York Times Book Review\n\nIn the light of the moon a little egg lay on a leaf.\nOne Sunday morning the warm sun came up and—pop!—out of the egg came a tiny and very hungry caterpillar.\n\nSo begins the journey of Eric Carle’s most beloved storybook character. Follow along as one of nature’s loveliest marvels eats his way through an amazing variety of foods as he prepares to grow into a beautiful butterfly! Children will love the strikingly bold, colorful pictures against a simple text in large, clear type. Featuring interactive die-cut pages, this board book is the perfect size for little hands and great for teaching counting, days of the week, and the concept of change as a positive and necessary part of life.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "My First How to Catch the Easter Bunny",
      "imagesCSV": "81VU2Pu+jFS.jpg,410sCpC13jL.jpg,41sbDl7HmJL.jpg,41izWC36CML.jpg,41cSKs-KUtL.jpg,41e6izA2UyL.jpg,41+tr2JLIML.jpg,41wqaIc49uL.jpg,41A0ppTLQfL.jpg,517T202ojzL.jpg",
      "manufacturer": "Sourcebooks Wonderland",
      "asin": "1728243998",
      "brand": "Readerlink",
      "features": [],
      "description": "Hop along and join the fun of the New York Times and USA Today bestselling How to Catch brand with this sweet Easter board book, the perfect gift basket stuffer for babies and toddlers!\nCan you catch the wily Easter Bunny this year? In this delightful Easter tale, one child and his baby animal friends hope to catch this Easter legend and learn his special tricks! Just how does he get eggs to every child in one day? Brimming with charming rhymes, simple STEM traps, and bright illustrations, this Easter bunny book for kids will delight little readers as they follow along to build playful lures and trap everyone's favorite bunny!\nFilled with hidden eggs, baskets, candy, chocolates, and more, this adorable story makes the perfect addition to any Easter basket, holiday gift for babies and toddlers, or a festive springtime read aloud for ages 0-3!\nI want to catch the Easter Bunny and learn his secret ways,\nI've set my traps and now just hope we meet on Easter Day!\nLooking for more read aloud fun? Also in the How to Catch series: My First How to Catch Santa Claus My First How to Catch a Witch My First How to Catch the Big Bad Wolf How to Catch the Easter Bunny How to Catch a Unicorn And more!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Stress Relief: Coloring Book for Adults and Kids, Bold and Easy, Simple and Big Designs for Relaxation Featuring Animals, Landscape, Flowers, Patterns, Cute Things And Many More (Bold & Easy Coloring)",
      "imagesCSV": "51SV5MQFu6L.jpg,51bTnxjsZwL.jpg,41+BaHmzBQL.jpg,41delbkj5yL.jpg,41AH7nyWujL.jpg,41IVzVgcGTL.jpg,41BjFRUo02L.jpg,41sLuYKiipL.jpg,51sbAOh+LTL.jpg",
      "manufacturer": "Independently published",
      "asin": "B0D3CSPMZG",
      "brand": "QUIQEI",
      "features": [],
      "description": "These 52 big, bold, and easy coloring pages offer tons of fun and include animals, landscape, flowers, patterns, mushrooms and many more for relaxation. They provide a moment of stress relief with their simple yet interesting designs.\nThe pictures are very bold, ensuring an enjoyable coloring process without worrying about smudging.\nThis \"Stress Relief Coloring Book\" includes: 52 hand-drawn pages ready for coloring Large, bold, and easy-to-follow designs for a delightful coloring experience Single-sided pages to prevent bleed-through (if using markers, remember to place a protective sheet behind the page you're coloring) A convenient size of 8.5 x 8.5 inches for easy handling High-resolution prints for clear, crisp images",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Great Easter Race!: An Egg-straordinary Spring Story with Elmo, Cookie Monster, and Friends! (Sesame Street Scribbles)",
      "imagesCSV": "91CGN2V9hqL.jpg",
      "manufacturer": "Sourcebooks Wonderland",
      "asin": "1492638374",
      "brand": "Sourcebooks Wonderland",
      "features": [],
      "description": "A USA Today bestseller and must-have Easter basket stuffer for children who love Sesame Street!\nIt's Easter morning, and Elmo, Cookie Monster, Big Bird, and their friends are gathered at the park for the Great Easter Race! Who will win the day? Will it be the turtle, who moves slowly and steadily toward the finish? Or will it be the bunny, who runs faster than thunder, but seems easily distracted? Fun surprises wait around every turn, so come join the fun in this light-hearted Sesame Street picture book for toddlers and kids ages 3-6!\nThe perfect addition to any Easter gift basket or for classroom and bedtime read-alouds, this Elmo book will delight emerging readers and lovers of the Tortoise and the Hare's great race.\nIt's a bright Easter morning on Sesame Street,\nand out in the park, friends are starting to meet.\nThere are beautiful colors and flags waving free.\nSomething special is happening. But what can it be?",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "I Love You Like No Otter: A Funny and Sweet Animal Board Book for Babies and Toddlers this Easter (Punderland)",
      "imagesCSV": "81YYStQvnsL.jpg,31rh89dI9EL.jpg,31eVAnDmPQL.jpg,41JGLWznPjL.jpg,31mo3ZX1sFL.jpg,31XgbxDovsL.jpg,31hPfrPgsbL.jpg",
      "manufacturer": "Sourcebooks Wonderland",
      "asin": "1728213746",
      "brand": "Sourcebooks Wonderland",
      "features": [
        "Pun-filled book about the love between parent and child",
        "Encourages family bonding, laughter",
        "Charming, heart-melting illustrations on each page",
        "Words by Rose Rossner",
        "Pictures by Sydney Hanson"
      ],
      "description": "A USA Today bestseller! Give hedgehugs and kisses to your little squeakheart with this pun-tastic, funny baby book, the perfect Easter gift or for any occasion!\nThere's no better way to say \"I love you\" than with a sweet and heartfelt animal pun book! I Love You Like No Otter combines a warm message of love with beautifully illustrated animals families will love to read and share together. From baby shower gifts for new parents to bedtime read alouds all year long, this adorable board book is purrfect for anyone you love beary much!\nI love you like no otter. You truly are the best.\nMy special little squeakheart, a step above the rest.\nThe best book for: Babies and toddlers ages 0-3. Made just for their little hands! Valentine's Day, Mother's, or Father's Day gifts Baby shower gifts for new parents Holiday stocking or Easter basket stuffers Birthdays and other special moments all year long and more!\nMore charming stories from Punderland, the perfect gift for any occasion: I Love You Slow Much You Make My Heart Go Vroom! Somebunny Loves You I Love You More, Babysaur Donut Give Up",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Oh, the Places You'll Go!",
      "imagesCSV": "7186aAI6FFL.jpg,411WofpkiQL.jpg,51yixwqnTBL.jpg,41BzQaWxEML.jpg",
      "manufacturer": "Random House Books for Young Readers",
      "asin": "0679805273",
      "brand": "Random House Books for Young Readers",
      "features": [
        "From soaring to high heights and seeing great sights to being left in a Lurch on a prickle-ly perch, Dr. Seuss addresses life�s ups and downs with his trademark humorous verse and whimsical illustrations.",
        "The inspiring and timeless message encourages readers to find the success that lies within, no matter what challenges they face. A perennial favorite and a perfect gift for anyone starting a new phase in their life!"
      ],
      "description": "Dr. Seuss’s wonderfully wise Oh, the Places You’ll Go! is the perfect gift to celebrate all of our special milestones—from graduations to birthdays and beyond!\n\n“[A] book that has proved to be popular for graduates of all ages since it was first published.”—The New York Times\n\nFrom soaring to high heights and seeing great sights to being left in a Lurch on a prickle-ly perch, Dr. Seuss addresses life’s ups and downs with his trademark humorous verse and whimsical illustrations.\n\nThe inspiring and timeless message encourages readers to find the success that lies within, no matter what challenges they face. A perennial favorite and a perfect gift for anyone starting a new phase in their life!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Onyx Storm (Deluxe Limited Edition) (The Empyrean, 3)",
      "imagesCSV": "9101MLPcFTL.jpg",
      "manufacturer": "Entangled: Red Tower Books",
      "asin": "1649374186",
      "brand": "Entangled: Red Tower Books",
      "features": [],
      "description": "Discover the instant #1 New York Times bestseller! TV series now in development at MGM Amazon Studios with Michael B. Jordan’s Outlier Society.\n\nAccolades for Fourth Wing\nAmazon Best Books of the Year, #4 • Apple Best Books of the Year 2023 • Barnes & Noble Best Fantasy Book of 2023 • NPR \"Books We Love\" 2023 • Audible Best Books of 2023 • Hudson Book of the Year • Google Play Best Books of 2023 • Indigo Best Books of 2023 • Waterstones Book of the Year finalist • Goodreads Choice Award Winner • Newsweek Staffers’ Favorite Books of 2023 • Paste Magazine’s Best Books of 2023 • TikTok Book Awards UK and Ireland Book of the Year (International) 2024\n\nAfter nearly eighteen months at Basgiath War College, Violet Sorrengail knows there’s no more time for lessons. No more time for uncertainty.\n\nBecause the battle has truly begun, and with enemies closing in from outside their walls and within their ranks, it’s impossible to know who to trust.\n\nNow Violet must journey beyond the failing Aretian wards to seek allies from unfamiliar lands to stand with Navarre. The trip will test every bit of her wit, luck, and strength, but she will do anything to save what she loves―her dragons, her family, her home, and him.\n\nEven if it means keeping a secret so big, it could destroy everything.\n\nThey need an army. They need power. They need magic. And they need the one thing only Violet can find―the truth.\n\nBut a storm is coming...and not everyone can survive its wrath.\n\nThe Empyrean series is best enjoyed in order.\nReading Order:\nBook #1 Fourth Wing\nBook #2 Iron Flame\nBook #3 Onyx Storm",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Girl Moments: Coloring Book for Adults and Teens Featuring Cute Cozy Daily Activities for Relaxation (Cozy Spaces Coloring)",
      "imagesCSV": "51cgF-H5GbL.jpg,61Xf0YU2v0L.jpg,51oOE-DOByL.jpg,51MjYzCWyJL.jpg,51Olean4jUL.jpg,51FYuUBAygL.jpg,51xwA3nK2AL.jpg,51C2Sp391ML.jpg",
      "manufacturer": "Independently published",
      "asin": "B0DL5SF36B",
      "brand": "Independently Published",
      "features": [],
      "description": "Step into a world of calm and comfort with the Girl Moments Coloring Book, where 40 unique illustrations offer the warmth of cozy, familiar daily activities. Each page invites you to pause and enjoy the little joys — from quiet mornings with a warm cup of tea to peaceful moments spent reading. Perfect for unwinding! Let yourself drift into the soft, soothing vibes and rediscover the simple comforts that make every day a little brighter.\nThis book offers: 40 hand-drawn pages ready for coloring Super cute coloring pages for stress relief and relaxation Single-sided pages to prevent bleed-through (if using markers, remember to place a protective sheet behind the page you're coloring) A convenient size of 8.5 x 8.5 inches for easy handling High-resolution prints for clear, crisp images",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Beginner's Bible: Timeless Children's Stories",
      "imagesCSV": "81Pic6bOvuL.jpg,81QPDyzzwJL.jpg,81n4BUIFGXL.jpg,81-VNfK7FlL.jpg,81YmhFHhOzL.jpg,81tM3dEqPwL.jpg,81gbhWuj7ML.jpg,91JzjvDpQ4L.jpg,81JDRAPfiaL.jpg,51QP-EkCpDL.jpg,51LAgU+wXjL.jpg,51ujCuomxxL.jpg,51z8BgasERL.jpg,511FTqagmdL.jpg,51DjRoaI2nL.jpg,4110be+qWGL.jpg,51UPXmKrmXL.jpg,41ybbTPVBFL.jpg,51W5ZZDizVL.jpg,61SW7tuJYiL.jpg,51ni9sGk5XL.jpg,516xWRdJ-bL.jpg,51bmZOGIYAL.jpg",
      "manufacturer": "Zonderkidz",
      "asin": "031075013X",
      "brand": "HarperCollins",
      "features": [
        "Hardcover",
        "Children's"
      ],
      "description": "Millions of children and their parents can’t be wrong. The bright and vibrant illustrations enhance every word of The Beginner’s Bible® to produce one of the most moving and memorable Bible experiences a young child can have.\nThe Beginner’s Bible is where a child’s journey towards a lifelong love of God’s Word begins.\nKids will enjoy reading the story of Noah’s Ark as they see Noah helping the elephant onto the big boat. They will learn about the prophet Jonah as they see him praying inside the fish. And they will follow along with the text of Jesus’ ministry as they see a man in need of healing lowered down through the roof of a house.\nParents, teachers, pastors, and children will rediscover these beloved parables and so much more as they read more than 90 stories in The Beginner's Bible, just like millions of children before. The Beginner’s Bible® brand has been trusted for nearly 30 years, with more than 25 million products sold.\nFrom First Communions to birthdays, Christmas to Easter, The Beginner’s Bible is not only a wonderful gift for any child, it is one of the most trusted Christian resources for Sunday school and homeschooling.\nThe Beginner’s Bible: Has been a favorite with young children and their parents for nearly 30 years Is redesigned with fresh, new art for a new generation of readers Contains easy-to-read text that has been parent-tested and children-approved Features bright, full-color illustrations on every page Includes more than 90 memorable Bible stories Is built tough to withstand rough handling and frequent classroom use Is a highly-trusted, highly-recommended addition to the Beginner’s Bible brand, with over 25 million products sold",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Gut-Brain Paradox: Improve Your Mood, Clear Brain Fog, and Reverse Disease by Healing Your Microbiome (The Plant Paradox, 9)",
      "imagesCSV": "71I6a62sQEL.jpg",
      "manufacturer": "Harper",
      "asin": "0062911805",
      "brand": "N/A",
      "features": [],
      "description": "Dr. Steven R. Gundry, the New York Times bestselling author of the groundbreaking Plant Paradox series, shares compelling evidence that our gut microbiome is driving our thoughts, feelings, behaviors, and our mental, emotional, and neuronal health—and shows us how to heal our microbiomes to take back control of our minds.\nIn his previous bestselling books, Steven R. Gundry taught readers how to reverse disease and improve health and well-being by preventing and repairing leaky gut. In The Gut-Brain Paradox, he delves even more deeply into the mysterious and long misunderstood world of the human microbiome. Here Dr. Gundry uncovers the complex and multifaceted ways in which our microbes are controlling the health and functioning of our brains, and how the gut-brain connection is made long before we are even born.\nThe Gut-Brain Paradox shines a fascinating light on how the one-two punch of leaky gut and gut dysbiosis, together driven by western diets, overuse of antibiotics and other medications, and environmental toxins allow pathogenic bacteria to take over. These “bad bugs” cause inflammation and hijack the intricate messaging systems that run from the gut to the brain, setting the stage for neurological changes, brain fog, neurodegeneration, mental health issues, personality alterations, and even addiction.\nHowever, these changes are reversible. Featuring the latest science, easy-to-follow recipes, and supplement guides, The Gut-Brain Paradox shows us how to eat to restore not only our inner balance, but our mental energy and well-being, too.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Next Conversation: Argue Less, Talk More",
      "imagesCSV": "71nr20MzkbL.jpg",
      "manufacturer": "Tarcher",
      "asin": "0593718720",
      "brand": "N/A",
      "features": [],
      "description": "THE INSTANT NEW YORK TIMES BESTSELLER\n\nFrom communication expert Jefferson Fisher, the definitive book on making your next conversation the one that changes everything\n\nNo matter who you’re talking to, The Next Conversation gives you immediately actionable strategies and phrases that will forever change how you communicate. Jefferson Fisher, trial lawyer and one of the leading voices on real-world communication, offers a tried-and-true framework that will show you how to transform your life and your relationships by improving your next conversation.\n\nFisher has gained millions of followers through short, simple, practical videos teaching people how to argue less and talk more. Whether it’s handling a heated conversation, dealing with a difficult personality, or standing your ground with confidence, his down-to-earth teachings have helped countless people navigate life’s toughest situations. Now for the first time, Fisher has distilled his three-part communication system (Say it with control, Say it with confidence, Say it to connect) that can easily be applied to any situation.\n\nYou will learn:\nWhy you should never “win” an argument How to assert yourself and communicate with intention How to set boundaries and frame conversations Why saying less is often more How to overcome conflict with connection\nThe Next Conversation will give you practical phrases that will lead to powerful results, from breaking down defensiveness in a hard talk with a family member to finding your own assertive voice at the boardroom conference table. Your every word matters, and by controlling how you communicate every day, you will create waves of positive impact that will resonate throughout your relationships to last a lifetime.\n\nEverything you want to say, and how you want to say it, can be found in The Next Conversation.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "I Love You to the Moon and Back",
      "imagesCSV": "81mpSoJzv4L.jpg,41vIEAqTD3L.jpg,41rz6n9k0fL.jpg,41PHVslUemL.jpg",
      "manufacturer": "Tiger Tales",
      "asin": "1589255518",
      "brand": "Tiger Tales",
      "features": [],
      "description": "Show your child just how strong your love is every minute of the day! Features a \"To\" and \"From\" personalization page, making this sweet board book an ideal gift for baby showers, birthdays, and new parents.\n\nThe sun rises, and a bear and cub begin their day together. They splash in the water, climb mountains, watch the colorful lights in the shimmering sky, and play with friends. They show their love for each other by touching noses, chasing each other, and, of course, hugging and snuggling before bed.\n\n· A sweet book for babies and toddlers ages 0-3\n· Perfect Mother's Day, Father's Day, Valentine's Day, baby showers, birthdays, and new parents\n· Includes a \"To\" and \"From\" personalization page in the front of the book, making this heartwarming book an ideal gift",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Rainbow Fish",
      "imagesCSV": "81YNkSjQ+XL.jpg",
      "manufacturer": "NorthSouth Books",
      "asin": "1558585362",
      "brand": "Simon & Schuster",
      "features": [
        "Northsouth (ny)",
        "Language: english",
        "Book - the rainbow fish"
      ],
      "description": "For the youngest readers, the board book edition from the New York Times bestselling Rainbow Fish series.\n\nThe award-winning book about a beautiful fish who finds friendship and happiness when he learns to share.\n\nEye-catching foil stamping, glittering on every page, will delight every child, but it is the universal message at the heart of this simple story about a beautiful fish who learns to make friends by sharing his most prized possessions that gives this book its enduring value.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Dog Man: Big Jim Begins: A Graphic Novel (Dog Man #13): From the Creator of Captain Underpants",
      "imagesCSV": "51KBkifQI3L.jpg,5175RgbgsvL.jpg,51bE0l9RQDL.jpg,51WCJK7PDLL.jpg,510Ldg3TM+L.jpg,51rz5pHtfLL.jpg",
      "manufacturer": "Graphix",
      "asin": "1338896458",
      "brand": "Scholastic",
      "features": [],
      "description": "In DOG MAN: BIG JIM BEGINS, discover the origin of our beloved characters from the Dog Man series as they join forces to stop the Space Cuties from destroying the city. Will the past predict the future for Dog Man and his friends? Will goodness and bravery prevail? Can anything happen if you truly believe?\n\nGet ready for another unforgettable book in the #1 worldwide bestselling series from acclaimed graphic novelist and award-winning illustrator Dav Pilkey. AND coming soon, the Dog Man movie from DreamWorks Animation and Universal Pictures!\nFor more heartfelt and humorous adventures, join Flippy and Li'l Petey in the Cat Kid Comic Club series. Have fun with creativity with the official coloring book, Dog Man with Love. And don't forget about the series that started it all: Captain Underpants!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Body Keeps the Score: Brain, Mind, and Body in the Healing of Trauma",
      "imagesCSV": "71Ha3OShqSL.jpg",
      "manufacturer": "Penguin Books",
      "asin": "0143127748",
      "brand": "Random House Books for Young Readers",
      "features": [
        "Penguin Books",
        "Ideal for a bookworm",
        "It's a great choice for a book person"
      ],
      "description": "#1 New York Times bestseller\n\n“Essential reading for anyone interested in understanding and treating traumatic stress and the scope of its impact on society.” —Alexander McFarlane, Director of the Centre for Traumatic Stress Studies\n\nA pioneering researcher transforms our understanding of trauma and offers a bold new paradigm for healing in this New York Times bestseller\n\nTrauma is a fact of life. Veterans and their families deal with the painful aftermath of combat; one in five Americans has been molested; one in four grew up with alcoholics; one in three couples have engaged in physical violence. Dr. Bessel van der Kolk, one of the world’s foremost experts on trauma, has spent over three decades working with survivors. In The Body Keeps the Score, he uses recent scientific advances to show how trauma literally reshapes both body and brain, compromising sufferers’ capacities for pleasure, engagement, self-control, and trust. He explores innovative treatments—from neurofeedback and meditation to sports, drama, and yoga—that offer new paths to recovery by activating the brain’s natural neuroplasticity. Based on Dr. van der Kolk’s own research and that of other leading specialists, The Body Keeps the Score exposes the tremendous power of our relationships both to hurt and to heal—and offers new hope for reclaiming lives.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Fancy Nancy and the Missing Easter Bunny: An Easter And Springtime Book For Kids",
      "imagesCSV": "91XW4FtBHkL.jpg,81CW22NIlGL.jpg,81d4poxVw-L.jpg,51Ea-2DzVtL.jpg",
      "manufacturer": "HarperCollins",
      "asin": "0062377922",
      "brand": "HarperCollins",
      "features": [],
      "description": "Join Fancy Nancy in a fabulous Easter adventure with this 8x8 storybook complete with fancy stickers!\nFancy Nancy can’t wait for Easter. And this year, JoJo’s class pet, Nibbles the bunny, is staying at the Clancys’ house for the weekend. But when Bree and Freddy come over to begin an Easter egg hunt, Nibbles goes missing! It’s up to Nancy to find her before anyone notices she’s gone.\nFrom the dazzling duo Jane O’Connor and Robin Preiss Glasser of the bestselling Fancy Nancy series comes a great addition to any fancy girl's Easter basket and a perfect springtime read.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Jesus Loves Me 5-Button Songbook - Perfect Gift for Easter Baskets, Christmas, Birthdays, Baptisms, and More (Little Sunbeams)",
      "imagesCSV": "81n8QtO1LfL.jpg,81D9jnoaNgL.jpg,81da91BohgL.jpg,81vRSbBBdDL.jpg,716AFtjVuoL.jpg,71aBb1wZ7pL.jpg,51AkUaAA4NL.jpg",
      "manufacturer": "Cottage Door Press",
      "asin": "1680523716",
      "brand": "Cottage Door Press",
      "features": [],
      "description": "Enjoy a fun, family activity by reading and singing to 5 Bible songs! Read along to the lyrics of each familiar song and press the buttons on the wooden side panel to play sounds for your sing-along. Each button has a corresponding icon on the page to match lyrics with the melody. Pushing the interactive buttons helps toddlers and babies develop fine motor skills, while singing builds early literacy skills. Religious songs included are All Things Bright and Beautiful, Jesus Loves Me, Go Tell It on the Mountain, This Little Light of Mine, and I've Got the Joy in My Heart. This adorable sound book is perfect for Easter gifts for kids, as well as other holidays and birthdays throughout the year.\nLittle Sunbeams books offer little ones sweet reminders of God's blessings and love while encouraging thoughtfulness and gratitude. We believe there is a \"little light\" inside each of us that makes us special, and these stories encourage little ones to let their light shine! Look for additional titles in the Little Sunbeam series from Cottage Door Press.\n﻿﻿Sturdy, thick board pages and durable flaps are designed to withstand traditional wear and tear for curious little infants and toddlers. Icons on each page correspond with the buttons, providing an opportunity to practice matching and fine motor skills. Includes a handle to carry along at home or on-the-go. Little toddlers will love carrying this around all over the place! Use it in your playroom or take it within the car or on a stroller ride. Cheerful illustrations and rhyming text in these sensory board books for little kids to keep them entertained and engaged. Interactive elements encourage sensory exploration and help support the development of hand-eye coordination in developing children. If you're looking for Christian gifts, this is great for baby showers, baptisms, birthdays, first communions, Easter basket stuffers, and Christmas gifts for girls and boys",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Preteen Devotional for Girls: 52 Weeks of Encouraging Devotions and Scripture for Tweens",
      "imagesCSV": "81Rsaj83KtL.jpg,51COZt5UVWS.jpg,4164nAdDa8L.jpg,41xTtbwymIL.jpg,51FOwfTb7qL.jpg,51DCAkHjqwL.jpg,51D7pOs5axL.jpg",
      "manufacturer": "Zeitgeist Young Adult",
      "asin": "0593196929",
      "brand": "N/A",
      "features": [],
      "description": "52 weeks of uplifting devotions and prayers for girls ages 10−12\n\nThe preteen years can be complicated, and this conversational devotional helps girls find their voice and inner strength through God’s love and light. Brittany Rust, an experienced Bible teacher with a passion for helping teens know God and His Word, discusses and interprets Scripture in a way that makes it easy for kids to understand and speaks to everyday preteen concerns, like friends and cliques, self-esteem, privacy, social media, and crushes.\n\nPreteen Devotional for Girls features:\n\n• 52 weekly devotions organized by themes like “Relationships,” “Faith,” and “Feelings and Identity” provide discussions of Scripture and how God’s word can help find solutions and security\n• Friendly, encouraging tone strikes the perfect balance of wise, supportive mentorship and relatability\n• Open-ended prompts are thought-provoking and encourage preteens to trust God and themselves\n• A path to regular practice of Bible study and prayer is carved out through one devotion per week, easing tweens into a natural interest and desire for study and reflection\n• The full-color pages and fun design create an interactive experience and boost creativity and self-expression",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Baby Touch and Feel: Bunny",
      "imagesCSV": "81ZlVuSrPDL.jpg,81XK4MRYMrL.jpg,81YsJHNQVTL.jpg,71imsPxN2EL.jpg,41vt41+SnjL.jpg,41wV1xaReiL.jpg",
      "manufacturer": "DK Children",
      "asin": "0756689872",
      "brand": "DK",
      "features": [],
      "description": "An interactive touch and feel book for babies with lovable, furry bunnies and read-aloud text! Tactile elements and delightful imagery will encourage the development of motor skills and early learning.\n\nBaby Touch and Feel: Bunny is an interactive and fun way to help your child learn not only words but shapes and textures too. Bold, bright pictures and colorful animal-inspired illustrations will be more than enough to keep your baby’s attention. This adorable picture book is a perfect first book for toddlers and makes for an ideal baby gift.\n\nMeet cute bunnies and read all about their long ears and furry tails! Not too big and not too small, this sturdy, padded sensory book is just the right size for little hands to hold. No need for Mom and Dad to turn the pages! Babies and toddlers can turn the tough board book pages themselves, which helps to develop their fine motor skills while building an early language foundation.\n\nThis charming board book for babies includes:\n\n- An amazing range of different textures to explore.\n- Cleary labeled pictures and a simple, easy to follow design.\n- Easy to read text to encourage early vocabulary building.\n- A texture or eye-catching area on every page.\n- Rounded edges and chunky pages, protecting babies and their growing teeth.\n\nLearning to read should always be this fun. Kids will get hours of play from this sturdy board book for babies and toddlers, from making the noises and reading the names to feeling the different textures, like the soft fur of a golden bunny. This touchy-feely book, with its strong, baby-safe cover, makes for an ideal baby gift. Packed full of shiny objects and some bumps and grooves, this educational book will engage small children and stimulate early childhood development in different ways.\n\nComplete the Series\n\nThis delightful book is part of the Baby Touch and Feel range of board books for babies and toddlers from DK Books and includes titles like Baby Touch and Feel I Love You, Baby Touch and Feel Bedtime, Baby Touch and Feel Colors and Shapes, and more for your little one to enjoy!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Chicka Chicka Boom Boom (Board Book)",
      "imagesCSV": "51WABgZmdWL.jpg",
      "manufacturer": "Little Simon",
      "asin": "1442450703",
      "brand": "Simon & Schuster",
      "features": [],
      "description": "There is always enough room on your child’s bookshelf for this Classic Board Book edition of the rollicking alphabet chant that has been a children’s favorite for over thirty years!\n\nA told B,\nand B told C,\n“I’ll meet you at the\ntop of the coconut tree”\n\nIn this lively alphabet rhyme, all the letters of the alphabet race each other up the coconut tree. Will there be enough room? Oh, no—Chicka Chicka Boom! Boom!\n\nCountless children—and their parents—can joyfully recite the familiar words of this beloved alphabet chant. Bill Martin, Jr., and John Archambault’s rhythmic text keeps the beat with Caldecott Honor illustrator Lois Ehlert’s bold, cheerful art. This winning combination has made the Chicka Chicka series an enduring classic.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Baby's First Bible Stories Padded Board Book - Gift for Easter, Christmas, Communions, Newborns, Birthdays, Beginner Bible (Little Sunbeams)",
      "imagesCSV": "81a1UlELVGL.jpg,81mXPQNLMTL.jpg,81YyW+1uYXL.jpg,81x9sgrZrdL.jpg,61Wowdw4gyL.jpg,61TbBtB5HzL.jpg,61OpvXiHFkL.jpg,81or9P8LPIL.jpg,412SzgGtLOL.jpg,41qZlAbpf7L.jpg",
      "manufacturer": "Cottage Door Press",
      "asin": "1680524232",
      "brand": "Cottage Door Press",
      "features": [
        "12 favorite Bible stories and prayers"
      ],
      "description": "Share Bible stories and the love of Christ with your little one in this collection of bright illustrations and sweet age-appropriate stories and prayers. Each story and prayer includes an interactive element to help children develop their own relationships with God. This sturdy padded board book is a wonderful introduction to faith for young boys and girls. Bible stories collection included: Creation, Noah’s Ark, Baby Moses, Daniel and the Lions, and more! Includes 12 favorite stories from the Bible, retold in simple language which helps make it easy for toddlers to understand Beautiful illustrations keep your child engaged, and sturdy, thick board pages are designed to withstand traditional wear and tear Introduce Christian and religious beliefs to your little ones with prayers for any situation, and easy-to-read foundational Bible stories This Bible for kids encourages curiosity and bonding between parents and children through prayer and religion If looking for Christian gifts, this is great for baby showers, baptisms, birthdays, first communions, Easter basket stuffers, and Christmas",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "It's Better Being a Bunny: An Early Reader Book for Kids (Beginner Books)",
      "imagesCSV": "713RP-0I7BL.jpg",
      "manufacturer": "Random House Books for Young Readers",
      "asin": "0593434706",
      "brand": "Random House Books for Young Readers",
      "features": [],
      "description": "NATIONAL BESTSELLER • Perfect for Easter or celebrating bunnies all year round. A charming follow-up to the classic Beginner Book It’s Not Easy Being a Bunny!\n\nP.J. Funnybunny is back and more lovable than ever in this sweet, funny sequel.\n\nP.J. Funnybunny is not having a good day. His mom won't let him eat ice cream for breakfast. She won't let him hang upside down from a tree. She won't even let him watch a scary movie! P.J. visits Potts Pig, whose mom lets them do all those things. But when he gets a stomachache and has a bad dream, P.J. Funnybunny realizes that—while it's fun to be a pig—it's better being a bunny!\n\nThis new tale of self-discovery is the perfect Easter treat for beginning readers and bunny fans of all ages!\n\nBeginner Books are fun, funny, and easy to read! Launched by Dr. Seuss in 1957 with the publication of The Cat in the Hat, this beloved early reader series motivates children to read on their own by using simple words with illustrations that give clues to their meaning. Featuring a combination of kid appeal, supportive vocabulary, and bright, cheerful art, Beginner Books will encourage a love of reading in children ages 3–7.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Beginner's Bible the Very First Easter",
      "imagesCSV": "81QiZCyeZ8L.jpg,91YpF3WfjsL.jpg,81F3HMT5ZpL.jpg,81onDIHurXL.jpg,81W378ET1sL.jpg,81NplRWW+yL.jpg,81ZpXDikWHL.jpg,81OZ-qUIm0L.jpg",
      "manufacturer": "Zonderkidz",
      "asin": "0310763010",
      "brand": "HarperCollins",
      "features": [],
      "description": "The Beginner’s Bible® is a trusted starting point for your child’s journey towards a lifelong love of God’s Word. The Beginner’s Bible The Very First Easter is the perfect picture book to help introduce young children to Jesus’ final days and the message of God’s great love.\nWith exciting illustrations from the bestselling and beloved The Beginner’s Bible brand, The Beginner’s Bible The Very First Easter introduces children to the amazing story of Jesus’ death and resurrection.\nA perfect gift from grandparents or parents for Easter, The Beginner’s Bible The Very First Easter features: Simply written, easy to understand content for children ages 0-4 A small format perfect for young children to carry anywhere The stories of Jesus’ death and resurrection\nA favorite with young children and their parents, The Beginner’s Bible The Very First Easter is great for: Easter baskets and gifts Children’s ministry small groups Outreach ministry such as gifts to visiting families on Easter Sunday Toddler story time\nReview The Beginner's Bible’s complete library for dozens of titles available for kids of all ages and reading levels.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "On Democracies and Death Cults: Israel and the Future of Civilization",
      "imagesCSV": "91FxXLjltsL.jpg",
      "manufacturer": "Broadside Books",
      "asin": "0063437139",
      "brand": "N/A",
      "features": [],
      "description": "In his travels through Israel and Gaza, #1 International Bestselling author Douglas Murray has seen the best and the worst humanity has to offer, and he has no trouble choosing a side.\nMurray is not Jewish and before October 7, he had never lived in Israel. However, he objects to being lied to, and Israel has been on the receiving end of the biggest, deepest, longest lies in history.\nIsrael's commitment to fundamental Western values—capitalism, individual rights, democracy, and reason—has made it a beacon of progress in a region dominated by authoritarianism and extremism. Israel’s principles vividly contrast with the ideology of Hamas, which openly proclaims its love of death over life. With incisive moral clarity, On Democracies and Death Cults exposes how the campus left and international establishment confuse this conflict by: Calling on Israel for restraint and proportionality, while Hamas commits genocide. Slandering Israelis as white colonialists, while only a third of Israelis are Jews of European ancestry. Framing the conflict as oppressor vs. oppressed, when it is really between a thriving multi-ethnic democracy and a death cult bent on its annihilation.\nDrawing from intensive on-the-ground reporting in Israel, Gaza, and Lebanon, Douglas Murray places the latest violence in its proper historical context. He takes readers on a harrowing journey through the aftermath of the October 7 massacre, piecing together the exclusive accounts from victims, survivors, and even the terrorists responsible for the atrocities. If left unchecked, misplaced sympathy could embolden forces that seek to undermine not only Israel, but all of Western civilization.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Jesus Loves Me Praying Hands Board Book - Gift for Easter, Christmas, Communions, Birthdays, and more! (Little Sunbeams)",
      "imagesCSV": "8130X9JCqeL.jpg,81eTn51Vf5L.jpg,71dGQzM8+jL.jpg,71Ayb9uXJdL.jpg,71feZAtHe6L.jpg,81ANO5fm4fL.jpg,71aBb1wZ7pL.jpg,71JmnqwBrAL.jpg,61OpvXiHFkL.jpg,417quAwR91L.jpg,51bsPNnw5GL.jpg",
      "manufacturer": "Cottage Door Press",
      "asin": "1680528025",
      "brand": "Cottage Door Press",
      "features": [],
      "description": "\"Jesus loves me, this I know.\" Based on the classic children's song, this book explores just some of the ways Jesus loves all of us. Introduce little ones to giving thanks for everything from the food on our plates to the people we eat with, as well as the birds in the sky and flowers in the park. The mix of sweet illustrations and moments of faith for grown-ups and toddlers alike makes this an adorable prayer book to read during the day, at bedtime, or to bring along with the Bible to services.\nLittle Sunbeams books offer little ones sweet reminders of God's blessings and love while encouraging thoughtfulness and gratitude. We believe there is a \"little light\" inside each of us that makes us special, and these stories encourage little ones to let their light shine! Look for additional titles in the Little Sunbeam series from Cottage Door Press.\nShaped like little, praying hands, the board book has thick and sturdy pages to ensure durability among babies and children of all ages Adorable illustrations throughout help keep any toddler engaged Introduce Christian and religious beliefs to your little boy or girl with prayers for any situation Encourages curiosity and bonding between parents and children through prayer If you're looking for Christian gifts, this is great for baby showers, baptisms, birthdays, first communions, Easter basket stuffers, and Christmas gifts for kids",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Be Smart Pay Zero Taxes: Use the Buy, Borrow, Die Strategy to Get Rich and Stay Rich",
      "imagesCSV": "7167BCcTWeL.jpg",
      "manufacturer": "Humanix Books",
      "asin": "163006310X",
      "brand": "N/A",
      "features": [],
      "description": "BUILD WEALTH. KEEP MORE. LIVE TAX-FREE.\nDiscover the strategies the ultra-wealthy use to grow their fortunes and legally avoid taxes — made simple for EVERYONE — with the ultimate guide to reducing your tax bill to zero. Learn the secrets the rich use to get rich, and STAY RICH, including:\nMaster the S.M.A.R.T. system: Strategies to Maximize Assets and Reduce Taxes. Build your “Perfect Portfolio”: It is LIFE-CHANGING! Leverage “The Five Pillars” of investing — stocks, real estate, life insurance, cryptocurrency, and precious metals — a bulletproof, tax-free financial plan. Implement the “Buy, Borrow, Die” strategy to grow and protect tax free wealth. Live off the “Borrow Button”: Unlock tax-free financial freedom by borrowing against your investments and never selling your assets. Learn how ANYONE can build $6 million in wealth, retire early, and live tax-free without relying on traditional retirement accounts. Turn modest earnings into millions, be financially independent, and LIVE RICH!\n\nNEWSMAX: “If you want to pay NO TAXES get: BE SMART PAY ZERO TAXES: Use the Buy, Borrow, Die Strategy to Get Rich and Stay Rich! It’s possible!”",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Little Corner: Coloring Book for Adults and Teens, Super Cute Designs of Cozy, Hygge Spaces for Relaxation (Cozy Spaces Coloring)",
      "imagesCSV": "51GsjKjImxL.jpg,61n9TBKKDZL.jpg,51-QqilVHxL.jpg,518X2mjjA4L.jpg,51cJbe64cHL.jpg,51tEY7-GqjL.jpg,51CgSm7fjuL.jpg",
      "manufacturer": "Independently published",
      "asin": "B0D5HVSW5T",
      "brand": "QUIQEI",
      "features": [],
      "description": "If you enjoy decorating your own cozy room, this Little Corner Coloring Book is for you.\nThis book features 40 illustrations of places with super cute decor, such as a fully equipped kitchen, a dreamy bedroom, a wooden fireplace, and many more!\nIt's an ideal present for yourself, your family members, and your coloring buddy.\n\nThis “Little Corner Coloring Book” features: 40 hand-drawn pages ready for coloring. Large, bold, and easy designs for an enjoyable coloring experience. Single-sided pages to prevent bleed-through (if using markers, remember to place a protective sheet behind the page you're coloring) A convenient size of 8.5 x 8.5 inches for easy handling. High-resolution prints for clear, crisp images.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Hollywood Babylon: The Legendary Underground Classic of Hollywood's Darkest and Best Kept Secrets",
      "imagesCSV": "71YzA5IlHWL.jpg",
      "manufacturer": "Straight Arrow Books",
      "asin": "0440153255",
      "brand": "DELL",
      "features": [],
      "description": "“Picking through the slag heap of the Hollywood dream factory, [Kenneth] Anger has put together a truly prodigious anthology of star-studded scandal.”—The New York Times\n\nWelcome to Hollywood. Take a walk down “The Boulevard of Broken Dreams,” where starlets, sex goddesses, matinee idols, American aristocracy, and Mafia moguls meet. It’s a town made manic in its heyday by “joy powder” and cocaine-crazed comedies, seduced by vamping heroin heroines, shaken by Fatty Arbuckle’s orgiastic excesses and Errol Flynn’s amoral extravagances, stunned by Marilyn Monroe’s tragic suicide and Sharon Tate’s brutal murder.\n\nHere, as never revealed before, is the scalding reality behind the glittering façade: the true stories and darkest secrets behind the lurid headlines that have titillated the world and electrified the nation for decades.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Where's Bluey?: A Search-and-Find Book",
      "imagesCSV": "81EmtXw0mrL.jpg,51uT9KOCrIL.jpg",
      "manufacturer": "Penguin Young Readers Licenses",
      "asin": "0593385691",
      "brand": "Bluey",
      "features": [],
      "description": "Find Bluey and Bingo in this search-and-find activity book!\n\nHave you seen Bluey and Bingo? There are lots of other hidden items, too, so join the fun in this search-and-find book!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Nightingale: A Novel",
      "imagesCSV": "81OkWjcf4WL.jpg,5100roLyDuL.jpg",
      "manufacturer": "St. Martin's Griffin",
      "asin": "1250080401",
      "brand": "St. Martin's Griffin",
      "features": [],
      "description": "A #1 New York Times bestseller, Wall Street Journal Best Book of the Year, and soon to be a major motion picture, this unforgettable novel of love and strength in the face of war has enthralled a generation.\nFrance, 1939 - In the quiet village of Carriveau, Vianne Mauriac says goodbye to her husband, Antoine, as he heads for the Front. She doesn't believe that the Nazis will invade France … but invade they do, in droves of marching soldiers, in caravans of trucks and tanks, in planes that fill the skies and drop bombs upon the innocent. When a German captain requisitions Vianne's home, she and her daughter must live with the enemy or lose everything. Without food or money or hope, as danger escalates all around them, she is forced to make one impossible choice after another to keep her family alive.\nVianne's sister, Isabelle, is a rebellious eighteen-year-old girl, searching for purpose with all the reckless passion of youth. While thousands of Parisians march into the unknown terrors of war, she meets Gäetan, a partisan who believes the French can fight the Nazis from within France, and she falls in love as only the young can … completely. But when he betrays her, Isabelle joins the Resistance and never looks back, risking her life time and again to save others.\nWith courage, grace, and powerful insight, bestselling author Kristin Hannah captures the epic panorama of World War II and illuminates an intimate part of history seldom seen: the women's war. The Nightingale tells the stories of two sisters, separated by years and experience, by ideals, passion and circumstance, each embarking on her own dangerous path toward survival, love, and freedom in German-occupied, war-torn France―a heartbreakingly beautiful novel that celebrates the resilience of the human spirit and the durability of women. It is a novel for everyone, a novel for a lifetime.\nGoodreads Best Historical Novel of the Year • People's Choice Favorite Fiction Winner • #1 Indie Next Selection • A Buzzfeed and The Week Best Book of the Year\nPraise for The Nightingale:\n\"Haunting, action-packed, and compelling.\" ―Christina Baker Kline, #1 New York Times bestselling author\n\"Absolutely riveting!...Read this book.\" ―Dr. Miriam Klein Kassenoff, Director of the University of Miami Holocaust Teacher Institute\n\"Beautifully written and richly evocative.\" ―Sara Gruen, #1 New York Times bestselling author\n“A hauntingly rich WWII novel about courage, brutality, love, survival―and the essence of what makes us human.” --Family Circle\n“A heart-pounding story.” ―USA Today\n\"An enormous story. Richly satisfying. loved it,\" ―Anne Rice\n\"A respectful and absorbing page-turner.\" ―Kirkus Reviews\n\"Tender, compelling...a satisfying slice of life in Nazi-occupied France.\" ―Jewish Book Council\n“Expect to devour The Nightingale in as few sittings as possible; the high-stakes plot and lovable characters won’t allow any rest until all of their fates are known.” ―Shelf Awareness\n\"I loved The Nightingale.\" ―Lisa See, #1 New York Times bestselling author\n\"Powerful...an unforgettable portrait of love and war.\" ―People",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Little Blue Bunny: A Heartwarming Easter Basket Stuffer for Children (Little Heroes, Big Hearts)",
      "imagesCSV": "91C5+O2swfL.jpg,41KvAYS70mL.jpg,41zma8AcXYL.jpg,41-N0NC2zSL.jpg,41CH3kDN6mL.jpg,41k7lZO6PnL.jpg,41zjR+n2gjL.jpg,41RspPUS2vL.jpg,419wrBIpqNL.jpg",
      "manufacturer": "Sourcebooks Wonderland",
      "asin": "1728254485",
      "brand": "N/A",
      "features": [],
      "description": "Celebrate the timeless magic of childhood friends, love, and imagination in this heartfelt picture book for kids, the perfect Easter gift!\nFrom the very first moment little blue bunny met the little boy, they had a very special connection. Bunny's greatest wish was to have BIG adventures, to be important… to be special. But he believed that would have to wait until the little boy grew up and didn't need him anymore. But could this day be coming sooner than bunny wants?\nThis classic story of friendship shares the perfect reminder that greatest adventure in life to love and be loved in return. Filled with beautiful, full-color illustrations and a heartfelt message that readers of any age will love, this timeless story of a little boy and his blue plush bunny is one that will tug at the heartstrings and pull you back again and again.\nWhy readers love Little Blue Bunny: For fans of the New York Times and USA Today bestseller Little Red Sleigh Parents, grandparents, and caregivers will love reading this nostalgic inspirational book to kids Perfect Valentine's Day gift for ages 4-7, Easter basket stuffer for kids, birthday or graduation gift, or read aloud for any time of year! Screen-free fun for children\nAlso in the Little Heroes, Big Hearts series: Little Red Sleigh Little Yellow Bus",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Scholastic Flash Cards: Sight Words",
      "imagesCSV": "71HtAExOQjL.jpg,71PRj9wLNOL.jpg,61B5zCZeH5L.jpg,61lTr+fpqWL.jpg,81FOIcwZfqL.jpg,71Ehq8KIrIL.jpg,51mOUkn-Z3L.jpg,31qObtHCDmL.jpg",
      "manufacturer": "Scholastic Teaching Resources (Teaching Strategies)",
      "asin": "1338233580",
      "brand": "Scholastic",
      "features": [
        "54 total cards: Includes 50 sight word cards and 4 activity cards.",
        "First 100 Fry words: Essential for building reading fluency.",
        "Double-sided design: Maximizes learning with vibrant colors.",
        "At-home or classroom use: Perfect for any learning environment.",
        "Fun and engaging: Helps children master key vocabulary."
      ],
      "description": "Boost your child's reading skills with our vibrant sight words flash cards! Designed in four eye-catching colors, these double-sided cards feature the first 100 words from the Fry List, making them an essential resource for building reading fluency. With 54 cards in total—50 sight word cards and 4 engaging activity cards—your little ones will have fun while mastering key vocabulary. Perfect for at-home learning or classroom use, these flash cards provide a head start in reading that will last a lifetime! For grades PK-3.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Easter Eggstravaganza Mad Libs: World's Greatest Word Game",
      "imagesCSV": "818PqOiT44L.jpg",
      "manufacturer": "Mad Libs",
      "asin": "0843172525",
      "brand": "Penguin",
      "features": [],
      "description": "Mad Libs is the world’s greatest word game and a great gift or activity for anyone who likes to laugh! Write in the missing words on each page to create your own hilariously funny stories all about Easter.\n\nIt's hopping good fun for the whole NOUN! With 21 \"fill-in-the-blank\" stories about chocolate, Easter baskets, and the magic of springtime, there's something for everyone. Play alone, in a group, or with some-bunny you love. Mad Libs are a fun family activity recommended for ages 8 to NUMBER.\n\nEaster Eggstravaganza Mad Libs includes:\n\n- Silly stories: 21 \"fill-in-the-blank\" stories all about Easter fun!\n- Language arts practice: Mad Libs are a great way to build reading comprehension and grammar skills.\n- Fun With Friends: each story is a chance for friends to work together to create unique stories!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Build a Business You Love: Mastering the Five Stages of Business",
      "imagesCSV": "41SZHqHHYsL.jpg,5190WivGWhL.jpg",
      "manufacturer": "Ramsey Press",
      "asin": "B0D8BQWJVK",
      "brand": "N/A",
      "features": [],
      "description": "In Build a Business You Love, #1 New York Times bestselling author and Ramsey Solutions Founder and CEO, Dave Ramsey breaks down the system that took his business from a card table in his living room to a $250 million operation.\n\nBusiness leaders face all kinds of challenges and fears as they work to grow their business. Dave Ramsey gets it—because he’s been there. Over the past 30 years, he and his team have taken some right (and plenty of wrong) turns as they worked to build his one-man financial counseling business into Ramsey Solutions, a $250 million company with over 1,000 team members. Now, Dave is sharing what he’s learned from walking through three decades of business growth—so you can grow your business faster with fewer missteps.\nIn Build a Business You Love, Dave lays out the EntreLeadership System, the road map that takes the guesswork out of growth for business owners like you. Because after more than a decade of helping leaders grow their businesses—and through direct experience with his own company—Dave has found that there are five distinct stages of growth every business has to conquer to reach its potential: Stage 1: Treadmill Operator Stage 2: Pathfinder Stage 3: Trailblazer Stage 4: Peak Performer Stage 5: Legacy Builder\n\nThroughout the book, Dave breaks down each of the stages and their unique challenges in detail to help you solve the right problems, at the right time, in the right way. You’ll learn how to navigate everything business ownership throws at you—from hiring the right people, to finding and training leaders, to creating and operating a budget, to nailing down strategic plans that get results, and more.\nBuild a Business You Love is the essential guide for business owners who want to grow their business the right way and leave a legacy they’re proud of.\nGrab your copy and join the thousands of business owners who have transformed their business by learning to leverage the EntreLeadership System—the proven plan to help you grow yourself, lead your team, and scale your business.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Great Big Beautiful Life",
      "imagesCSV": "71bqwdPgGqL.jpg",
      "manufacturer": "Berkley",
      "asin": "059344129X",
      "brand": "N/A",
      "features": [],
      "description": "Two writers compete for the chance to tell the larger-than-life story of a woman with more than a couple of plot twists up her sleeve in this dazzling and sweeping novel from Emily Henry.\n\nNamed a Most Anticipated book by The New York Times ∙ Rolling Stone ∙ People ∙ USA Today ∙ Harper's Bazaar ∙ Marie Claire ∙ E! Online ∙ The New York Post ∙ Bustle ∙ Reader's Digest ∙ BBC ∙ PopSugar ∙ SheReads ∙ Paste ∙ and more!\n\nAlice Scott is an eternal optimist still dreaming of her big writing break. Hayden Anderson is a Pulitzer-prize winning human thundercloud. And they’re both on balmy Little Crescent Island for the same reason: to write the biography of a woman no one has seen in years—or at least to meet with the octogenarian who claims to be the Margaret Ives. Tragic heiress, former tabloid princess, and daughter of one of the most storied (and scandalous) families of the twentieth century.\n\nWhen Margaret invites them both for a one-month trial period, after which she’ll choose the person who’ll tell her story, there are three things keeping Alice’s head in the game.\n\nOne: Alice genuinely likes people, which means people usually like Alice—and she has a whole month to win the legendary woman over.\n\nTwo: She’s ready for this job and the chance to impress her perennially unimpressed family with a Serious Publication.\n\nThree: Hayden Anderson, who should have no reason to be concerned about losing this book, is glowering at her in a shaken-to-the core way that suggests he sees her as competition.\n\nBut the problem is, Margaret is only giving each of them pieces of her story. Pieces they can’t swap to put together because of an ironclad NDA and an inconvenient yearning pulsing between them every time they’re in the same room.\n\nAnd it’s becoming abundantly clear that their story—just like the tale Margaret’s spinning—could be a mystery, tragedy, or love ballad . . . depending on who’s telling it.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Easter Chunky Lift-a-Flap Board Book (Babies Love)",
      "imagesCSV": "815LMntpchL.jpg,71FVrncvF0L.jpg,719be4D28RL.jpg,61t-w4OcwbL.jpg,613TL+-eBFL.jpg,91JhSOToK0L.jpg,81iq9okZ-aL.jpg,71190DuAS0L.jpg,71LFSyYxa+L.jpg,51nlCmHJKLL.jpg,51C0rH-qkdL.jpg,51wt3u5lNaL.jpg,51Vrg2FGbcL.jpg,41Lq+GqrKRL.jpg,51MTomQo-iL.jpg",
      "manufacturer": "Cottage Door Press",
      "asin": "1680522868",
      "brand": "Cottage Door Press",
      "features": [
        "Supports language readiness",
        "Encourages hand-eye control",
        "Sintroduces Easter traditions"
      ],
      "description": "Introduce little ones to all things related to Easter and the spring season in this adorable lift-a-flap board book. Follow along as we celebrate with spring colors, get dressed for Easter Sunday with nice shoes and festive hats, and hunt for Easter eggs, while snacking on chocolate bunnies and jelly beans! Simple sentences in this sweet story reinforce future language structure and sturdy flaps help develop fine motor skills. Packed with cute illustrations of friends, animals, and the Easter bunny, this sturdy board book is a perfect gift for your baby and toddler, boy or girl.\nLooking for good Easter books or Easter gifts for kids? Add to your family's library with more board books from Cottage Door Press! Welcome to the world little one! Come explore Babies Love Easter board book filled with surprises. Perfect gift to include in Easter basket stuffers for boys and girls! Sturdy, thick board pages and durable flaps designed to withstand traditional wear and tear for curious little infants and toddlers Bright, cheerful illustrations and rhyming text in these sensory lift-a-flap books for little kids to keep them entertained and engaged Interactive elements encourage sensory exploration and help support the development of fine motor skills and hand-eye coordination in developing children Collect all the books in the Babies Love series. From colors and animals to first words and holidays, the Babies Love series is a great introduction to reading with cheerful, contemporary, and whimsical illustrations and sturdy, easy-to-lift flaps.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Abundance",
      "imagesCSV": "71dn+hvNIOL.jpg,41nEx1Py8QL.jpg",
      "manufacturer": "Avid Reader Press / Simon & Schuster",
      "asin": "1668023482",
      "brand": "N/A",
      "features": [],
      "description": "NEW YORK TIMES BESTSELLER\n\n“A terrific book...Powerful and persuasive.” —Fareed Zakaria\n\n“Spectacular…Offers a comprehensive indictment of the current problems and a clear path forward…Klein and Thompson usher in a mood shift. They inspire hope and enlarge the imagination.” —David Brooks, The New York Times\n\nFrom bestselling authors and journalistic titans Ezra Klein and Derek Thompson, Abundance is a once-in-a-generation, paradigm-shifting call to renew a politics of plenty, face up to the failures of liberal governance, and abandon the chosen scarcities that have deformed American life.\n\nTo trace the history of the twenty-first century so far is to trace a history of unaffordability and shortage. After years of refusing to build sufficient housing, America has a national housing crisis. After years of limiting immigration, we don’t have enough workers. Despite decades of being warned about the consequences of climate change, we haven’t built anything close to the clean-energy infrastructure we need. Ambitious public projects are finished late and over budget—if they are ever finished at all. The crisis that’s clicking into focus now has been building for decades—because we haven’t been building enough.\n\nAbundance explains that our problems today are not the results of yesteryear’s villains. Rather, one generation’s solutions have become the next generation’s problems. Rules and regulations designed to solve the problems of the 1970s often prevent urban-density and green-energy projects that would help solve the problems of the 2020s. Laws meant to ensure that government considers the consequences of its actions have made it too difficult for government to act consequentially. In the last few decades, our capacity to see problems has sharpened while our ability to solve them has diminished.\n\nProgress requires facing up to the institutions in life that are not working as they need to. It means, for liberals, recognizing when the government is failing. It means, for conservatives, recognizing when the government is needed. In a book exploring how we can move from a liberalism that not only protects and preserves but also builds, Klein and Thompson trace the political, economic, and cultural barriers to progress and propose a path toward a politics of abundance. At a time when movements of scarcity are gaining power in country after country, this is an answer that meets the challenges of the moment while grappling honestly with the fury so many rightfully feel.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Fight: Inside the Wildest Battle for the White House",
      "imagesCSV": "813JUieQiPL.jpg",
      "manufacturer": "William Morrow",
      "asin": "006343864X",
      "brand": "N/A",
      "features": [],
      "description": "INSTANT #1 NEW YORK TIMES BESTSELLER!\n\"Brutal\" —Huffington Post\n\"Scathing\" —New York Post\n“So many revelations.” —Joe Scarborough, co-host of MSNBC’s Morning Joe\n\"Bombshell.\" —Jesse Watters, host of FOX’s Jesse Watters Primetime\nThe authors of the #1 New York Times bestseller Shattered provide a revelatory, inside look at the Biden, Harris, and Trump camps during the 2024 battle for the White House, arguably the most consequential contest in American history.\nThe ride was so wild that it forced a sitting president to drop his re-election bid, a once and future president to survive felony convictions and a would-be assassin’s bullet, and a vice president, unexpectedly thrust into the arena, to mount an unprecedented 107-day campaign to lead the free world.\nFight is the backstage story of bloodsport politics in its rawest form—the clawing, backstabbing, and rabble-rousing that drove Donald Trump into the White House and Democrats into the wilderness. At every turn, the combatants went for the jugular, whether they were facing down rivals in the other party or their own.\nBestselling authors Jonathan Allen and Amie Parnes give readers their first graphic view of the characters, their motivations, and their innermost thoughts as they battled to claim the ultimate prize and define a political era. Based on real-time interviews with more than 150 insiders—from the Trump, Harris, and Biden inner circles, as well as party leaders and operatives—Fight delivers the vivid and stunning tale of an election unlike any other.\nIn the end, Trump overcame voters’ concerns about his personal flaws by tapping into a deep vein of dissatisfaction with the direction of the country. At the same time, Democrats struggled to connect with an electorate that felt gaslit by Biden’s insistence that he had delivered economic prosperity—and his pledge to be a “bridge” president. He tore his party asunder, leaving destroyed personal relationships in his wake, as he clung to power. And when he gave it up, he kneecapped Harris by demanding unprecedented loyalty from her.\nAs Allen and Parnes have done in the #1 New York Times bestseller Shattered and Lucky, they provide readers with a skeleton key to the rooms where it all happened, revealing a story more shocking than previously reported.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Pat the Bunny: The Classic Book for Babies and Toddlers (Touch-and-Feel)",
      "imagesCSV": "61CiHUOR1BL.jpg,51c2OJkeY+L.jpg,41i6k1TPo6L.jpg,41Unl9AEhSL.jpg,31bQ0yrDIrL.jpg",
      "manufacturer": "Golden Books",
      "asin": "0307120007",
      "brand": "Golden Books",
      "features": [
        "Pat the Bunny - Boardbook"
      ],
      "description": "NATIONAL BESTSELLER • The timeless children's classic full of interactive fun—a perfect gift for new babies and first birthdays.\n\nFor generations, Pat the Bunny has been creating special first-time moments between parents and their children. One of the best-selling children’s books of all time, this classic touch-and-feel book offers babies a playful and engaging experience, all the while creating cherished memories that will last a lifetime.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Wedding People: A Novel",
      "imagesCSV": "91EReeJwIjL.jpg",
      "manufacturer": "Henry Holt and Co.",
      "asin": "1250899575",
      "brand": "N/A",
      "features": [],
      "description": "A NEW YORK TIMES BESTSELLER\nA Today Show #ReadwithJenna Book Club Pick\n\nA propulsive and uncommonly wise novel about one unexpected wedding guest and the surprising people who help her start anew.\n\nIt’s a beautiful day in Newport, Rhode Island, when Phoebe Stone arrives at the grand Cornwall Inn wearing a green dress and gold heels, not a bag in sight, alone. She’s immediately mistaken by everyone in the lobby for one of the wedding people, but she’s actually the only guest at the Cornwall who isn’t here for the big event. Phoebe is here because she’s dreamed of coming for years―she hoped to shuck oysters and take sunset sails with her husband, only now she’s here without him, at rock bottom, and determined to have one last decadent splurge on herself. Meanwhile, the bride has accounted for every detail and every possible disaster the weekend might yield except for, well, Phoebe and Phoebe's plan―which makes it that much more surprising when the two women can’t stop confiding in each other.\n\nIn turns absurdly funny and devastatingly tender, Alison Espach’s The Wedding People is ultimately an incredibly nuanced and resonant look at the winding paths we can take to places we never imagined―and the chance encounters it sometimes takes to reroute us.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "So Easy So Good: Delicious Recipes and Expert Tips for Balanced Eating (A Cookbook)",
      "imagesCSV": "51js8GWufFL.jpg,31rRh-NEkRL.jpg,316+H-ppF3L.jpg,41ZeS3Nc4WL.jpg,41-oBkBtMwL.jpg,41VQV37r-NL.jpg,41jvtm5R7KL.jpg,51qScQAfHkL.jpg,41nc-sDiopL.jpg",
      "manufacturer": "S&S/Simon Element",
      "asin": "166803798X",
      "brand": "N/A",
      "features": [],
      "description": "With expert advice and flavorful recipes, dietitian and creator of Nutrition by Kylie transforms healthy eating into something simple and approachable—taking the stress out of nutrition and putting confidence in your hands.\n\nRegistered dietitian and social media star Kylie Sakaida, a.k.a. @NutritionbyKylie, knows how difficult it can be to keep track of the confusing and often conflicting information about nutrition we are barraged with online. Kylie began posting videos on social media to cut through the noise and offer easy-to-understand and relatable evidence-based advice. Now, millions of people trust and follow her for realistic nutrition tips and delicious recipes. In this beautiful, comprehensive cookbook, Kylie has collected her best nutrition tips along with both fan-favorite and brand-new recipes.\n\nWhether you want to change your eating habits and mindset or are just looking for a healthy dinner recipe, So Easy So Good has you covered. Kylie simplifies complex concepts through simple lists, charts, and sidebars. Her recipes and tips emphasize a healthy, balanced mix of protein, carbs, healthy fats, and fiber so you can feel nourished and satisfied. Many of Kylie’s recipes are inspired by the Asian flavors from her upbringing. Some recipes are designed to minimize prep time by using frozen veggies and nutrient-dense convenience foods, while others can be frozen in advance and reheated within minutes for a quick meal.\n\nSo Easy So Good is packed with simple, accessible, and nutritional advice throughout, but it’s recipes like Matcha Chia Parfaits, Sriracha Honey Tofu Bowls, Chicken Ranch Naan Pizzas, Thai Fish Curry, and even sweets like Tahini Chocolate Brownies, that will have you coming back to the book again and again.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "My First Easter! High Contrast Baby Book - 0-12 Months - White Easter pictures: 32+ Cute Black & White High Contrast Images To Develop Babies Eyesight ... Books for Infants. (Easter Basket Stuffers)",
      "imagesCSV": "51dLsfw-NfL.jpg,51hF2ot5JiL.jpg",
      "manufacturer": "Independently published",
      "asin": "B0BW2X99SC",
      "brand": "N/A",
      "features": [],
      "description": "🐣🐇🌷 Hippity-Hoppity Easter Fun for Babies! 🐇🐣🌸\nWelcome your little one to the joys of their first Easter with this adorable Easter-themed book! 🌼🐰🥕 Featuring high-contrast images specially designed for babies' developing vision, this board book is perfect for newborns and infants. From Easter bunnies and colorful eggs to cheerful chicks and spring flowers, each page celebrates the magic of Easter. With its durable design and vibrant, high-quality illustrations, this book is sure to become a cherished keepsake as your baby grows. Make your baby's first Easter extra special with this delightful board book! 🐣✨\nAbout this book: 🌸 Beautiful Illustrations: Features 33 unique, high-contrast Easter images, including bunnies, Easter eggs, hatching chicks, carrots, and more for endless creative fun. 🌼🐇 Perfect Size: Designed in an 8.5 x 8.5-inch format, ideal for little hands to hold and explore. Durable Design: Softcover with a glossy finish and sturdy paperback binding, making it easy to carry and perfect for little ones. Interactive Content: Includes charming icons like rabbit faces, hopping bunnies, baby chicks, Easter eggs, and spring-themed surprises. 🌷🐣 Perfect Easter Gift: A thoughtful and memorable gift for new moms, dads, and babies during their first Easter celebration.\nHop into the Easter spirit and create cherished memories with this delightful Easter board book for babies! 🐇✨",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Garden, the Curtain and the Cross: The true story of why Jesus died and rose again",
      "imagesCSV": "81g966PLz1L.jpg,51m6gJu3-EL.jpg,51bD5PpVnUL.jpg,51OzPD1HBIL.jpg,41MFm+6J+xL.jpg",
      "manufacturer": "The Good Book Company",
      "asin": "1784980129",
      "brand": "The Good Book Company",
      "features": [],
      "description": "Over 1 million of the Tales That Tell The Truth series have been sold!\nJourney from the Garden of Eden to God’s perfect new creation to understand why Jesus' death and resurrection are good news for us.\nThis beautiful hardback Bible storybook for 3-6 year olds takes children on a journey from the Garden of Eden to God’s perfect new creation. It is a gospel presentation that focuses on the significance of the temple curtain. God said “because of your sin you can’t come in”, but the moment the curtain tore in two, everything changed.\nChildren will learn why Jesus died and rose again and why that’s the best news ever.\nThis bestselling book, perfect for Easter, is written by Carl Laferton, who is also the author of God's Big Promises Bible Storybook, and serves as series editor of the God's Word for You series.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "By Heart: Recipes to Hold Near and Dear",
      "imagesCSV": "513fvKh-TnL.jpg,41J5O3xV3vL.jpg,417HrUJ2L-L.jpg,41heI9hbr0L.jpg,41ApghVbj3L.jpg,51pLhGJVn-L.jpg,41FfqhSKecL.jpg,41VuC8UkNIL.jpg,41t81+QTdXL.jpg,41YhQLWktSL.jpg,5111hDTWcHL.jpg,41Q6lheqKmL.jpg,41TW91h3gzL.jpg",
      "manufacturer": "DK",
      "asin": "0593842650",
      "brand": "N/A",
      "features": [],
      "description": "Learn to make elevated, professional-quality meals in your own kitchen with over 100 creative, seasonal recipes from Hailee Catalano\n\nGrowing up cooking the Sunday gravy, meatballs, and pasta alongside her Italian American grandmother, Hailee Catalano developed a huge passion for food. This passion led her to the Culinary Institute of America, and then to cooking in restaurants. But somewhere along the way, Hailee started to miss the home cooking that made her fall in love with food in the first place. Restaurants made it seem like beautifully made food was too difficult to recreate at home.\n\nIn By Heart, she presents over 100 restaurant-quality recipes designed to be made in your home kitchen. You'll find seasonal pastas (Pasta alla Norcina with Roasted Squash), veggie-forward recipes designed to make the most of your CSA box (Caponata with Dried Cherries and Green Olives), simple meat dishes (Roast Chicken with Red Wine Vinegar and Honey) breads (Hearty Seeded Rye Bread), butters (Calabrian Chile Honey Butter), condiments (Chicago-Style Fennel Giardiniera), perfect beach sandwiches (Brie and Butter Sandwich with Shallot-y Frisée), simple sweets (Malted Milk Butter Cookies), and so much more.\n\nInspired by her professional training and love of seasonal cooking, Hailee includes details on how to keep a calm kitchen, navigate a farmers market, make your own broths and the perfect sourdough loaf, and plan out a Friday Night Dinner menu. Carefully crafted from the heart, this is a book you'll return to again and again.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Brown Bear, Brown Bear, What Do You See?",
      "imagesCSV": "81kZ3Gl3WKL.jpg,51MDFBuL49L.jpg",
      "manufacturer": "Henry Holt Books for Young Readers",
      "asin": "0805047905",
      "brand": "Holtzbrinck Publishers",
      "features": [],
      "description": "A big happy frog, a plump purple cat, a handsome blue horse, and a soft yellow duck--all parade across the pages of this delightful book. Children will immediately respond to Eric Carle's flat, boldly colored collages. Combined with Bill Martin's singsong text, they create unforgettable images of these endearing animals.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Story of Jesus: A Christian Book for Kids (Little Golden Book)",
      "imagesCSV": "81HMxV+4dsL.jpg,614mu8LDopL.jpg",
      "manufacturer": "Golden Books",
      "asin": "0375839410",
      "brand": "Golden Books",
      "features": [],
      "description": "An introduction to Jesus for very young children -- a perfect gift for the holiday season!\n\nA gentle look at Jesus's birth, childhood, teachings, crucifixion, and resurrection. Written in a simple, warm style, with colorful illustrations that will captivate and inspire.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Housemaid's Secret",
      "imagesCSV": "81LZXcfKqJL.jpg",
      "manufacturer": "Bookouture",
      "asin": "0349132615",
      "brand": "Mobius",
      "features": [],
      "description": "As he continues showing me their incredible penthouse apartment, I have a terrible feeling about the woman behind closed doors. But I can't risk losing this job - not if I want to keep my darkest secret safe . . . It's hard to find an employer who doesn't ask too many questions about my past. So I thank my lucky stars that the Garricks miraculously give me a job, cleaning their stunning penthouse with views across the city and preparing fancy meals in their shiny kitchen. I can work here for a while, stay quiet until I get what I want. It's almost perfect. But I still haven't met Mrs Garrick, or seen inside the guest bedroom. I'm sure I hear her crying. I notice spots of blood around the neck of her white nightgowns when I'm doing laundry. And one day I can't help but knock on the door. When it gently swings open, what I see inside changes everything.... That's when I make a promise. After all, I've done this before. I can protect Mrs. Garrick while keeping my own secrets locked up safe. Douglas Garrick has done wrong. He is going to pay. It's simply a question of how far I'm willing to go.... An unbelievably twisty read that will have you glued to the pages late into the night. Anyone who loves The Woman in the Window, The Wife Between Us and The Girl on the Train will be completely hooked!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Good Night, God - Lift-a-Flap Board Book Gift for Easter Basket Stuffer, Christmas, Baptism, Birthdays Ages 1-5 (Little Sunbeams)",
      "imagesCSV": "81sBp2FrT7L.jpg,81TL8Zr4gyL.jpg,71g9G2uoPzL.jpg,71YTDs27GkL.jpg,71jrxtU3J8L.jpg,91LXhwpGhnL.jpg,61Y0E7wOmDL.jpg,81oVyz01A5L.jpg,617dGnEI+hL.jpg,41HtwYITpTL.jpg,41sYAdr3+LL.jpg,51phZ-DTwkL.jpg",
      "manufacturer": "Cottage Door Press",
      "asin": "1680523759",
      "brand": "Cottage Door Press",
      "features": [],
      "description": "Get ready for bed at the end of the day and don't forget the \"Good night\" message you would like to say! with this adorable lift-a-flap book! Enjoy a sweet, inspirational board book and lift each flap to uncover an adorable story about appreciating life's blessings. Say good night and thank you to God for everything from animals of all kinds and springtime breezes to frozen ponds to skate upon. This is a must-add to your family collection of religious board stories for young children alongside the Cottage Door Press children's Bible and more.\nLittle Sunbeams books offer little ones sweet reminders of God's blessings and love while encouraging thoughtfulness and gratitude. We believe there is a \"little light\" inside each of us that makes us special, and these stories encourage little ones to let their light shine! Look for additional titles in the Little Sunbeam series from Cottage Door Press.\n6 perfectly-sized, sturdy flaps are extra strong so babies and toddlers can open and close, over and over again. Chunky board books for babies have durable pages and flaps designed to withstand traditional wear and tear. Bright, cheerful illustrations in these sensory lift-a-flap books keep little kids entertained and engaged. Interactive elements encourage sensory exploration and help support the development of fine motor skills and hand-eye coordination in developing children. Perfect first book for your little one or any early reader you know!\nPraise for our Small Board Lift-a-Flap:\n\"The flaps are the sturdiest in the business and will likely survive vigorous play and exploration.\"―Kirkus Reviews, PBS Kids Fish!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Verity",
      "imagesCSV": "917iVfhEhxL.jpg",
      "manufacturer": "Grand Central Publishing",
      "asin": "1538724731",
      "brand": "Grand Central Publishing",
      "features": [],
      "description": "Whose truth is the lie? Stay up all night reading the sensational psychological thriller that has readers obsessed, from the #1 New York Times bestselling author of Too Late and It Ends With Us.\n\n#1 New York Times Bestseller · USA Today Bestseller · Globe and Mail Bestseller · Publishers Weekly Bestseller\n\nLowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.\n\nLowen arrives at the Crawford home, ready to sort through years of Verity’s notes and outlines, hoping to find enough material to get her started. What Lowen doesn’t expect to uncover in the chaotic office is an unfinished autobiography Verity never intended for anyone to read. Page after page of bone-chilling admissions, including Verity's recollection of the night her family was forever altered.\n\nLowen decides to keep the manuscript hidden from Jeremy, knowing its contents could devastate the already grieving father. But as Lowen’s feelings for Jeremy begin to intensify, she recognizes all the ways she could benefit if he were to read his wife’s words. After all, no matter how devoted Jeremy is to his injured wife, a truth this horrifying would make it impossible for him to continue loving her.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Little Blue Truck and Racer Red",
      "imagesCSV": "51yjWmkzbnL.jpg,417Dho2xQVL.jpg,41Z+-Zz5atL.jpg,41ngP5zYyBL.jpg,41DDFRLXJ+L.jpg",
      "manufacturer": "Clarion Books",
      "asin": "0063387840",
      "brand": "N/A",
      "features": [],
      "description": "The #1 bestselling Little Blue Truck meets a zippy red race car with a need for speed.\nLittle Blue Truck and good friend Toad are out for a drive when a flash of red whizzes by—then whizzes back to stop and say hi. Sleek and low, Racer Red is made for speed and loves to go fast! When she challenges Blue to a race, Blue knows that win or lose, it’s fun to try! Beep! Beep! Zooooom!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Women: A Novel",
      "imagesCSV": "913C+MR3S5L.jpg,51lxx68FRXL.jpg",
      "manufacturer": "St. Martin's Press",
      "asin": "1250178630",
      "brand": "St. Martin's Press",
      "features": [],
      "description": "A #1 bestseller on The New York Times, USA Today, Washington Post, and Los Angeles Times!\n\nFrom the celebrated author of The Nightingale and The Four Winds comes Kristin Hannah's The Women―at once an intimate portrait of coming of age in a dangerous time and an epic tale of a nation divided.\n\nWomen can be heroes. When twenty-year-old nursing student Frances “Frankie” McGrath hears these words, it is a revelation. Raised in the sun-drenched, idyllic world of Southern California and sheltered by her conservative parents, she has always prided herself on doing the right thing. But in 1965, the world is changing, and she suddenly dares to imagine a different future for herself. When her brother ships out to serve in Vietnam, she joins the Army Nurse Corps and follows his path.\n\nAs green and inexperienced as the men sent to Vietnam to fight, Frankie is over-whelmed by the chaos and destruction of war. Each day is a gamble of life and death, hope and betrayal; friendships run deep and can be shattered in an instant. In war, she meets―and becomes one of―the lucky, the brave, the broken, and the lost.\n\nBut war is just the beginning for Frankie and her veteran friends. The real battle lies in coming home to a changed and divided America, to angry protesters, and to a country that wants to forget Vietnam.\n\nThe Women is the story of one woman gone to war, but it shines a light on all women who put themselves in harm’s way and whose sacrifice and commitment to their country has too often been forgotten. A novel about deep friendships and bold patriotism, The Women is a richly drawn story with a memorable heroine whose idealism and courage under fire will come to define an era.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Guess How Much I Love You",
      "imagesCSV": "81l-BTxjabL.jpg,31bwLxqvnvL.jpg,41+Sjdhk3qL.jpg,41sAdmjOQwL.jpg",
      "manufacturer": "Candlewick",
      "asin": "1536210633",
      "brand": "Candlewick Press",
      "features": [],
      "description": "Children and parents worldwide have cherished the heartwarming tale of Little Nutbrown and Big Nutbrown Hare so much that it has become one of the most enduring bedtime classics of our time.\n\n\"I love you right up to the moon – AND BACK!\"\n\nSometimes, when you love someone very, very much, you want to find a way of describing how much you treasure them. But, as Little Nutbrown Hare and Big Nutbrown Hare discover, love is not an easy thing to measure! Sam McBratney’s timelessly endearing story, beautifully rendered in Anita Jeram’s exquisite watercolors, captures the deep and tender bond between parent and child. Guess How Much I Love You is one of the world’s best-loved picture books.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "My First Library: Boxset of 10 Board Books for Kids",
      "imagesCSV": "711c-uf6AFL.jpg,71q09Onn-sL.jpg,71ZZBeVh61L.jpg,61wpK+usbUL.jpg,71g4g060KpL.jpg,7171-nFNX9L.jpg,71VQLjPtfaL.jpg,81R7YvreZVL.jpg,71bmquJT8PL.jpg,5135V0qq6pL.jpg,51t+BfPyuHL.jpg,51+903ar19L.jpg,41+EGpDsj6L.jpg,51CAY2TogtL.jpg,41e5d2PacvL.jpg,41IkmZ-KE1L.jpg,31rzcg-nWNL.jpg,41JgJlqVlML.jpg,41k8msdzXFL.jpg,31f2zM9pFOL.jpg,31V6izNtDpL.jpg",
      "manufacturer": "Wonder House Books",
      "asin": "9387779262",
      "brand": "N/A",
      "features": [
        "Color: Multicolor",
        "has_fba_offer:"
      ],
      "description": "A collection of 10 well-researched board books to introduce a wide range of learning topics and everyday objects to the little scholars. The topics included in the set are - ABC, Numbers, Shapes, Colours, Wild Animals, Farm Animals and Pets, Birds, Fruits, Vegetables and Transport.\n\nThese beautiful picture books develops reading skills helps the child to build a vocabulary improves listening and observational skill have well-researched bright pictures covers comprehensive set of topics suited for a toddler",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Four Agreements: A Practical Guide to Personal Freedom (A Toltec Wisdom Book)",
      "imagesCSV": "91rR9gMuOVL.jpg",
      "manufacturer": "Amber-Allen Publishing",
      "asin": "1878424319",
      "brand": "Amber-Allen Publishing",
      "features": [
        "In an easy language",
        "Toltec Wisdom Book",
        "This product will be an excellent pick for you"
      ],
      "description": "The incredible New York Times and international bestselling guide to true happiness.\n\n“This book by don Miguel Ruiz, simple yet so powerful, has made a tremendous difference in how I think and act in every encounter.”—Oprah Winfrey\n\nA bestseller for over three decades, published in fifty-three languages wordwide, The Four Agreements, bestselling author don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, The Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love.\n\n“Don Miguel Ruiz’s book is a roadmap to enlightenment and freedom.”—Deepak Chopra, Author, The Seven Spiritual Laws of Success\n\n“An inspiring book with many great lessons.”—Wayne Dyer, Author, Real Magic\n\n“In the tradition of Castaneda, Ruiz distills essential Toltec wisdom, expressing with clarity and impeccability what it means for men and women to live as peaceful warriors in the modern world.”—Dan Millman, Author, Way of the Peaceful Warrior",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Iron Flame (The Empyrean, 2)",
      "imagesCSV": "917Bc9C1MlL.jpg",
      "manufacturer": "Entangled: Red Tower Books",
      "asin": "1649374178",
      "brand": "Kiligry",
      "features": [
        "Iron Flame: 2 (The Empyrean, 2)",
        "ABIS_BOOK"
      ],
      "description": "Discover the instant #1 New York Times bestseller! TV series now in development at MGM Amazon Studios with Michael B. Jordan’s Outlier Society.\n\nAccolades for Fourth Wing\nAmazon Best Books of the Year, #4 • Apple Best Books of the Year 2023 • Barnes & Noble Best Fantasy Book of 2023 (Fourth Wing and Iron Flame) • NPR “Books We Love” 2023 • Audible Best Books of 2023 • Hudson Book of the Year • Google Play Best Books of 2023 • Indigo Best Books of 2023 • Waterstones Book of the Year finalist • Goodreads Choice Award, semi-finalist • Newsweek Staffers’ Favorite Books of 2023 • Paste Magazine's Best Books of 2023\n\n“The first year is when some of us lose our lives. The second year is when the rest of us lose our humanity.” ―Xaden Riorson\n\nEveryone expected Violet Sorrengail to die during her first year at Basgiath War College―Violet included. But Threshing was only the first impossible test meant to weed out the weak-willed, the unworthy, and the unlucky.\n\nNow the real training begins, and Violet’s already wondering how she’ll get through. It’s not just that it’s grueling and maliciously brutal, or even that it’s designed to stretch the riders’ capacity for pain beyond endurance. It’s the new vice commandant, who’s made it his personal mission to teach Violet exactly how powerless she is–unless she betrays the man she loves.\n\nAlthough Violet’s body might be weaker and frailer than everyone else’s, she still has her wits―and a will of iron. And leadership is forgetting the most important lesson Basgiath has taught her: Dragon riders make their own rules.\n\nBut a determination to survive won’t be enough this year.\n\nBecause Violet knows the real secret hidden for centuries at Basgiath War College―and nothing, not even dragon fire, may be enough to save them in the end.\n\nThe Empyrean series is best enjoyed in order.\nReading Order:\nBook #1 Fourth Wing\nBook #2 Iron Flame",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Wild and Wrangled: A Rebel Blue Ranch Novel",
      "imagesCSV": "A12mL-BdUQL.jpg",
      "manufacturer": "Dial Press Trade Paperback",
      "asin": "0593732472",
      "brand": "N/A",
      "features": [],
      "description": "She’s the one that got away. He’s the one that never let her go.\n\nFrom the bestselling author of Done and Dusted and Swift and Saddled, the next book in the Rebel Blue Ranch series, a small-town romance in which past lovers get a second chance to rediscover what they lost\n\n“The perfect farewell . . . I dare you to get to the last page without turning right back around to walk through the gates of Rebel Blue all over again. I’ll see you there.”—Jessica Joyce, USA Today bestselling author of The Ex Vows\n\nCamille Ashwood had always loved a plan. Her latest was her best yet. She was going to get married so she could secure her daughter’s future, get her overbearing parents off her back, and finally start building her own life in small-town Meadowlark, Wyoming. Easy, right?\n\nBut when her groom doesn’t show up to the wedding, Cam’s life is turned upside down—she doesn’t even have a place to live. That is until she finds out the house she’s loved since high school is available to rent. There’s only one problem: the neighbor.\n\nDusty Tucker has spent nearly all of his adult life running. Running from what, though? More like who: Cam Ashwood. But ever since he returned home last year, the girl who was his first, well, everything has become a woman seemingly determined to keep him at arm’s length. And he was okay with that—at least, that’s what he kept telling himself. She was getting married, after all. But now she’s single and living next door. Dusty wants to show her that they can be friends, and that he can stay put.\n\nDespite her best attempts to stay far away from Dusty Tucker, Cam realizes that being close to him is like slipping into her favorite jeans. Easy. Comfortable. That is until past wounds start to open and feelings—both old and new—wreak havoc. Nearly ten years after they first met, Dusty and Cam begin to wonder if their first love can also be their last. And this time, will it be forever?",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "How to Catch a Dinosaur",
      "imagesCSV": "91jwRAg09EL.jpg,51DPlhRSyjL.jpg,51svu+S7VRL.jpg,51VekXothtL.jpg,514D1fIEuqL.jpg,51RjeIK1a7L.jpg,61WJtqS2sxL.jpg",
      "manufacturer": "Sourcebooks Wonderland",
      "asin": "1492680524",
      "brand": "Sourcebooks Wonderland",
      "features": [],
      "description": "From the New York Times and USA Today bestselling team comes a dinomite How to Catch adventure sure to delight any dinosaur fan, the perfect Easter basket stuffer!\nDo dinosaurs still walk among us? Sure, no one has seen one, but if alligators, whales, and even birds still exist, then dinosaurs must still exist, right? Join the daring How to Catch Kids as they try to wrangle a dinosaur in time for the school science fair and prove they're still around! Parents, young readers, dinosaur lovers, and educators alike will roar with laughter in this dinosaur picture book that blends STEAM concepts with hilarity and clever chaos. Do YOU have what it takes to pluck a prehistoric pal? Perfect for kids ages 4-10, this fun story makes a great birthday and back to school gift, stocking and basket stuffer, or read aloud for any occasion!\nCan you catch a dinosaur and prove they're still around?\nUse your brain and set your traps to get that dino found!\nAlso in the How to Catch Series: How to Catch a Unicorn How to Catch a Mermaid How to Catch a Dragon How to Catch a Monster How to Catch an Loveosaurus and more!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Dog Man: The Scarlet Shedder: A Graphic Novel (Dog Man #12): From the Creator of Captain Underpants",
      "imagesCSV": "71LTi6b92kL.jpg,71UdHGwwFYL.jpg,41wGOhvbapL.jpg",
      "manufacturer": "Graphix",
      "asin": "1338896431",
      "brand": "Scholastic",
      "features": [],
      "description": "Our canine superhero returns in DOG MAN: THE SCARLET SHEDDER, the suspenseful and hilarious twelfth graphic novel in the #1 worldwide bestselling series by award-winning author and illustrator Dav Pilkey!\n\nP.U.! Dog Man got sprayed by a skunk! After being dunked in tomato juice, the stink is gone but the scarlet red color remains. Now exiled, this spunky superhero must struggle to save the citizens who shunned him! Will the ends justify the means for Petey, who's reluctantly pulled back into a life of crime in order to help Dog Man? And who will step forward when an all-new, never-before-seen villain unleashes an army of A.I. robots?\nThe fun and creativity continue with Dog Man with Love: The Official Coloring Book. And for more heartfelt graphic novel adventures, join Flippy and Li'l Petey in the Cat Kid Comic Club series. And don't forget the series that started it all: Captain Underpants!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "Bluey: Hooray, It's Easter!: A Lift-the-Flap Book",
      "imagesCSV": "81-t7hNg9ZL.jpg,51N0iIZpGvL.jpg,41zFRF0Ks7L.jpg,41OE5X4Wn+L.jpg,51RHsk6he8L.jpg",
      "manufacturer": "Penguin Young Readers Licenses",
      "asin": "0593750845",
      "brand": "Penguin Young Readers Group",
      "features": [],
      "description": "Help Bluey and Bingo find their Easter eggs in this sturdy lift-the-flap board book! Based on the wildly successful animated series Bluey, as seen on Disney+\n\nBluey and Bingo go on an egg hunt by following clues the Easter bunny left behind. Will they find their Easter eggs? This lift-the-flap board book is perfect for Bluey fans!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "How to Catch the Easter Bunny",
      "imagesCSV": "51WYea5rt3L.jpg,411G8iibTPL.jpg,41kbjo8XHaL.jpg",
      "manufacturer": "Sourcebooks Wonderland",
      "asin": "149263817X",
      "brand": "DK",
      "features": [
        "111"
      ],
      "description": "The New York Times and USA Today Bestseller! The best Easter basket stuffer and fun spring picture book for kids!\nFinding eggs is easy, but can YOU catch the Easter Bunny in action this year? He has a basket full of treats and tricks for staying hidden―plus that bunny hippity hops with lightning speed! Start a new tradition with this bright and funny children's Easter book and get inspired to build STEAM traps of your own to pair with the readaloud! Educators, families, and children will love this wonderfully creative opportunity to have fun and celebrate the holiday together.\nI've been working long and hard\nwith all my peeps and crew.\nWe've made the eggs, and now I'm here\nto bring them all to you!\nLooking for easy Easter basket stuffers? Look no further than the complete How to Catch series!\nAlso in the How to Catch Series: How to Catch a Unicorn How to Catch an Elf How to Catch a Turkey How to Catch a Leprechaun How to Catch a Monster and more!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "I Spy Easter Eggs: Find the Easter Bunny's Hidden Eggs and Become the Easter Hero! A Cute Easter Basket Stuffer for Toddlers 2-5 (I Spy Books for Toddlers)",
      "imagesCSV": "51ZTJ2-JcKL.jpg,61ICa0y0yML.jpg,51e46zlrHuL.jpg,51dGpsnkJbL.jpg,514FxA3KxcL.jpg,51dLQyjsvlL.jpg,51wznoSmIRL.jpg",
      "manufacturer": "TG Edition",
      "asin": "B0CTLJ5XSY",
      "brand": "S·WONIU",
      "features": [],
      "description": "🚨 Alert: The Easter Eggs are Gone! Is Your Child Ready to Find Them? 🐰🥚\nIt's time to join the Easter Bunny on a quest to find the lost Easter eggs and bring the joy of Easter back to everyone! 🐇🌸 Watch your child become the hero, finding hidden gifts in lots of engaging I Spy riddles. 🔍🥚 Why Choose Our I Spy Easter Book? 🎁 Perfect Easter Basket Stuffer: Looking for a unique Easter Basket Stuffer? Look no further! This I Spy book is ideal for making your child's Easter Basket special. 🐣 🐰 Create Lasting Memories: Watch your child's face light up as they help the Easter Bunny and save the day, creating wonderful memories. 🎨 High Replay Value: Highly detailed I Spy images and free bonus images for coloring ensure lasting fun for ages 2-5. 👪 Quality Family Time: This book offers great fun for the entire family and a great opportunity to spend quality time together. 🎯 Playful Learning: Playfully boost your child's concentration and attention skills with our colorful, kid-friendly picture riddles. No reading is required!\n\nThis isn't just another I Spy book – it's a cute and unique Easter journey across 40 vibrant pages, with your child in the leading role. 🌈📚 Don't miss out on this season's most exciting Easter adventure. 🌷 Click \"Buy Now\" in the top-right corner and look forward to the radiant eyes of your little Easter hero!",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    },
    {
      "title": "The Choi of Cooking: Flavor-Packed, Rule-Breaking Recipes for a Delicious Life: A Cookbook",
      "imagesCSV": "51sUv0eEO3L.jpg,41f6UdRyE4L.jpg,41AS0S0VMVL.jpg,511uhTBryEL.jpg,41rDXDlotyL.jpg,41r1RPF59NL.jpg,41cNLBTfR+L.jpg,51oPkuu-hUL.jpg,41QF+9cbBTL.jpg",
      "manufacturer": "Clarkson Potter",
      "asin": "0593579259",
      "brand": "N/A",
      "features": [],
      "description": "Culinary icon, founder of the Kogi food truck, New York Times bestselling author of L.A. Son, and star of Netflix's The Chef Show shares 100 flavor-packed recipes that empower you to eat healthy—or, at least, healthier—without ditching your go-to favorites.\n\nBuilt on a foundation of balance and compassion, The Choi of Cooking is Roy Choi’s magnum opus, reflecting his personal journey of cooking, living, and learning from mistakes. When Choi realized that falling victim to his greasy cravings was not sustainable, he began to eat more nutritious foods—but he did it his way, to build a more realistic lifestyle not based on extreme dieting or deprivation. This equates to vegetable-forward recipes, with plenty of pit stops of comfort along the way, and tons of flavors layered in every single bite.\n\nThe Choi of Cooking focuses on foods that fuel your body, and Choi meets readers wherever they are, recognizing that eating healthy isn’t all or nothing. Yes, that Kimchi Philly Cheesesteak recipe is real, and exactly as good as it sounds. But Choi also can make vegetables the star of the meal with Calabrian Chile Broccoli Rabe and Roasted Cauliflower Steaks with Harissa and Garlic Herbed Butter. And there are comforting, naturally vegetable-heavy rice and noodle bowls like Cold Bibim Noodle “Salad” and Veggie on the Lo Mein Spaghetti. Since this book is about taking steps, not leaps, there’s also plenty of inspiration for when you’re craving something indulgent, like Crispy Mashed Potatoes, but with \"Power Up\" modifications to make it healthier when you're ready.\n\nReaching for healthier foods is like flexing a muscle, and the work begins with having the confidence to cook at all. To encourage readers to take those first steps in the kitchen, Choi shares his culinary philosophy, including bits of wisdom and stories that expand on his approach to food. The Choi of Cooking is more than a collection of recipes; it’s a guide to creating a more balanced life.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Books",
      "categoryId": 283155
    }
  ]
}