{
  "productDetails": [
    {
      "title": "MedPride Powder-Free Nitrile Exam Gloves (Small (Pack of 200))",
      "imagesCSV": "51VkZGoJfgL.jpg",
      "manufacturer": "MED PRIDE",
      "asin": "B0CW7GNQHC",
      "brand": "MED PRIDE",
      "features": [
        "The information below is per-pack only",
        "The ideal solution for individuals sensitive to natural rubber latex and donning powder.",
        "Comfortable fit with textured fingertips for excellent tactile sensitivity.",
        "Extraordinary strength, stretchable durability and puncture resistance with premium iris blue color.",
        "Commonly used by law enforcement professionals, tattoo artists, physicians and first responders.",
        "Features smooth external finish and beaded cuff for extra durability."
      ],
      "description": "N/A",
      "parentTitle": "MedPride Powder-Free Nitrile Exam Gloves, Case/1000, 100 Count (Pack of 10)",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Supmedic Medical Nitrile Exam Gloves, Latex-Free, Powder-Free, Food Safe, Cooking Food Prep, Disposable Gloves, Blue, 100 Pcs (Medium)",
      "imagesCSV": "81FCZUMe5vL.jpg,71E7SlvqgRL.jpg,71fe77GH3zL.jpg,71ELnIxal8L.jpg,71gb53s1k2L.jpg,81zz5xB2iIL.jpg,71SbUj0r58L.jpg,81+A8BupgtL.jpg,71g189bUoPL.jpg",
      "manufacturer": "Supmedic",
      "asin": "B0C9SBFGZR",
      "brand": "Supmedic",
      "features": [
        "MEDICAL-GRADE 3.5 MIL - Supmedic nitrile gloves deliver hospital-level barrier & tactile feel - 40 % thicker than typical food gloves.",
        "ALLERGY SAFE – 100% Powder-free & Latex-free gloves eliminates common allergies; skin-friendly material passes EN455 irritation testing for worry-free wear on sensitive hands.",
        "TEXTURED GRIP – Micro-roughened fingertips plus smooth palms keep a confident hold on instruments, wet dishes or oily parts without sacrificing dexterity.",
        "VERSATILE PACK – 100 ambidextrous gloves dispense one-handed from the top-load box; perfect for clinics, dentistry, food prep, cleaning, auto repair, beauty salons, pet care and more.",
        "SUPPLIER-DIRECT VALUE - Produced in Supmedic's facility and Prime-fulfilled for fastdelivery; upgrade to 100 or 1000 count cases and save up to 40 % per glove."
      ],
      "description": "N/A",
      "parentTitle": "Supmedic 3.5 Mil Nitrile Exam Gloves, 100 Count - Powder-Free Latex-Free Disposable Glove for Medical Cooking Food Prep, Blue",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Caring Nitrile Exam Gloves (100ct), Powder Free and Not Made with Natural Rubber Latex, Gloves for Medical Use, Cleaning, Food Prep and More, Small",
      "imagesCSV": "51he2K5fNFL.jpg,61X8n9AdjrL.jpg,61XzobS8JNL.jpg,616PP+cWUhL.jpg,61rFeYdjrLL.jpg,61xlURZmOfL.jpg",
      "manufacturer": "N/A",
      "asin": "B0C95GR68Y",
      "brand": "Caring",
      "features": [
        "DISPOSABLE MEDICAL EXAM GRADE GLOVES - These single-use gloves provide the perfect protection from the exam room to your home, and anywhere else! Heavy-duty protection for any type of situation.",
        "DURABLE NITRILE MATERIAL - Quality nitrile material provides a trusted barrier, ensuring the glove won't easily tear. Not made with natural rubber latex and powder-free for ultimate comfort.",
        "TEXTURED FINGERTIPS AND AMBIDEXTROUS - Great tactile sensitivity, but still thick for extra protection. Great grip allows you to handle the smallest of items and are touch screen compatible. Ambidextrous gloves fit comfortably on either hand.",
        "LARGE PACK COUNT - 100 gloves per box ensure you have enough gloves for any task - medical care, first aid, crafts food prep and more!",
        "CHEMICAL RESISTANT* - Meets both ASTM D6798-05 and USP 800 Personal Protection Equipment requirement for use of chemotherapy gloves when handling hazardous drugs*"
      ],
      "description": "N/A",
      "parentTitle": "Caring Nitrile Exam Gloves, Blue, Powder-Free, Disposable Gloves for Medical Care, First Aid, Cleaning, Food Prep",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Molly's Suds Dishwasher Pods | Clean Dishwasher Detergent, Cuts Grease & Rinses Clean (Residue-Free) for Sparkling Dishes | 60 Auto-Release Tabs (Citrus)",
      "imagesCSV": "61D7giZFqUL.jpg,614jctOU90L.jpg,617b2Y6CiML.jpg,61ruUP6nlmL.jpg,61PSDMc8Q2L.jpg,61mksggqRvL.jpg,61g0dbwqbWL.jpg,61aKcW1ISIL.jpg",
      "manufacturer": "Molly's Suds",
      "asin": "B0B1PKLPHG",
      "brand": "Molly's Suds",
      "features": [
        "SPARKLING CLEAN WITHOUT HARSH CHEMICALS: Molly’s Suds Dishwasher Detergent Pods cut through grease & stuck-on food stains to leave dishes sparking with zero residue, streaks, or other mineral build-up. Simple and effective, Molly’s Suds products are free from ethoxylates and certified cruelty-free by Leaping Bunny.",
        "CONVENIENT & EASY TO USE: A single auto-release pod works to clean 1 full load of dishes. Safe for use on glassware, porcelain, stainless steel, pots & pans, baby bottles and more! Simply rinse dishes with hot water prior to loading in your dishwasher (works with built-in, portable & drawer styles), add pod, select your preferred wash cycle and let Molly’s Suds do the hard work!",
        "MOM APPROVED: Developed by a pediatric nurse & mom with simple ingredients that really work. Created for those with chemical sensitivities and allergies in mind. Cleaner dishes, cleaner environment!",
        "POWERFUL YET GENTLE: Low sudsing formula contains active enzymes to dissolve food, grease & grime without the need for harsh chemicals or any rinse aids. Works well on all stain types including dried-on food, coffee & tea stains, even red wine spots! Effective with both hard and soft water.",
        "WHAT’S INCLUDED: One 60 count bag of Dishwasher Detergent Pods. Free of harsh synthetic fragrances, dyes, and other harmful chemicals such as ethoxylates."
      ],
      "description": "N/A",
      "parentTitle": "Molly's Suds Dishwasher Detergent Gel | Natural Dishwasher Detergent, Cuts Grease & Rinses Clean (Residue-Free) for Sparkling Dishes",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Command 20 lb XL Heavyweight Picture Hanging Strips 16 Pairs (32 Command Strips), Damage Free Hanging Picture Hangers, Heavy Duty Wall Hanging Strips for Home Decor, White Adhesive Strips",
      "imagesCSV": "8172RgAY+DL.jpg,71P5pCbBMOL.jpg,71Q239Ba0cL.jpg,81K4GuTBsBL.jpg,71UGVpVbn5L.jpg,81-4iYVNBgL.jpg,71lsChBsECL.jpg,71Etw2dB-rL.jpg",
      "manufacturer": "3M",
      "asin": "B0B3SR5M71",
      "brand": "Command",
      "features": [
        "INCLUDES - 16 Pairs of X-Large, White Command Heavyweight Picture Hanging Strips (32 Strips total); 4 XL strips holds 20 lbs. Max frame size 24 in. x 36 in",
        "WORKS ON A VARIETY OF SMOOTH SURFACES: X-large wall hanging strips bond to a variety of smooth surfaces that include painted walls, painted cinderblock and concrete surfaces for damage free hanging",
        "SURFACE PREP: Clean the desired surface with rubbing alcohol to remove grime and dust to allow the no damage wall hangers to bond to the surface; the indoor temperature must be between 50 degrees Fahrenheit and 105 degrees Fahrenheit",
        "USAGE TIPS: Wait seven days after painting before using the Command Picture Hangers to allow paint to cure; do not hang over beds or on wallpaper; do not use the wall hanging strips to hang valuable items",
        "EASY CLEAN REMOVAL: Lightly hold the top of the removable adhesive strips and slowly pull straight down towards the floor to remove and prevent damage of walls and surfaces",
        "STRONG DAMAGE FREE HANGING STRIPS: Our STRONGEST HOLD with 40% more adhesive holding power compared to Command Large Picture Hanging Strips for hanging large wall art, big mirrors, wall clocks, heavy duty picture frames, and more"
      ],
      "description": "Command White 20 lb XL Heavyweight Picture Hanging Strips let you decorate how you want, when you want, without damaging your walls and surfaces. A great home improvement item, these picture hangers stick on a variety of smooth surfaces without leaving holes, marks or sticky residue. Use these wall hanging strips to hang heavy duty picture frames, large wall art, big mirrors, wall clocks, signs, dry erase boards, holiday decorations, and other home decor. XL picture hanging strips bond to a variety of smooth surfaces that include painted walls, painted cinderblock and concrete surfaces for damage free hanging. Perfect for home renovators and college students, use these Command Picture Hanging Strips in your home, office or dorm room to elevate the appearance of your living or working space without tools. Directions are included; follow the directions closely to use the 3M Wall Hanging Strips as intended. A clever decorating solution that doesn’t damage surfaces, these wall hanger strips will help you fearlessly change your space. One package contains sixteen pairs of heavy duty x-large white picture hanging strips. Sixteen pairs (thirty-two wall hanger strips) holds up to 20 pounds with a maximum frame size of 24 x 36 inches. Decorate, organize and celebrate damage-free with Command.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "MED Pride NitriPride Nitrile-Vinyl Blend Exam Gloves, Medium 1000 - Powder Free, Latex Free & Rubber Free - Single Use Non-Sterile Protective Gloves for Medical Use, Cooking, Cleaning & More",
      "imagesCSV": "7184phtOXlL.jpg,71rBq2LpmwL.jpg,71apm4WO+HL.jpg,81+vhcmB-UL.jpg,81oVFikzLgL.jpg",
      "manufacturer": "Shield Line",
      "asin": "B08Y99Q8R7",
      "brand": "MED PRIDE",
      "features": [
        "100% FREE OF LATEX, RUBBER, POWDER, PROTEIN: Protect your hands from any nasty bacteria with the most skin-friendly vinyl single use gloves. Completely Powder, Natural Latex, Rubber & Protein Free, these multipurpose gloves are perfect for an array of uses without causing the slightest discomfort. A safe choice even for people with skin sensitivities or those allergic to rubber and latex.",
        "EXCELLENT QUALITY DURABLE NITRIPRIDE VINYL – NITRILE BLEND GLOVES: Made of the highest quality vinyl and Nitrile materials, the Medpride latex-free gloves are extra durable yet comfortable to your skin. Stronger and thicker than regular nitrile gloves, they offer improved tactile sensitivity and work great for both commercial or industrial use!",
        "AMBIDEXTROUS GLOVES – BULK VALUE OF 1000: Form fitting with an ambidextrous design, these medium single-use gloves are extremely easy to put on and remove without taking a toll on your dexterity. Coming in a great value-pack of 100 gloves, in a handy dispenser box for easy use and storage, you will always have access to a fresh pair of protective gloves!",
        "ENDLESS USES FOR MEDICAL PROFESSIONALS & BEYOND: The medical quality exam gloves are great for doctors, medical experts, nurses, dentists, caretakers, veterinarians or any other health professional. Practical and versatile, they can be used for cooking and food prep services, pedicure, painting, cleaning and more. Plus, they double as protective gloves to safeguard your hands from common bacteria.",
        "ORDER WITH PEACE OF MIND: Medpride is your trusted supplier of effective, top quality medical products that you can count on to equip your personal medical kit. Backed by a 30-Day Money Back Guarantee, you have every good reason to choose the Medpride for all your at-home medical supplies!"
      ],
      "description": "N/A",
      "parentTitle": "Medpride NitriPride Vinyl-Nitrile Blend Exam Gloves - Powder Free, Latex Free & Rubber Free - Single Use Non-Sterile Protective Gloves for Medical Use, Cooking, Cleaning & More",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "MedPride Powder-Free Nitrile Exam Gloves, Large, Large (Pack of 100)",
      "imagesCSV": "51X6FbyYCKL.jpg,81Nn3Qwv3JL.jpg,81KmaDKHBxL.jpg,815jYa9kVnL.jpg,81cFsxctKRL.jpg,81nUM1iBy1L.jpg,81dw1JzU6oL.jpg",
      "manufacturer": "MED PRIDE",
      "asin": "B00GS8VGP6",
      "brand": "MED PRIDE",
      "features": [
        "MEDICAL-GRADE, PUNCTURE-RESISTANT NITRILE GLOVES: These premium medical examination gloves are made of great quality nitrile that is proven to be more resistant and durable than latex or any other type of gloves. Waterproof and puncture-resistant, they can fully shield your hands from needles, drugs, blood or any other potential threat so you can examine your patients with peace of mind.",
        "THE MOST PROTECTIVE EXAM GLOVES FOR ANY MEDICAL USE: Our single-use, heavy-duty disposable nitrile gloves feature textured fingerprints for excellent tactile sensitivity. Ideal for anyone working in the healthcare field including: doctors, nurses, paramedics, first-aiders, dentists, at-home caregivers and even aestheticians and tattoo artists. Great for food prep, professional food services, labs, factories, cleaning and so much more.",
        "LATEX & POWDER-FREE FOR IRRITATION-FREE WEAR: These non-sterile safety gloves feature a latex and powder free synthesis to provide unparalleled comfort even after many hours of use. While most people are easily irritated by latex and powder, our skin-friendly hospital gloves get the job done without causing any discomfort. Suitable even for people prone to skin sensitivities.",
        "MANY SIZES TO CHOOSE FROM | YOUR SATISFACTION IS GUARANTEED: Available in 4 different sizes [Small, Medium, Large and Extra Large], and a great value pack [Box of 100 disposable, latex-free gloves], you can definitely find the perfect match for all your needs. Backed up by an Unconditional Money Back Satisfaction Guarantee, you can order your protective gloves today completely risk-free!",
        "ORDER WITH PEACE OF MIND: Medpride is your trusted supplier of effective, top quality medical products that you can count on to equip your personal or professional medical kit. Backed by a 30-Day Money Back Guarantee, you have every good reason to choose Medpride for all your personal care supplies!"
      ],
      "description": "N/A",
      "parentTitle": "MedPride Powder-Free Nitrile Exam Gloves, Case/1000, 100 Count (Pack of 10)",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Supmedic Medical Nitrile Exam Gloves, Latex-Free, Powder-Free, Food Safe, Cooking Food Prep, Disposable Gloves, Blue, 100 Pcs (Medium)",
      "imagesCSV": "81FCZUMe5vL.jpg,71E7SlvqgRL.jpg,71fe77GH3zL.jpg,71ELnIxal8L.jpg,71gb53s1k2L.jpg,81zz5xB2iIL.jpg,71SbUj0r58L.jpg,81+A8BupgtL.jpg,71g189bUoPL.jpg",
      "manufacturer": "Supmedic",
      "asin": "B0C9SBFGZR",
      "brand": "Supmedic",
      "features": [
        "MEDICAL-GRADE 3.5 MIL - Supmedic nitrile gloves deliver hospital-level barrier & tactile feel - 40 % thicker than typical food gloves.",
        "ALLERGY SAFE – 100% Powder-free & Latex-free gloves eliminates common allergies; skin-friendly material passes EN455 irritation testing for worry-free wear on sensitive hands.",
        "TEXTURED GRIP – Micro-roughened fingertips plus smooth palms keep a confident hold on instruments, wet dishes or oily parts without sacrificing dexterity.",
        "VERSATILE PACK – 100 ambidextrous gloves dispense one-handed from the top-load box; perfect for clinics, dentistry, food prep, cleaning, auto repair, beauty salons, pet care and more.",
        "SUPPLIER-DIRECT VALUE - Produced in Supmedic's facility and Prime-fulfilled for fastdelivery; upgrade to 100 or 1000 count cases and save up to 40 % per glove."
      ],
      "description": "N/A",
      "parentTitle": "Supmedic 3.5 Mil Nitrile Exam Gloves, 100 Count - Powder-Free Latex-Free Disposable Glove for Medical Cooking Food Prep, Blue",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Caring Nitrile Exam Gloves (100ct), Powder Free and Not Made with Natural Rubber Latex, Gloves for Medical Use, Cleaning, Food Prep and More, Small",
      "imagesCSV": "51he2K5fNFL.jpg,61X8n9AdjrL.jpg,61XzobS8JNL.jpg,616PP+cWUhL.jpg,61rFeYdjrLL.jpg,61xlURZmOfL.jpg",
      "manufacturer": "N/A",
      "asin": "B0C95GR68Y",
      "brand": "Caring",
      "features": [
        "DISPOSABLE MEDICAL EXAM GRADE GLOVES - These single-use gloves provide the perfect protection from the exam room to your home, and anywhere else! Heavy-duty protection for any type of situation.",
        "DURABLE NITRILE MATERIAL - Quality nitrile material provides a trusted barrier, ensuring the glove won't easily tear. Not made with natural rubber latex and powder-free for ultimate comfort.",
        "TEXTURED FINGERTIPS AND AMBIDEXTROUS - Great tactile sensitivity, but still thick for extra protection. Great grip allows you to handle the smallest of items and are touch screen compatible. Ambidextrous gloves fit comfortably on either hand.",
        "LARGE PACK COUNT - 100 gloves per box ensure you have enough gloves for any task - medical care, first aid, crafts food prep and more!",
        "CHEMICAL RESISTANT* - Meets both ASTM D6798-05 and USP 800 Personal Protection Equipment requirement for use of chemotherapy gloves when handling hazardous drugs*"
      ],
      "description": "N/A",
      "parentTitle": "Caring Nitrile Exam Gloves, Blue, Powder-Free, Disposable Gloves for Medical Care, First Aid, Cleaning, Food Prep",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Molly's Suds Dishwasher Pods | Clean Dishwasher Detergent, Cuts Grease & Rinses Clean (Residue-Free) for Sparkling Dishes | 60 Auto-Release Tabs (Citrus)",
      "imagesCSV": "61D7giZFqUL.jpg,614jctOU90L.jpg,617b2Y6CiML.jpg,61ruUP6nlmL.jpg,61PSDMc8Q2L.jpg,61mksggqRvL.jpg,61g0dbwqbWL.jpg,61aKcW1ISIL.jpg",
      "manufacturer": "Molly's Suds",
      "asin": "B0B1PKLPHG",
      "brand": "Molly's Suds",
      "features": [
        "SPARKLING CLEAN WITHOUT HARSH CHEMICALS: Molly’s Suds Dishwasher Detergent Pods cut through grease & stuck-on food stains to leave dishes sparking with zero residue, streaks, or other mineral build-up. Simple and effective, Molly’s Suds products are free from ethoxylates and certified cruelty-free by Leaping Bunny.",
        "CONVENIENT & EASY TO USE: A single auto-release pod works to clean 1 full load of dishes. Safe for use on glassware, porcelain, stainless steel, pots & pans, baby bottles and more! Simply rinse dishes with hot water prior to loading in your dishwasher (works with built-in, portable & drawer styles), add pod, select your preferred wash cycle and let Molly’s Suds do the hard work!",
        "MOM APPROVED: Developed by a pediatric nurse & mom with simple ingredients that really work. Created for those with chemical sensitivities and allergies in mind. Cleaner dishes, cleaner environment!",
        "POWERFUL YET GENTLE: Low sudsing formula contains active enzymes to dissolve food, grease & grime without the need for harsh chemicals or any rinse aids. Works well on all stain types including dried-on food, coffee & tea stains, even red wine spots! Effective with both hard and soft water.",
        "WHAT’S INCLUDED: One 60 count bag of Dishwasher Detergent Pods. Free of harsh synthetic fragrances, dyes, and other harmful chemicals such as ethoxylates."
      ],
      "description": "N/A",
      "parentTitle": "Molly's Suds Dishwasher Detergent Gel | Natural Dishwasher Detergent, Cuts Grease & Rinses Clean (Residue-Free) for Sparkling Dishes",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Command 20 lb XL Heavyweight Picture Hanging Strips 16 Pairs (32 Command Strips), Damage Free Hanging Picture Hangers, Heavy Duty Wall Hanging Strips for Home Decor, White Adhesive Strips",
      "imagesCSV": "8172RgAY+DL.jpg,71P5pCbBMOL.jpg,71Q239Ba0cL.jpg,81K4GuTBsBL.jpg,71UGVpVbn5L.jpg,81-4iYVNBgL.jpg,71lsChBsECL.jpg,71Etw2dB-rL.jpg",
      "manufacturer": "3M",
      "asin": "B0B3SR5M71",
      "brand": "Command",
      "features": [
        "INCLUDES - 16 Pairs of X-Large, White Command Heavyweight Picture Hanging Strips (32 Strips total); 4 XL strips holds 20 lbs. Max frame size 24 in. x 36 in",
        "WORKS ON A VARIETY OF SMOOTH SURFACES: X-large wall hanging strips bond to a variety of smooth surfaces that include painted walls, painted cinderblock and concrete surfaces for damage free hanging",
        "SURFACE PREP: Clean the desired surface with rubbing alcohol to remove grime and dust to allow the no damage wall hangers to bond to the surface; the indoor temperature must be between 50 degrees Fahrenheit and 105 degrees Fahrenheit",
        "USAGE TIPS: Wait seven days after painting before using the Command Picture Hangers to allow paint to cure; do not hang over beds or on wallpaper; do not use the wall hanging strips to hang valuable items",
        "EASY CLEAN REMOVAL: Lightly hold the top of the removable adhesive strips and slowly pull straight down towards the floor to remove and prevent damage of walls and surfaces",
        "STRONG DAMAGE FREE HANGING STRIPS: Our STRONGEST HOLD with 40% more adhesive holding power compared to Command Large Picture Hanging Strips for hanging large wall art, big mirrors, wall clocks, heavy duty picture frames, and more"
      ],
      "description": "Command White 20 lb XL Heavyweight Picture Hanging Strips let you decorate how you want, when you want, without damaging your walls and surfaces. A great home improvement item, these picture hangers stick on a variety of smooth surfaces without leaving holes, marks or sticky residue. Use these wall hanging strips to hang heavy duty picture frames, large wall art, big mirrors, wall clocks, signs, dry erase boards, holiday decorations, and other home decor. XL picture hanging strips bond to a variety of smooth surfaces that include painted walls, painted cinderblock and concrete surfaces for damage free hanging. Perfect for home renovators and college students, use these Command Picture Hanging Strips in your home, office or dorm room to elevate the appearance of your living or working space without tools. Directions are included; follow the directions closely to use the 3M Wall Hanging Strips as intended. A clever decorating solution that doesn’t damage surfaces, these wall hanger strips will help you fearlessly change your space. One package contains sixteen pairs of heavy duty x-large white picture hanging strips. Sixteen pairs (thirty-two wall hanger strips) holds up to 20 pounds with a maximum frame size of 24 x 36 inches. Decorate, organize and celebrate damage-free with Command.",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "MED Pride NitriPride Nitrile-Vinyl Blend Exam Gloves, Medium 1000 - Powder Free, Latex Free & Rubber Free - Single Use Non-Sterile Protective Gloves for Medical Use, Cooking, Cleaning & More",
      "imagesCSV": "7184phtOXlL.jpg,71rBq2LpmwL.jpg,71apm4WO+HL.jpg,81+vhcmB-UL.jpg,81oVFikzLgL.jpg",
      "manufacturer": "Shield Line",
      "asin": "B08Y99Q8R7",
      "brand": "MED PRIDE",
      "features": [
        "100% FREE OF LATEX, RUBBER, POWDER, PROTEIN: Protect your hands from any nasty bacteria with the most skin-friendly vinyl single use gloves. Completely Powder, Natural Latex, Rubber & Protein Free, these multipurpose gloves are perfect for an array of uses without causing the slightest discomfort. A safe choice even for people with skin sensitivities or those allergic to rubber and latex.",
        "EXCELLENT QUALITY DURABLE NITRIPRIDE VINYL – NITRILE BLEND GLOVES: Made of the highest quality vinyl and Nitrile materials, the Medpride latex-free gloves are extra durable yet comfortable to your skin. Stronger and thicker than regular nitrile gloves, they offer improved tactile sensitivity and work great for both commercial or industrial use!",
        "AMBIDEXTROUS GLOVES – BULK VALUE OF 1000: Form fitting with an ambidextrous design, these medium single-use gloves are extremely easy to put on and remove without taking a toll on your dexterity. Coming in a great value-pack of 100 gloves, in a handy dispenser box for easy use and storage, you will always have access to a fresh pair of protective gloves!",
        "ENDLESS USES FOR MEDICAL PROFESSIONALS & BEYOND: The medical quality exam gloves are great for doctors, medical experts, nurses, dentists, caretakers, veterinarians or any other health professional. Practical and versatile, they can be used for cooking and food prep services, pedicure, painting, cleaning and more. Plus, they double as protective gloves to safeguard your hands from common bacteria.",
        "ORDER WITH PEACE OF MIND: Medpride is your trusted supplier of effective, top quality medical products that you can count on to equip your personal medical kit. Backed by a 30-Day Money Back Guarantee, you have every good reason to choose the Medpride for all your at-home medical supplies!"
      ],
      "description": "N/A",
      "parentTitle": "Medpride NitriPride Vinyl-Nitrile Blend Exam Gloves - Powder Free, Latex Free & Rubber Free - Single Use Non-Sterile Protective Gloves for Medical Use, Cooking, Cleaning & More",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Amazon Basics 99% Isopropyl Alcohol First Aid For Technical Use,16 Fluid Ounces, 1-Pack (Previously Solimo)",
      "imagesCSV": "610bnVxwbXL.jpg,41tXht5aeUL.jpg,31bAcKKQcnL.jpg,71jT9+y3JML.jpg",
      "manufacturer": "Amazon.com Services LLC.",
      "asin": "B07NFSFBXQ",
      "brand": "Amazon Basics",
      "features": [
        "99% Isopropyl alcohol is not intended for use on the skin",
        "Wash face, hands and any exposed skin thoroughly after handling product",
        "Do not eat, drink or smoke when using this product",
        "When using this product, wear protective gloves/protective clothing/eye protection/face protection Twelve 16-fluid ounce bottles",
        "An Amazon brand",
        "Packaging may vary from images shown"
      ],
      "description": "Solimo Isopropyl Alcohol helps in reducing the risk of infection. 99% by volume, read label for instructions.",
      "parentTitle": "Amazon Basics Isopropyl Alcohol For Technical Use Bottle Lab Chemical",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Gorilla Super Glue Gel XL, Clear Glue, 25 Gram (Pack of 6) - All Purpose and Fast Setting for Projects and Repairs",
      "imagesCSV": "812nGNJb5uL.jpg,41Gq6SFRqHL.jpg,51I5Nm8RwML.jpg,91qfvbfCU+L.jpg,71AJy8N1DbL.jpg,81Mln4MBrnS.jpg,91InKvYOhES.jpg,91Hqf+JidtS.jpg,313gWpHtMTL.jpg,31Bmd98SYOL.jpg",
      "manufacturer": "The Gorilla Glue Company",
      "asin": "B09DTC1RRB",
      "brand": "Gorilla",
      "features": [
        "Crystal clear: This clear Gorilla glue leaves a discreet finish to keep the focus on your project, not the glue",
        "All purpose glue: Gorilla Super Glue is formulated for virtually all projects and repairs; it bonds glass, plastic*, wood, metal, ceramic, rubber, leather, paper, and more",
        "Anti-clog cap: A special cap helps keep the glue bottle from drying out and clogging; staying Gorilla tough after use",
        "Fast-setting: This adhesive glue dries in 10-45 seconds, no clamping required",
        "Gel glue formula: Our thick, no-run Gorilla glue gel formula is perfect for use on vertical surfaces where liquid super glue struggles"
      ],
      "description": "Gorilla Super Glue Gel is an easy-to-use, thicker and more controlled formula* great for multiple surfaces and vertical applications. Developed for long-lasting repairs in an instant, the clear glue dries in 10-45 seconds. This super glue gel is specially formulated to absorb drops and impacts. Super glue, also referred to as cyanoacrylate glue, or CA glue, works on a variety of materials, including plastic**, metal, stone, ceramic, paper, rubber and more. In addition to its high-performance formula, we've added an anti-clog cap with a metal pin inside to ensure an airtight seal for maximum reusability. It's Gorilla tough, every time.\n\n*Versus liquid Gorilla Super Glue\n**Not recommended for use on polyethylene or polypropylene plastic or similar materials.\n\nDirections:\n1) Protect Work Area From Spills\n2) Clean and Dry Surfaces to Be Bonded\n3) Prepare Gorilla Super Glue Gel: With cap on bottle, shake product, then turn product upside down and tap on hard surface to shake gel into bottle nozzle.\n4) Apply Gorilla Super Glue Gel: Remove cap and apply a small amount of Gorilla Super Glue Gel to one surface. Only one dab per square inch recommended. Set time can vary based on the amount of glue and type of surface glued. Excess glue can cause delayed or failed bond.\n5) Secure: Press the two surfaces together for about 10-45 seconds. Note that gaps and uneven surfaces may cause delayed bonding. Wait 24 hours for a full cure.\n\nBottles are labeled by weight, not by volume, and each bottle contains the labeled weight. For high performance and reusability, the glue needs to be protected from moisture. Our bottle, which has the required thickness to keep moisture out, contains the grams of glue as labeled and is flexible enough to allow the glue to flow, making the product easy to use.",
      "parentTitle": "Gorilla Super Glue Gel XL, 25 Gram",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "DIYMAG Magnetic Hooks for Refrigerator, Extra Strong Cruise Hook, Heavy Duty Earth Magnets with Hook for Hanging, Magnetic Hanger for Cabins, Grill (45P-Silver)",
      "imagesCSV": "81HgF2+8CYL.jpg,71XGMGFXpgL.jpg,81PyQM5s8nL.jpg,7175KnANSsL.jpg,719M9giSXnL.jpg,71pMCasMOPL.jpg,61t5JBirXIL.jpg",
      "manufacturer": "DIYMAG",
      "asin": "B09JG8QBX9",
      "brand": "DIYMAG",
      "features": [
        "【High Quality】The strong magnet hooks is made of neodymium magnet and high quality A3 steel, the hook is strong and reliable. And the size is very portable.",
        "【Super Durablel】The magnetic hooks heavy duty is coated with three layers: Ni-Cu-Ni, so the strong magnets is shiny and anti-rust, provides protection for the magnet hooks and helps the hook to chip or crack. Magnetism is always strong!",
        "【Wide Application】After accurate simulation and calculation, this strong magnetic hooks has a wide range of applications, magnetic hooks for locker , classrooms, grill, refrigerators, doors,cruise cabin sand any place with steel metal.",
        "【Easy to Assemble】The metal magnet hooks for hanging heavy duty can be used without punching, very simple and convenient.",
        "【NOTE】30LBS magnetic hooks tension is based on the direction of tension perpendicular to the contact surface - if used horizontally, reduce by 2/3."
      ],
      "description": "N/A",
      "parentTitle": "DIYMAG Magnetic Hooks,Strong Heavy Duty Cruise Magnet S-Hooks for Classroom, Fridge, Hanging, Cabins",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Rubbermaid Commercial Products Deskside Wastebasket/Trash Can, 3.25-Gallon/13-Quart, Gray, Plastic, for Bedroom/Bathroom/Office, Fits Under Desk/Sink/Cabinet",
      "imagesCSV": "71hrPJYSFqL.jpg,61-5FQUz5EL.jpg,71R++f+IiIL.jpg,71X5-a1DXpL.jpg",
      "manufacturer": "Rubbermaid Commercial Products",
      "asin": "B004MDM8OM",
      "brand": "Rubbermaid Commercial Products",
      "features": [
        "DURABLE: Made of heavy-duty plastic that ensures long-lasting use and prevents dents, chips, or peeling so it will always have a professional look",
        "TOUGH: Rolled rims add strength when lifting or carrying",
        "CONVENIENT: Easy to clean material",
        "ORGANIZATION: Stackable design enables nesting for easy transport and storage.",
        "VERSATILE: Perfect for homes, bedrooms, bathrooms, offices, conference rooms, registers, admissions, display rooms, gift shops and more",
        "Available in black, beige or gray",
        "MEASURES: 11.75\" x 8.25\" x 12.25\""
      ],
      "description": "The Rubbermaid Commercial Product small 13 Qt wastebasket offers space-efficient, economical, and an easy and an effective way to recycle. Made of all-plastic construciton, this wastebasket won't chip, rust or dent.",
      "parentTitle": "Rubbermaid Commercial Products Deskside Wastebasket/Trash Can, Plastic, Garbage Can for Home/Office, Fits Under Desk/Sink/Cabinet",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Neosmuk Magnetic Hooks, Cruise Ship Essentials, 30lb+ Heavy Duty Magnetic Hooks for Cruise Cabins, Refrigerator, Grill, Hanging, and Travel | Extra Strong Must-Haves Magnet Hook(Green,Pack of 12)",
      "imagesCSV": "81x7a4I+LkL.jpg,71Ktasl-CxL.jpg,71OsNb3K9PL.jpg,81tElEuqdTL.jpg,81G3K-mFXQL.jpg,71tUYDeAUaL.jpg,81Bq4oIiljL.jpg",
      "manufacturer": "Neosmuk",
      "asin": "B0CKS84DYX",
      "brand": "Neosmuk",
      "features": [
        "✔ SUPER POWERFUL - Amazing strong, sturdy, and heavy-duty metal magnetic hook with a CNC machined steel base, embedded with a high grade latest generation of ‘magnetic king’ i.e. super Nd-Fe-B, this magnetic hook offers strong pulling force under steel. The magnetic hook is perfect for hanging items on the fridge in the kitchen.",
        "✔ HIGH-LEVEL PLATING- We offer 4 layers of coating on the magnet hook metal base, metal hook, and magnet. It provides this magnetic hanger with a shiny, rust-free, and mirror-like finish. Coated magnetic hook particularly exhibits an excellent anti-corrosive properties and scratch resistance. Maintenance-free, no rust!",
        "✔ CRUISE ESSENTIALS –After performing a careful inspection of the magnetic hooks machining flow line, defective pieces were checked and picked out in the first place. You can take these excellent magnetic hooks to the cruise for hanging and decorations on the metal wall or metal door in the cruise cabins of your carnival cruise ship. This strong magnet hook is a cruise necessity and one of the cruise accessories must-haves.",
        "✔ VERSATILE USE- Neosmuk’s strong neodymium magnetic hooks were endowed with a strong capability for holding various items wherever there is iron or steel. This magnet hook is a perfect magnetic key holder. You can also hang your tools next to the toolbox with this magnetic hook. Our magnetic hooks are great for grill, pot, cup, utensils, and oven.",
        "✔ Neosmuk 30lb+ (measured on the automatic tension machine) Permanent magnetic hook with LARGER base (0.67in) and thicker magnet, strong magnetism lasts forever!"
      ],
      "description": "N/A",
      "parentTitle": "Neosmuk Black Magnetic Hooks, Extra Strong Magnet with Hook for Fridge,Heavy Duty Cruise Hook for Ceiling,Small Magnetic Hanger for Van, Wall",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "U-100 Syringes with Needle - 30G 5/16\" (8mm) 1ml/cc Disposable Syringe, Individual Wrapped, 100PACK",
      "imagesCSV": "611Qmah-IUL.jpg,61PvarN+UkL.jpg,617XRGe3k8L.jpg,61zPllAX4oL.jpg,71koVbDDaAL.jpg,61A3sRDJoiL.jpg,71DONlWa5vL.jpg,61V-dqlOQzL.jpg",
      "manufacturer": "VEEIROC",
      "asin": "B0D1FV39LK",
      "brand": "VEEIROC",
      "features": [
        "U-100 1ml Syringe - Disposable 1cc syringes with needle, 30G 5/16\" (8mm) sterile individually wrapped, 100 PACK.",
        "HIGH QUALITY MATERIAL - Our syringe is made of high quality material, thick and sturdy.",
        "High Quality Syringe - U-100 syringe has clear markings, easy to read, and accurate measurement.",
        "100% Leak-Proof Design - The inner wall of the disposable syringe is smooth, the plunger will not get stuck, and the plunger is very airtight, so there is no need to worry about leakage during withdrawal and injection.",
        "Individually packaged - Each sterile syringe is individually packaged."
      ],
      "description": "💉Product: Disposable Sterile Syringe with Needle\n💉Capacity: 1ml/CC\n💉Model: 30G 5/16\" (8mm)\n💉Quantity: 100PCS\n👉Product Features:\n✅100% leak-proof design.\n✅Smooth, easy-to-operate plunger.\n✅Clear and easy to read numbers ensure precise measurements.\n✅Five-sided cutting new production process and electropolishing to remove burrs.\n🤝This product is suitable for industrial, scientific laboratory or household tools.",
      "parentTitle": "U-100 Syringes with Needle - 30G 5/16\" (8mm) 1ml/cc Disposable Syringe, Individual Wrapped",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Easy Touch U-100 Insulin Syringe with Needle, 30G 0.5cc 1/2-Inch (12.7mm), Box of 100",
      "imagesCSV": "61DMN3ehZ0L.jpg,61kTVBxvRUL.jpg,61Uwyjfbm8L.jpg,71YJ7WO5-iL.jpg,71R00QJ6dcL.jpg,71f0QsRcYsL.jpg,71GgXcf1CsL.jpg",
      "manufacturer": "MHC Medical Products",
      "asin": "B07NYD185V",
      "brand": "Easy Touch",
      "features": [
        "Sharp Needle Syringe For Comfortable Injection: Easy Touch diabetic needles are made with surgical steel, film-coated, tri-bevel cut, and electro-polished to remove burrs, creating one of the sharpest insulin needles on the market, per STR Labs",
        "Easy-Flow Injection Syringe: Utilizing thin-wall cannulas, Easy Touch diabetic syringes feature a thinner wall that reduces the required plunger force and helps large insulin doses flow easily for a smoother, more comfortable injection",
        "Better Barrels: Easy Touch insulin syringe barrels are lubricated, boldly marked, and have pronounced flanges to support a smooth and secure injection",
        "Quality You Can Trust: Easy Touch syringes with needle are manufactured according to MHC Medical Products’ FDA 510K to allow for the control of each component and ingredient, from the insulin needles' grind to the barrel markings",
        "Our Promise: MHC Medical Products stands behind its products with a simple promise: Quality you can trust and comfort you can feel; if you're not satisfied, let us know, and we'll make it right"
      ],
      "description": "N/A",
      "parentTitle": "EasyTouch Insulin Syringe U-100 Box of 100",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Command Large Picture Hanging Strips, White, Holds up to 16 lbs, 14-Pairs, Easy to Open Packaging",
      "imagesCSV": "81Jkqpg6r6L.jpg,716o7UAs2SL.jpg,81Osb7nh7HL.jpg,81kHdwgX42L.jpg,71hH1BDwjcL.jpg,71DEhZaeVyL.jpg",
      "manufacturer": "3M",
      "asin": "B073XR4X72",
      "brand": "Command",
      "features": [
        "Strips",
        "MAXIMUM FRAME SIZE 24 X 36 INCHES: One package includes 14 pairs (28 strips total) of the Command Large Picture Hanging Strips; four wall adhesive strip pairs hold 16 pounds; maximum frame of 24 x 36 inches",
        "WORKS ON A VARIETY OF SMOOTH SURFACES: Wall hanging strips work on a variety of smooth surfaces, including painted walls, finished wood, painted concrete cinder blocks, laminate, glass, metal and tiles",
        "SURFACE PREP: Clean the desired surface with rubbing alcohol to remove grime and dust to allow the no damage wall hangers to bond to the surface; the indoor temperature must be between 5 degrees Fahrenheit and 15 degrees Fahrenheit",
        "USAGE TIPS: Wait seven days after painting before using the Command Picture Hangers to allow paint to cure; do not hang over beds or on wallpaper; do not use the wall hanging strips to hang valuable items"
      ],
      "description": "Command White Large Picture Hanging Strips let you decorate how you want, when you want, without damaging surfaces. A great home improvement item, these picture hangers stick on a variety of smooth surfaces without leaving holes, marks or sticky residue. Use these wall hanging strips to hang picture frames, college dorm decor, wooden letters, nursery decor, calendars or to create a gallery wall. Simply mount these picture strips on painted walls, finished wood, painted concrete cinder blocks, laminate, glass, metal and tiles and enjoy the damage free hanging of your favorite decorations. Perfect for home renovators and college students, use these Command Picture Hanging Strips in your home, oﬃce, apartment or dorm room to elevate the appearance of your living or working space without tools. Directions are included; follow the directions closely to use the 3M Wall Hanging Strips as intended. A clever decorating solution that doesn’t damage surfaces, these wall hanger strips will help you fearlessly change your space. One package contains 14 pairs of large white picture hanging strips. Four adhesive strip pairs hold up to 16 pounds with a maximum frame size of 24 x 36 inches. Decorate, organize and celebrate damage free with Command.",
      "parentTitle": "Command Plastic Removable Wall,Painting,Indoor Foam Adhesive Tapes",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "3M Multi-Use Colored Duct Tape, White with Strong Adhesive and Water-Resistant Backing, Multi-Surface 3M Duct Tape for Indoor and Outdoor Use, 1.88 Inches x 20 Yards, 1 Roll (3920-WH)",
      "imagesCSV": "61TDlZEv+TL.jpg,51xG-PiRqzL.jpg,81ljK1SWaCL.jpg,816Pg1RFHuL.jpg,619V922J7DL.jpg,611ZldHh9JL.jpg,71Ubh0olOgL.jpg,71u1any9NlL.jpg",
      "manufacturer": "3M",
      "asin": "B01LZ7BAAF",
      "brand": "3M",
      "features": [
        "VARIETY PACK OF PICTURE STRIPS: One package of the Command Picture Hanging Strips Variety Pack includes four small pairs (8 strips total), 8 medium pairs (16 strips total)",
        "WORKS ON A VARIETY OF SMOOTH SURFACES: Wall hanging strips work on a variety of smooth surfaces, including painted walls, finished wood, painted concrete cinder blocks, laminate, glass, metal and tiles",
        "SURFACE PREP: Clean the desired surface with rubbing alcohol to remove grime and dust to allow the no damage wall hangers to bond to the surface; the indoor temperature must be between 50 degrees Fahrenheit and 105 degrees Fahrenheit",
        "VERSATILE DESIGN: Flexible duct tape design stretches, conforms to surfaces and tears vertically or horizontally",
        "MULTIPLE COLORS: Choose from the following colorful duct tape options: red, blue, green, yellow, orange, brown, black or white",
        "NO JOB TOO TOUGH: 3M uses patented technology and advanced features to create a line of duct tape products that deliver strength and versatility to make your job easier",
        "TRUST IN 3M: 3M has revolutionized the duct tape category with a premium line of products that deliver dependable results for the most demanding applications",
        "Adheres to multiple surfaces",
        "Ideal for use indoors",
        "Color code your projects with ease"
      ],
      "description": "3M White Colored Duct Tape is a multi-purpose duct tape for repairs, crafts and decorating with a bold hue that matches your project’s color scheme. Designed for both exterior and interior use, this strong duct tape is equipped with a water-resistant backing to withstand the harmful effects of moisture. This adhesive tape has a secure bond that is perfect for bundling, taping cords, patching, reinforcing, crafts, labeling and organization. A flexible design allows color duct tape to stretch and conform with ease, applying smoothly even on curved surfaces. This duct tape also tears vertically and horizontally for versatile application. With multiple colors to choose from, there is something for everyone. Choose from over eight colors, including red, blue, brown and white, for a colorful duct tape that blends in or stands out with your color scheme. Deliver dependable results for the most demanding applications with 3M. 3M has revolutionized the duct tape category with a premium line of products that deliver the strength and versatility you’ve come to expect from 3M. Using patented technology and advanced features, 3M Duct Tape products are unlike any others. Trust in 3M to make your job easier.",
      "parentTitle": "3M Multi-Use Colored Duct Tape,",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Green Gobbler Liquid Hair Drain Clog Remover & Cleaner, For Toilets, Sinks, Tubs - Septic Safe, 2 Pack",
      "imagesCSV": "81U-goKXdUL.jpg,71YrnD-EhuL.jpg,61fb66wmp7L.jpg,71-uE0MP2OL.jpg,71il8gkHs6L.jpg,71pJrMiK6hL.jpg,71ct-elZ66L.jpg,712i3HT9fZL.jpg,71owk0VjTiL.jpg",
      "manufacturer": "Green Gobbler",
      "asin": "B085FS4JTD",
      "brand": "Green Gobbler",
      "features": [
        "\"DISSOLVES HAIR, SOAP, TOILET PAPER, GREASE & FLUSHABLE PERSONAL CARE WIPES: Forget the dirty work of plunging clogged toilets and backed-up drains. Green Gobbler sinks through standing water to clear clogs and keep your plumbing flowing properly. It dissolves hair, soap scum, toilet paper, flushable wipes and organic matter. \"",
        "EASY TO USE PACKAGING, POWERFUL AND EFFECTIVE FORMULA: This drain and pipe cleaner is a simple and highly effective way to eliminate clogs. The extra wide bottle opening helps reduce splashing and our clear side view strip makes it easy to control each application – no need to measure! Each bottle has up to two clog remover treatments.",
        "6-IN-1 SAFE: This drain opener is safe to use in pipes, toilets, sinks, tubs, showers and septic systems. Our formula is non-corrosive to plumbing and dissolves hair more effectively than traditional bleach-based drain openers",
        "BLEACH FREE FORMULA: Odorless and free of fumes, it's safe for PVC, ABS, copper and cast iron household pipes. The formula doesn't contain bleach, lye of VOC's",
        "GREEN GOBBLER GUARANTEE: Green Gobbler cares about its customers. We take pride in developing innovative & effective products for your home or business. If for any reason you are unsatisfied, please contact us. We offer a money-back guarantee within 30 days of purchase."
      ],
      "description": "N/A",
      "parentTitle": "Green Gobbler Liquid Hair Drain Clog Remover & Cleaner, For Toilets, Sinks, Tubs",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Tork Everwipe Chem-Ready Wiping System Refill Dry Wipes Rolls White, 6 x 90 wipes, 192808 + Tork Multifold Hand Towel, Natural, H2, Universal, 100% Recycled Fibers, 1Ply, 16 x 250 Sheets, MK520A",
      "imagesCSV": "71JrvEd19pL.jpg,712M-F7OoHL.jpg,71JhlndUFpL.jpg,71fZWqlpzlL.jpg,81lUs78IpoL.jpg,81l0YZFE+HL.jpg,71OJFA6rqdL.jpg,81FePk6U4oL.jpg",
      "manufacturer": "Tork",
      "asin": "B0CN1JDDR4",
      "brand": "Tork",
      "features": [
        "Hand Towel: Boost your facility's image by choosing sustainable, natural hand towels to show your concern for the environment.",
        "Wipes: Use these disposable cleaning wipes to keep surfaces clean and promote hygiene.",
        "Hand Towel: pairing these bathroom paper towels with a touch-free dispenser for hygienic single-dispensing.",
        "Wipes: Promote hygiene thanks to the closed system cleaning.",
        "Hand Towel: 16 packs, 250 paper hand towels each. 1 ply. Universal quality. Folded size L 3.2\" W 9.1\" Unfolded size L 9.5\" W 9.1\" Compatible with H2 dispensers.",
        "Wipes: 6 rolls/case, 90 wipes/roll, Wipe size 10in.(L) x 12in.(W). Designed for use in Everwipe Chem-Ready Bucket."
      ],
      "description": "Everwipe Chem-Ready Wiping System Refill Dry Wipes Rolls White: Save time and improve surface hygiene with these Everwipe Chem-Ready refill rolls. Simply place the roll of dry wipes into the compatible bucket and add your preferred quat-based sanitizer. Chem-Ready provides closed system cleaning that's more hygienic, safer and simpler than traditional open bucket or spray bottle systems. Plus, these dry wipes are engineered with small pockets to effectively scrub and trap dirt. Advantages at a glance: + Single-use, disposable wipes + Closed system cleaning + For use with quat sanitizers + Durable, thick and absorbent + Scrubs and traps dirt & Tork Universal Hand Towels The natural paper hand towels in Universal quality meet basic requirements in the washroom. Products in the Universal line are designed for businesses seeking to achieve a more impactful, eco-friendly facility by choosing to use products which are produced with methods much less harmful to the environment. These cost-effective towels are suitable for healthcare, manufacturing, industrial and educational facilities.Tork Universal Multifold Hand Towel: + Features environmentally preferable packaging + Ideal for medium traffic washrooms.",
      "parentTitle": "Hallmark",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Scott Professional 100% Recycled Fiber Standard Roll Bulk Toilet Paper (13217), 2-Ply, Elevated Design, White, Individually Wrapped (80 Rolls of 473 Sheets, 37,840 Sheet Total)",
      "imagesCSV": "81ATKt+rzmL.jpg,91Cdz3cItTL.jpg,71jECeIZEIL.jpg,81u-6lfYT5L.jpg,712tZi62MML.jpg,81QAcZFTb8L.jpg,81d-Da8xS7L.jpg,8137LI9NUFL.jpg,71xTwGXYwqL.jpg,41lPPFE8y2L.jpg,41qLRgz9WxL.jpg",
      "manufacturer": "Kimberly-Clark Professional",
      "asin": "B008I7TNDW",
      "brand": "Scott Professional",
      "features": [
        "473 Sheets/Roll, 80 Scott Professional 100% Recycled Fiber Standard Roll Toilet Paper Rolls/Case; 37,840 Sheets/Case; with Elevated Design; 2-Ply; White; Individually wrapped rolls",
        "The 2-ply bathroom tissue is strong and absorbent enough to get the job done and satisfy your employees and guests.",
        "Individually wrapped Scott bath tissue rolls are protected until you're ready to use them.",
        "These toilet paper rolls are designed to fit into universal, cored roll dispensers",
        "FSC and ECOLOGO certified; meets or exceeds EPA guidelines for post-consumer waste content (at least 25%); Sewer and Septic Safe"
      ],
      "description": "Scott® provides reliable balance of efficiency, performance, and value. As a business owner, quality and cost-effectiveness are important in everything you purchase. With Scott® Professional Standard Roll Toilet Paper bulk toilet paper, you can get the quality and performance you count on—and still stay within your budget. With the new paper design, our bath tissue is Unmistakably Scott® branded so you'll be recognized for providing the most well-known restroom brand in your facility. Plus, the bulk rolls are individually wrapped (they're protected until you're ready to use them) and fit with most universal toilet paper dispensers. These toilet paper rolls are designed to fit into universal, cored roll dispensers. If practicality, reliability and value top your list of criteria for bathroom supplies, trust Scott® Standard Roll Bath Tissue! Superior quality at value prices means that Scott® is always a great choice.",
      "parentTitle": "Karaoke Machine",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "SUNLU 4kg PLA 3D Printer Filament Bundle, Neatly Wound PLA Filament 1.75mm ±0.02mm, Individually Vacuum Packed, 4kg in Total, 1kg per Spool, 4 Pack, Clear Red+Clear Blue+Clear Green+Clear Yellow",
      "imagesCSV": "81GJJ5FFqAL.jpg,71XxCe8JC1L.jpg,81hhIU9wSKL.jpg,716RYXwwyNL.jpg,81CqgUrQpKL.jpg,71CtGnfepWL.jpg,71RGj6XMXkL.jpg,81jG6hV5yCL.jpg,81QjaATRQtL.jpg",
      "manufacturer": "SUNLUGW",
      "asin": "B0DMF8Z17C",
      "brand": "SUNLU",
      "features": [
        "①【SUNLU PLA 3D Printer Filament】PLA material is the perfect choice for 3D printing enthusiasts! SUNLU PLA filament is reliable, versatile, and easy to use. No clogs, bubbles, or tangles, its excellent layer adhesion ensures high-quality prints every time. Ideal for beginners and experienced users.",
        "②【Neatly Wound 3D Filament Spool】SUNLU's self-developed neat winding device ensures that the filament is easy to use, with a 100% neat rate that reduces the risk of tangles and jams, and provides a smoother and more efficient 3D printing experience.",
        "③【PLA Filament 1.75 mm】SUNLU 3D printer filament dimensional Accuracy +/- 0.02mm. SUNLU filament has wide compatibility due to the small diameter error, making it suitable for almost all 1.75mm FDM 3D printers.",
        "④【Filament Spool Diameter】Spool Diameter: 8.00\", Spool Width: 2.50\", Spool Hub Hole Diameter: 2.20\". The size of the SUNLU filament spool is suitable for hanging on a lot of FDM 3D printers.",
        "⑤【PLA Recommend Settings】To achieve the best printing results with SUNLU PLA filament, we recommend printing at a nozzle temperature of 200-230°C, a bed temperature of 50-65°C, and a printing speed of 50-100mm/s.",
        "⑥【SUNLU Main 3D Products】SUNLU offers a wide range of high-quality 3D printing products, including 3D printer filament, filament dryer, FDM 3D printer, 3D pen, 3D pen filament, 3D printer resin, LCD 3D printer, resin curing box, and other accessories, providing you with everything you need for a successful 3D printing experience."
      ],
      "description": "N/A",
      "parentTitle": "SUNLU PLA 3D Printer Filament PLA Filament 1.75mm",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "ELEGOO PLA Filament 1.75mm Sea Green 1KG, 3D Printer Filament Dimensional Accuracy +/- 0.02mm, 1kg Cardboard Spool(2.2lbs) 3D Printing Filament Fits for Most FDM 3D Printers",
      "imagesCSV": "71sM3A8VtQL.jpg,71-Z5LWchBL.jpg,71bLQCJd8VL.jpg,71bwJ4En2zL.jpg,71C9n6Z73lL.jpg,712pCJ-ZNfL.jpg,81FinkXzosL.jpg,71S+sFSXxhL.jpg",
      "manufacturer": "ELEGOO",
      "asin": "B0BM72B459",
      "brand": "ELEGOO",
      "features": [
        "【High-Quality PLA Filaments】Made of high-quality PLA, a commonly used thermoplastic material features lower melting temperature and ease of use, low warp and shrinkage, odorless during printing, and provides a glossy surface finish",
        "【Dimensional Accuracy & Consistency】 Strict tolerances guarantee these PLA filaments of 1.75 mm diameter much smoother and more stable printing with the dimensional accuracy of +/- 0.02 mm, 1 kg spool (2.2lbs)",
        "【Less-tangle and Easy to Use】Full mechanical winding and strict manual examination to ensure that the line is neatly arranged and less tangled, and to avoid possible snap and line breaking. A larger spool inner diameter design for easy feeding",
        "【Clog-Free & Bubble-Free】Designed and manufactured with superb layer bonding and great fluidity for smooth and stable extrusion. Complete dried for before packaging and vacuum sealed well to protect the filament from moisture, no clogging and bubbling problems",
        "【Wide Compatibility】Universal compatibility with most of the common 1.75mm FDM 3D printers. ELEGOO 3d printer filament offers a range of colors to boost your creativity and is essential for your printing projects"
      ],
      "description": "N/A",
      "parentTitle": "ELEGOO PLA Filament 1.75mm for 3D Printer",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "GE Advanced Silicone Caulk for Kitchen & Bathroom - 100% Waterproof Silicone Sealant, 5X Stronger Adhesion, Shrink & Crack Proof - 2.8 fl oz Tube, Clear, 12 Pack",
      "imagesCSV": "71mtd4dnNSL.jpg,4139zf8xzYL.jpg,41-gtchBXgL.jpg,41IQvfMmx2L.jpg,41gD2pD3HUL.jpg,51Z5L8szk5L.jpg,51CrjtFm5vL.jpg",
      "manufacturer": "Henkel Corporation",
      "asin": "B0C9WBHQ23",
      "brand": "GE",
      "features": [
        "100% Waterproof: This 100% silicone formula offers ultimate protection against water damage, providing a reliable seal in areas prone to consistent water exposure",
        "Strong and Flexible: Stays permanently flexible with a high-performing, durable seal",
        "30-Minute Water-Ready: Ready for water exposure in as little as 30 minutes",
        "Shrink- and Crack-Proof: Withstands extreme expansion and contraction associated with temperature fluctuations",
        "Compatible with Most Materials: Adheres to most metals, plastics, and woods; glass, drywall, plaster, granite, cultured marble, ceramic and porcelain tile, and more"
      ],
      "description": "GE Advanced Silicone 2 Kitchen and Bath sealant is a high-performance, 100% silicone and 100% waterproof sealant ideal for areas prone to water exposure. GE Advanced Silicone 2 Kitchen and Bath sealant is permanently flexible with 40% more flexibility than Class 25 sealants and has 5X stronger adhesion than our Silicone 1 sealant. It will not discolor most high-end metal finishes such as chrome, bronze, and nickel. This sealant also has a low odor while curing thanks to its neutral-cure formula. Use our silicone kitchen and bathroom sealant on a variety of common surfaces, including most metals, plastics, and woods; glass, drywall, plaster, granite, and more.",
      "parentTitle": "GE Advanced Silicone Caulk for Kitchen & Bathroom - 100% Waterproof Silicone Sealant, 5X Stronger Adhesion, Shrink & Crack Proof - 2.8 fl oz Tube",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "SYLVANIA ECO LED B10 Light Bulb, 60W = 3.5W, Dimmable, Clear, 450 Lumens, 2700K, Soft White - 18 Pack (41265)",
      "imagesCSV": "61KQ2t-nRDL.jpg,91cnvxNYuIL.jpg,91r2MJ1j7LL.jpg,818cCeKVYUL.jpg,81TyraHIG-L.jpg,61C+nKWJU0L.jpg",
      "manufacturer": "LEDVANCE",
      "asin": "B0B1W6189B",
      "brand": "LEDVANCE",
      "features": [],
      "description": "N/A",
      "parentTitle": "LEDVANCE LED Bulbs",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "JohnBee Empty Spray Bottles (16oz/2Pack) - Adjustable Spray Bottles for Cleaning Solutions - No Leak and Clog - HDPE spray bottle For Plants, Pet, Vinegar, BBQ, and Rubbing Alcohol",
      "imagesCSV": "51XSJUwpm-S.jpg,71rCfcNoROL.jpg,61v8E8p-qDL.jpg,61o76uH9a2L.jpg",
      "manufacturer": "JohnBee",
      "asin": "B08QM81BJV",
      "brand": "JohnBee",
      "features": [
        "【HDPE Eco-Friendly Material】Empty Spray Bottles for Cleaning Solutions are Manufactured With Strong HDPE, the BPA-Free Plastic Durable and Chemical Resistant. Cleaning Spray Bottle Unlike Glass, No Longer Need to Worry About the Bottle Shattering If It Accidentally Falls. The product is not easily spoiled",
        "【No Leak And Clog】Spray Bottles for Cleaning Solutions is Constructed with No Rubber Parts; Our Sprayer Features a Long-Lasting Polypropylene Spray Head, Tight and Secure Cap Closure, Internal Cap Gasket, 302 Stainless Steel Spring and a Precision Valve and Piston, so No Clog and Leak; A Proven and Reliable No Leak Venting System Primes Quickly and Stays Primed.",
        "【Adjustable Nozzle】water spray bottle Rotate the Nozzle Before Use. From a Fine Mist To a Solid Stream, The Sprayer Can Be Easily Adjusted to Suit Your Needs. Extended Suction Tube Gets Every Last Drop",
        "【Multifunction Use Cleaning Supplies】16oz 2 Pack Lightweight Alcohol spray bottle are Semi-Opaque and Come Equipped with an Adjustable Spray Nozzle. Use plant spray bottle around the House, Pet, Lawn and Garden and Watering Plants, Succulents, Herbs, Ironing, Laundry, Car Detailing, BBQ, Homemade DIY Cleaning Spray Bottle",
        "If the Product did not spray, nomally when Nozzles don’t “spray\" Please forcefully insert this Tubes/Straw into the innermost part of the nozzle, and the Nozzles is a Adjustable. if this can not spray you need to try rotate the Nozzle before use. This nozzle can only be used for watering flowers, alcohol, and cleaning is very suitable. Dont put powder, viscous liquid, such as oil and essential oil"
      ],
      "description": "N/A",
      "parentTitle": "JohnBee Spray Bottles For Hair",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Art3d 16 Sets Hook and Loop Tape Sticky Back, 4\"x6\" Double-Sided Adhesive Strip,Heavy Duty, White",
      "imagesCSV": "61532hSkMoL.jpg,71NusjeHMqL.jpg,719WD0AV-OL.jpg,71lQ2ACPJCL.jpg,71id-TYJuhL.jpg,61QMOE8B0nL.jpg,71A6RLXNXvL.jpg",
      "manufacturer": "Art3d",
      "asin": "B0CKQ6SLDS",
      "brand": "Art3d",
      "features": [
        "Good school supply - a good supply for teachers at classroom organization.",
        "Versatile - This hook and loop bonding good for all kinds of temporary fastening, easy to use, fast, and efficient.",
        "Exceptional holding power - It's made of high density nylon to make sure its bonding capacity and durability.",
        "Quality self-adhesive back - High quality adhesion that sticks on any kinds of smooth surfaces,like paint walls, metal, plastic, glass etc. It's residue-free, damage-free.",
        "Used multiple times - The hook and loop system allows to fasten,unfasten and re-fasten at your demand by just a push and pull."
      ],
      "description": "N/A",
      "parentTitle": "Art3d Hook and Loop Tape Sticky Back, Double-Sided Command Adhesive Strip Heavy Duty",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "iHealth COVID-19 Antigen Rapid Test, 1 Pack, 5 Tests Total, FDA EUA Authorized OTC at-Home Self Test, Results in 15 Minutes with Non-invasive Nasal Swab, Easy to Use & No Discomfort",
      "imagesCSV": "61AZ0bqSCRL.jpg,61J1gbwowtL.jpg,71ve2lQ550L.jpg,71H3ihoSmIL.jpg,71ydoq-fXHL.jpg,71jjuK0eHbL.jpg,71xBNTV4r8L.jpg",
      "manufacturer": "iHealth",
      "asin": "B09NY9MMS3",
      "brand": "iHealth",
      "features": [
        "FDA Authorized 15-Minute Self-Test: The test is a 15-minute self-test to detect whether or not an individual has COVID-19. The test can be completed in the comfort of your own home without the need to ship your sample to a lab.",
        "Easy to Use with Zero Discomfort: Test can be done by inserting 1/2 to 3/4 inch of a simple non-invasive nasal swab. Step-by-step instructional videos are available in our app (Installation of app is optional).",
        "For Ages 2 and Above : The self-administered test is recommended for individuals aged 15 years and older. Adult-collection is required for testing children 2-14 years old.",
        "Manage Group Testing Via Mobile App: The iHealth Test app allows the administrator of a small group to monitor and track the group members’ test results as needed at school, work or an event.",
        "Independently-sealed packaging ensures safe and hygienic testing.The swabs and test cards of iHealth COVID-19 Antigen Rapid Test are sealed and independently packaged to ensure the safety and hygiene of the product."
      ],
      "description": "N/A",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Schneider Nitrile Exam Gloves, Large, 2000-ct Case, 4-mil, Black Disposable Gloves Latex-Free, Powder-Free, Food Safe, Medical Gloves for Cooking, Cleaning, Examination",
      "imagesCSV": "51wJMgbaPLL.jpg,71eWi5OkT-L.jpg,61Fywi-ZFWL.jpg,61-ZMC-PiNL.jpg,71NAwkrXBUL.jpg,71Ly9fY1R2L.jpg,71Mjq1bm4hL.jpg,71iat78WeyL.jpg,718yBi3baEL.jpg",
      "manufacturer": "Schneider Medical Industries",
      "asin": "B0D2NHYYKY",
      "brand": "Schneider",
      "features": [
        "These 4 mil black nitrile gloves are medical-grade and designed for durability and performance. They are 5 times more puncture-resistant than latex gloves and provide enhanced protection, making them a reliable choice for various medical applications."
      ],
      "description": "N/A",
      "parentTitle": "Schneider Nitrile Exam Gloves, Black, 4-mil, Disposable Gloves Latex-Free, Powder-Free, Food-Safe",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "VELCRO Brand Industrial Strength Fasteners | Stick-On Adhesive | Professional Grade Heavy Duty Strength Holds up to 10 lbs on Smooth Surfaces | Indoor Outdoor Use | 15ft x 2in Tape, White",
      "imagesCSV": "61tqr1pRj3L.jpg,710osYg44rL.jpg,71Be6gEuvmL.jpg,71feM7MSOTL.jpg,717UciArFUL.jpg,81pBg0PxgFL.jpg,71AstZFS7rL.jpg,61HZiWA6fNL.jpg,71-mriTBbnL.jpg,51+D1urld3L.jpg",
      "manufacturer": "Velcro USA Inc.",
      "asin": "B0006HWYJM",
      "brand": "VELCRO Brand",
      "features": [
        "PROFESSIONAL GRADE ADHESIVE FASTENERS: These industrial strength hook and loop fasteners provide strong holding power designed for heavy-duty applications; safely holds up to 10 pounds",
        "WATER RESISTANCE PROVIDES UNMATCHED VERSATILITY: With heavy-duty strength, these fasteners make the ultimate organization tool for mounting, hanging, storing, or securing items indoors or outdoors; adheres to most surfaces in the house and garage",
        "LONG LASTING DURABILITY: Easy stick-on application is ideal for a broad range of surfaces and applications; special sticky back adhesive provides a secure and long-lasting hold",
        "DESIGNED FOR TOUGH APPLICATIONS: Super strong, superior holding power allow these adhesives to securely fasten to smooth surfaces including plastic, glass, metal, and painted wallboard",
        "NO TOOLS REQUIRED: No hammer, drilling, nails, or epoxy necessary, hook and loop industrial strength fasteners feature an easy peel and stick application, it’s the simple solution to organize on many surfaces without putting holes in the wall"
      ],
      "description": "Product Description\n\nIndustrial Strength Hold The VELCRO Brand Professional Grade Heavy Duty Fasteners feature a strong, superior hold for securing items indoors or outdoors. The superior holding power of these Industrial Strength hook and loop tapes are ideal for extreme conditions and for items that require a little extra holding power. Designed for use in a wide range of indoor or outdoor applications, the range of Professional Grade Fasteners provides an easy application with the security and peace of mind that items will be safe stored, securely affixed, and protected. Choose from a Variety of Industrial Strength Hook and Loop Options Whether seasonal items need to be stored in the garage or basement, tools hung in the outdoor shed, lights affixed in the outdoor patio, or toll transponder held to a vehicles dashboard, VELCRO has the solution for your heavy duty needs. These fasteners are designed to maintain long-term attachment when they are infrequently opened and closed. VELCRO Industrial Strength Fasteners provide a secure and reliable hold for use at home, office, car, garage, or anywhere a strong hold is required.\n\nFrom the Manufacturer\n\nIndustrial-strength Velcro tape is 50% stronger than conventional sticky-back tape. Allows you to fasten heavier items indoors and outdoors.",
      "parentTitle": "VELCRO Brand Industrial Strength",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "OVERTURE PLA Filament 1.75 mm Consumption, 1 kg Filament (2.2 lbs), Dimensional Accuracy 99% Probability +/- 0.02 mm, for 3D Printers (Purple)",
      "imagesCSV": "41Ct-m-SPJL.jpg,519aLWN4t7L.jpg,51acE61zg2L.jpg,411KPqTFPHL.jpg,51xnb1FhjXL.jpg,71lhNYrg3AL.jpg,41Ox+jHeqPL.jpg,41EYqjkKbWL.jpg",
      "manufacturer": "OVERTURE",
      "asin": "B0DHGN5SCM",
      "brand": "OVERTURE",
      "features": [
        "Clog-free and bubble-free: designed and manufactured with clog-free patent to ensure a smooth and stable printing experience with these PLA refills. Fully dry for 24 hours before packing and vacuum sealing with desiccant in a clear bag",
        "Less tangling and easy to use: Fully mechanical winding and strict manual testing to ensure that the line is clean and less tangled to avoid possible tearing and tearing of the line; the design with larger inner diameter of the spool makes retracting smoother",
        "Dimensional accuracy and consistency: advanced CCD diameter measurement and self-adjusting control system in production guarantee these PLA filaments with 1.75 mm diameter, accuracy +/- 0.02 mm; 1 kg spool (2.2 lbs)",
        "Cost-effective and wide compatibility: With over 8 years of experience in the research and development of 3D filaments and thousands of tons of filaments issued every month, Overture is able to produce all types of filaments on a large scale in premium quality, which contributes to the overture filament cost - effective and reliable for most common 3D printers such as MK3, Ender 3, Monoprice Monoprice Monge and more",
        "【LIFETIME WARRANTY】No matter when or why you need to replace or refund, we will help you! No risk to give us the chance to prove that we are your reliable supplier of 3D filaments / accessories / 3D printers / 3D pens"
      ],
      "description": "N/A",
      "parentTitle": "OVERTURE PLA Filament 1.75mm 3D Printer Consumables, 1kg Spool (2.2lbs), Dimensional Accuracy +/- 0.02 mm, Fit Most FDM Printer",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "1000PCS 3 ply black disposable face mask breathable face masks",
      "imagesCSV": "61B8jXYAR6S.jpg,619b+EhnEuS.jpg,81f0cXURPgL.jpg,41pU8VbhEUS.jpg,61eeGC7bnvS.jpg,51e9h2QNx7S.jpg,515Wx-OiV4L.jpg",
      "manufacturer": "N/A",
      "asin": "B08C7BJTRB",
      "brand": "NNPCBT",
      "features": [],
      "description": "N/A",
      "parentTitle": "Black Disposable Face Masks",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "NEENCA Knee Brace for Women & Men, Medical Knee Support with Patella Pad & Side Stabilizers, Knee Compression Sleeve for Knee Pain, Meniscus Tear, ACL, Joint Pain, Runner, Workout - FSA/HSA Eligible",
      "imagesCSV": "81X8ES3rpSL.jpg,81fIG9Xs4bL.jpg,91XgVFp56OL.jpg,71TsPgYI9TL.jpg,81tP2b-R9qL.jpg,81B47uAwRUL.jpg",
      "manufacturer": "NEENCA",
      "asin": "B0CHW3NS7G",
      "brand": "NEENCA",
      "features": [
        "🎁 Best Gifts Idea For Your Friends And Family! 🎁— Professional Patented Knee Support with Patella Gel Pad & Side Stabilizers, Medical Compression Knee Sleeve with FSA or HSA Eligible, ELITE Knee Brace for Women & Men. BEST CHOICE for Knee Pain Relief and Sports Protection - Day & Night Comfort Wear. Class 2 Medical Device for Pre-operative Preparation and Post-operative Recovery — Doctor Recommended!",
        "EXCLUSIVE PATENT— Spring knee support technology: An anatomically contoured patella gel pad surrounds your kneecap, dual spring stabilizers fit tightly with your knee joint. These special functional element strengthen side support and maintain joint stability, It effectively disperses knee pressure, keeping your knee warm, which will prevent potential sports injuries without limit your performance! BEST CHOICE for sports protection and knee pain relief.",
        "INSTANT PAIN RELIEF— Innovative functional fabric has the effect of keep knee warm and reduce stiffness, inflammation and swelling, speed oxygen flow. This knee brace disperse the pressure and improves circulation around knee area, wrap around patella to enhance the stability of kneecap and relax tendons, prevent muscle strain. Relieve ACL, MCL, PCL pain, prevent ligament injury, meniscus tear, swelling, inflammation and so on. Class 2 Medical Device—Doctor Recommand!",
        "UPGRADED DESIGN— Adopt the Anti-Inflammatory Therapy, overcome the defects of similar products, medical knee sleeve with no allergies and itchiness. With high-elastic tight breathable compression fabric to fit perfectly with your knee curve, 3D structure of woven, high-precision knitting cutting technology. Side spring stabilizers on both sides and patella gel pad won't fall off even for long-time using, Anti-slip gel strips avoid slip or roll during exercise, It will stay in place all day!",
        "INNOVATIVE TECHNOLOGY— It works by applying targeted even compression to your knee, which help joint and muscle pain relief and faster recovery after intense workouts or injuries, scientifically proven to help improve poor blood circulation & increase oxygen flow to optimize the natural healing process, and reduce inflammation for knee pain relief from acute or chronic joint injuries. It is Perfect for Pain Recovery or Workout!",
        "BETTER PERFORMANCE— We got a well balance between compression and comfort. The air knit fabric can instantly absorb and evaporate lots of sweat, circular breathing. Breathable, fast-dry and lightweight. You can wear it under jeans or leggings and sleep with it, thicker than other knee protectors to provide extra reinforcement without sacrificing comfort, so you can wear them all day long!",
        "MULTIFUNCTION— Ideal for high performance training, sports & exercise & workout. Premium elite knee support for knee pain relief, meniscus tear, Arthritis, ACL, PCL, MCL, joint pain, sport injury and post-op recovery, swelling... Widely used in many sports such as basketball, running, jogging, volleyball, gym, tennis, hiking, workout, weightlifting and more. Unisex for Women & Men and suitable for both left and right legs. Full refund for any reason, please refer to size chart for best fit."
      ],
      "description": "N/A",
      "parentTitle": "NEENCA Professional Knee Brace for Pain Relief, Medical Knee Support with Patella Pad & Side Stabilizers, Compression Knee Sleeve for Meniscus Tear, ACL, Joint Pain, Runner, Workout - FSA/HSA Eligible",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Homax Steel Wool Fine Grade #0 Pack of 12 and Medium Grade #1 Pack of 12 for Cleaning, Polishing, and Refinishing",
      "imagesCSV": "51ftrL0-JiL.jpg,61jvN4K7l4L.jpg,71D8s3KtcCL.jpg,61SwAnmPCvL.jpg",
      "manufacturer": "N/A",
      "asin": "B0D2VXGLTG",
      "brand": "Homax",
      "features": [
        "Pack of 12 fine grade #0 steel wool pads for cleaning between tiles and coats of paint or varnish",
        "Also includes 12 medium grade #1 steel wool pads ideal for household cleaning and refinishing",
        "Steel wool manufactured in China using high quality metal strands with gentle abrasiveness",
        "Flexible pads easily reach corners and crevices while cleaning or preparing surfaces",
        "Great value bundle for all your steel wool cleaning needs around the house"
      ],
      "description": "This product bundle includes 12 pads of fine grade #0 steel wool (Homax-33873211105) and 12 pads of medium grade #1 steel wool (Homax Steel Wool, 12 pad). The fine grade steel wool is manufactured in China and can be used to clean grout between tiles, while the medium grade steel wool features uniform metal strands and is gentle enough for household use on surfaces like wood, copper, paint, linoleum, and more. With versatile cleaning and polishing abilities, this bundle offers a combined 24 pads of high quality steel wool in two complementary grits - the fine grade for more delicate tasks like smoothing finishes between tiles, and the medium grade for general household cleaning, polishing, buffing and refinishing jobs. Together they provide a complete steel wool solution for DIYers and cleaning enthusiasts.",
      "parentTitle": "Homax Rhodes American Metal Polishing Steel Wool",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Art3d Double-Sided Tape (10FT), Removable, Traceless, Washable, Reusable - Multipurpose Tape as Seen on TV (1/12\" x 1/2\" x 10', 4)",
      "imagesCSV": "41zRbZYzUIL.jpg,41g75nOSQ+L.jpg,41f543e-elL.jpg,516KnYQ6j8L.jpg,31gBbZjsyWL.jpg,41NK0tH5-qL.jpg,41rRD2RcidL.jpg",
      "manufacturer": "Art3d",
      "asin": "B0B2PHG55W",
      "brand": "Art3d",
      "features": [
        "Strong Adhesion: It's made of the latest material: gel-acrylic, the adhesion is 3 times of the regular adhesive tape",
        "User-friendly: Adopted the nano-micro-molecular technology, it's removable, residue-free, reuseable after washing, recyclable",
        "Damage-free: Compared to traditional fixing methods screw, nail, it will not damage your attached objects. Leave no trace after removal",
        "Multipurpose: It can be used in home, office, car for wall hanging, applicance fixing, wall panel and carpet installation"
      ],
      "description": "Art3d heavy-duty Nano tape adopt the nano-micro-molecular technology which offers a powerful adhesion almost on any surfaces and yet removable, reusable, and no residue.It’s versatile and multipurpose which can be used for pictures hanging, accessories and home appliance fixing, wall panel and carpet installation. The gel-like thick tape can compromise any textured surfaces in the extreme weather. It’s suitable for indoor and outdoor application",
      "parentTitle": "Art3d Heavy Duty Double Sided Tape (3M), Removable, Traceless, Washable, Reusable - Versatile Tape As Seen On TV",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Methylene Blue Pharmaceutical Grade 2oz– USP Grade 1% Solution with Balanced Electrolyte SolutionThird-Party Tested Brain Health Supplement for Humans –No Formaldehyde High Cognitive Support",
      "imagesCSV": "81OM1UkdY6L.jpg,715n93qEQwL.jpg,71D4VSvpn-L.jpg,71MLbUJx0BL.jpg,71jYQ5KaXxL.jpg,71V2Qab8uOL.jpg,713IJHUrdKL.jpg,71JTS-pogbL.jpg",
      "manufacturer": "Artnaturals",
      "asin": "B0DWZNJBF7",
      "brand": "Artnaturals",
      "features": [
        "Our USP Grade 1% Methylene Blue solution is meticulously crafted to enhance brain health, supporting improved memory, focus, and overall cognitive function.",
        "Balanced Electrolyte Infusion for Optimal Cellular Hydration Enriched with a precise blend of electrolytes, our formula ensures optimal hydration, aiding in nerve function and maintaining fluid balance within cells.",
        "Third-Party Tested for Uncompromising Purity and Safety Every batch undergoes rigorous third-party testing to confirm its purity and potency, ensuring a safe and effective supplement you can trust.",
        "Formaldehyde-Free Formula for Clean Supplementation Committed to your well-being, our methylene blue solution contains no formaldehyde, providing a clean and safe choice for daily cognitive support.",
        "High Purity Solution to Support Mitochondrial Health Our high-purity methylene blue supports mitochondrial function, enhancing cellular energy production and promoting overall brain health."
      ],
      "description": "N/A",
      "parentTitle": "Methylene Blue Pharmaceutical Grade 2oz– USP Grade 1% Solution with Balanced Electrolyte SolutionThird-Party Tested Brain Health Supplement for Humans –No Formaldehyde High Cognitive Support",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Holikme Bottle Brush Tube Cleaning Lab Set with Long Handle, Cup Cleaner for Washing Narrow Neck Beer Wine Decanter Pipes Lids Sinks Cap Covers, Pink",
      "imagesCSV": "71YNR5LDkhL.jpg,71LHDTGH9HL.jpg,71SGo7CdXdL.jpg,71KViWHb0XL.jpg,71nb2c3q8zL.jpg,71eQ3+llEVL.jpg,71pYhMZ++hL.jpg",
      "manufacturer": "Holikme",
      "asin": "B0CL6695FB",
      "brand": "Holikme",
      "features": [
        "Bottle cleaning brushes with multiple usage includes 7.9-12.5 inches straw tube cleaning brushes, 16 inches long handle beer bottle brush, 14 inches sports water bottle brush, 10 inches multifunction sponge brush and 4.3 inches spout cleaning brush; You can hang them on hook for drying and storage.",
        "16 inches extra long cleaning brush with 2.45 inches extra wide bristles can easy reach the bottom and clean all inside area, perfect for long narrow neck wine, beer bottles and hummingbird feeder.",
        "10 inches sponge bottle brush is made of high quality and soft material; It is great for washing all standard and wide neck decanter, glass mugs and sport bottles.",
        "14 inches sports water bottle brush with hard bristles can easily remove stubborn stains; You no longer have to be crazy about cleaning coffee cup, tea stain and kettle water stain; Firm and sturdy handle makes the cleaning job easier.",
        "4.3 inches spout cleaning brush and straw brushes (7.9 inches, 9.8 inches, 11.8 inches, 12.5 inches) are made of food grade polypropylene, no peculiar smell; An excellent helper for your kitchen."
      ],
      "description": "N/A",
      "parentTitle": "Holikme Bottle Brush",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Lint Rollers for Pet Hair, Sticky, Remover for Couch, Clothes Furniture and Carpet. Dog Hair Remover Cat Hair, Animal Fur, Fuzz. 5 Large Lint Rollers",
      "imagesCSV": "81amaGFWTVL.jpg,71ujtu66RxL.jpg,81h2MzgT19L.jpg,71E7FU21UoL.jpg,81Nhl28CgRL.jpg,818MXC9RhLL.jpg",
      "manufacturer": "Polardo",
      "asin": "B07R5S96P2",
      "brand": "Polardo",
      "features": [
        "Sticky & easy peel off: excellent roller for picking up dust, dirt, lint and removing pet hair. The sticky and easily removable sheets will save you tons of time and energy. Forget about going over the same spot again and again. Instantly pick up dirt and shards even from your most delicate things. Spend no more than a second to effortlessly replace sheets.",
        "Lightweight, compact & ergonomic design: featuring travel size and lightweight body, these lint rollers for clothes will easily fit in your handbag or your car's glove compartment so you always look presentable on the go. Keep your clothes lint free, especially in the office, at business meetings or while traveling. New upgraded ergonomically designed handles make cleaning easy thanks to the effortless 360° back and forth rotation.",
        "Multi use: this pack of lint rollers will serve as a perfect assistant in your home, car and office. It can tackle everything from curtains to car seats, and anything in between. Effective for clothes, furniture, sofas, carpets, bed sheets, etc. Does your pet's hair cling to furniture and clothes even though you brush it every day? Our dog & cat hair lint roller will finally help you deal with the fur situation!",
        "450 sheets: Polardo lint rollers come with 2 reusable ergonomic grip handles that comfortably fit in your hand, five refills of 90 sticky easy peel off spiraled sheets. With two rollers, you can use one at home and the other at your office or during trips. Total 450 sheets in one package with great value.",
        "In case you have questions, do not hesitate to reach our team. We are here to help you make the right choice. Just drop us a line, and we’ll answer you as soon as possible."
      ],
      "description": "N/A",
      "parentTitle": "Lint Rollers",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "MED PRIDE Medical Vinyl Examination Gloves (X-Large, 1000-Count) Latex & Rubber Free, Ultra-Strong, Clear Disposable Powder-Free Gloves for Healthcare & Food Handling Use",
      "imagesCSV": "71nkgOcY3NL.jpg,81OKU1vz2bL.jpg,71ruS8nCwtL.jpg,71kD9Qv5-cL.jpg,710LlMsOB-L.jpg,71Sd3xNL+mL.jpg,71gvD+l+bRL.jpg,81Y8mW+-f0L.jpg",
      "manufacturer": "Shield Line",
      "asin": "B07KYWPF1M",
      "brand": "MED PRIDE",
      "features": [
        "Disposable Gloves: These gloves are disposable and latex-free for food handling and medical use.",
        "Strong and Durable: Made from polyvinyl chloride and rubber for a durable and strong grip.",
        "Clear Vinyl: The gloves are made of clear vinyl for easy visibility and identification.",
        "Ambidextrous Design: These gloves have an ambidextrous design for right or left hand use.",
        "Hand Washable: The gloves can be hand washed for easy cleaning and sanitation."
      ],
      "description": "N/A",
      "parentTitle": "MED PRIDE Medpride Medical Vinyl Examination Gloves | Latex and Powder Free | Disposable, Ultra-Strong, Clear",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Supmedic Disposable Nitrile Gloves, Chemical Resistant, Powder-Free, Latex-Free, Food Safe, Medical Exam Gloves, Black, X-Large, 100 Pcs",
      "imagesCSV": "81ab9nKmoML.jpg,713Cd1a0EBL.jpg,71fDVCgnbrL.jpg,71yf+Myc0JL.jpg,71ipIRR-68L.jpg,81EI5jmVN5L.jpg,71eGwFN692L.jpg,71ZD2VHQbHL.jpg,71t80SFdreL.jpg",
      "manufacturer": "N/A",
      "asin": "B0D6JB5KVV",
      "brand": "Supmedic",
      "features": [
        "MEDICAL-GRADE 3.5 MIL - Supmedic nitrile gloves deliver hospital-level barrier & tactile feel - 40 % thicker than typical food gloves.",
        "ALLERGY SAFE – 100% Powder-free & Latex-free gloves eliminates common allergies; skin-friendly material passes EN455 irritation testing for worry-free wear on sensitive hands.",
        "TEXTURED GRIP – Micro-roughened fingertips plus smooth palms keep a confident hold on instruments, wet dishes or oily parts without sacrificing dexterity.",
        "VERSATILE PACK – 100 ambidextrous gloves dispense one-handed from the top-load box; perfect for clinics, dentistry, food prep, cleaning, auto repair, beauty salons, pet care and more.",
        "SUPPLIER-DIRECT VALUE - Produced in Supmedic's facility and Prime-fulfilled for fastdelivery; upgrade to 100 or 1000 count cases and save up to 40 % per glove."
      ],
      "description": "N/A",
      "parentTitle": "Supmedic Disposable Nitrile Gloves, Powder-Free Latex-Free Food Safe Exam Gloves for Medical, Cooking, Tattoo, Black 100 Pcs",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "ADIIL 12 PCS Q Hanger Hooks with Safety Buckle, Windproof Screw Hooks for Hanging Outdoor String Lights, Plants, Christmas Patio Lights, 2.2 Inches, Black",
      "imagesCSV": "71tTbeteXKS.jpg,61uRb8+qhzS.jpg,716vnYrN+qL.jpg,81qCuxjadVL.jpg,61mhxMV5EHL.jpg,71hryUIYp6S.jpg,81A0GjXS-SS.jpg",
      "manufacturer": "ADIIL",
      "asin": "B096G4JHR9",
      "brand": "ADIIL",
      "features": [
        "Safety Buckle Design: Add safety buckle design to prevent hanging objects from falling, even in high wind. Compared with ordinary ceiling hooks, the q hanger hooks are weatherproof and wind resistant, suitable for hanging outdoor patio string lights. No worry about items being knocked off, more secure",
        "Sturdy and Strong: The outdoor light hooks are 2.2 Inches, made of metal with black rustproof coating, suitable for indoor and outdoor use. Q hanger screw hooks are heavy duty, can hold a good amount of weight up to 40lb, can last many years",
        "Easy to Install and Use: String light hooks are easy to install. You can screw the hooks into the wood by hand or with a wrench, or use an electric drill to drill a 0.24 inch hole in the concrete wall, plug the expansion tube into it, finally use a wrench to screw the hook in. Great for patio, roof, deck, ceiling, porch, balcony, tree, fence, and more",
        "Widely Used: Outdoor hanging hooks are windproof, strong. You can use them literally anywhere! Suitable for outdoor string lights, patio lights, Christmas lights, plants, fairy lights, bird feeders and houses, flower pots, wind chimes, icicle lights, deck lights, mugs, and decorations",
        "Package Includes: 12 PCS screw in hooks and 12 PCS plastic tubes"
      ],
      "description": "N/A",
      "parentTitle": "ADIIL Q Hanger Hooks with Safety Buckle, Windproof Screw Hooks for Hanging Outdoor String Lights, Plants, Christmas Patio Lights, 2.2 Inches",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "WD-40 Specialist Penetrant with Smart Straw, Penetrant for Metal, Rubber and Plastic Threads, Locks and Nuts, Industrial Strength Fast-Acting Formula, 11 Oz.",
      "imagesCSV": "71ZC7ay+mHL.jpg,71aYgz5KxfL.jpg,616gqWnKmxL.jpg,71Q5wqNVoxL.jpg,714Eso7Ji8L.jpg",
      "manufacturer": "The WD-40 Company",
      "asin": "B00631GQGW",
      "brand": "WD-40 Specialist",
      "features": [
        "Everything you need in a professional-grade Penetrating Lubricant: Low-odor, Strong, Fast, and Targeted. WD-40 Specialist Penetrant with a Smart Straw to Spray 2 Ways",
        "Fast-acting formula breaks rust and corrosion that jam up parts and leaves behind a protective layer that prevents future corrosion",
        "If it's stuck, WD-40 Specialist Penetrant can help - nuts, bolts, threads, locks, chains, and more",
        "Target the smallest crevices between threads or cover large areas as easily with the Smart Straw sprays 2 ways: Regular or Precise, Wide or Narrow, Broad or Targeted",
        "Experts around the world trust WD-40 Specialist formula to deliver professional grade protection every single time"
      ],
      "description": "Less time fixing and more time enjoying. WD-40 Specialist Penetrant makes it easy to quickly get the job done right so you bask in your accomplishment and move on. Professional-grade WD-40 Specialist Penetrant formula works fast to break the toughest jams and protects parts from future rust & corrosion. Leaves a thin protective layer that prevents future corrosion without attracting dust or other particles. Designed with safety in mind: Low odor formula, VOC compliant in 50 states. Backed by the excellence of WD-40, the world leader in residential and commercial lubricants. Effective in breaking bonds for most materials - metal, rubber, plastic and more. Penetrates up to 2x faster than the competition* - Penetrates rust to free up stuck, frozen, or seized equipment and parts - Safe to use on metal, rubber and plastic parts - Ideal for use on nuts, bolts, threads and locks - 50-state VOC compliant. *Test Lab: Fred Cuneo (3rd Party); Nail Climb Test; Test date: 03/2021. **Test Lab: WD-40 Co. Technical Center (Pine Brook, NJ); ASTM B117; Test date: 02/2021.",
      "parentTitle": "WD-40 Specialist Penetrant",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "4 Pcs Coffee Syrup Pump Dispenser Set - Syrup Pumps for Coffee Bar 750ml Bottles with Food-Grade Plastic Adjustable Tube, Lockable Mechanism - Accurate Dispensing, Easy Cleaning for Various Liquids",
      "imagesCSV": "71A85cqWpyL.jpg,81TQH61dGIL.jpg,81mdtZI2ChL.jpg,81+mbZelkTL.jpg,819nHLkFmIL.jpg,81PfvMbbfAL.jpg,818thEDCpUL.jpg,81G8Rgqfs0L.jpg,81zsXNj5b5L.jpg",
      "manufacturer": "ALPENKOK",
      "asin": "B0BX4LHTH9",
      "brand": "ALPENKOK",
      "features": [
        "Food-Grade Material: Made from food-safe plastic, this coffee flavor pump is lightweight, durable, and resistant to wear, ensuring safe and mess-free dispensing of syrups, sauces, and other liquids",
        "Sleek & Mess-Free Design: With a stylish appearance, this coffee syrup dispenser for coffee bar fits perfectly on 750ml bottles, providing a stable, controlled pour for coffee bars, homes, and cafes",
        "Effortless Dispensing: Simply screw onto the bottle, push coffee pumps for syrup bottles, and enjoy a smooth flow — each press dispenses about 0.3 oz (10 ml) of syrups, sauces, or condiments",
        "Quick & Easy Maintenance: Designed for simple maintenance, our coffee syrup pumps for syrup bottles can be easily rinsed and reused, ensuring a clean and hygienic coffee bar or kitchen at all times",
        "Versatile Applications: Ideal for coffee syrups, honey, and flavored liquids, our coffee syrup pumps dispenser works great for coffee shops, home use, tea stations, milkshakes, and dessert toppings"
      ],
      "description": "N/A",
      "parentTitle": "Pump Dispenser Parent",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "FYY Over The Door Hooks, 4 Pack Upgraded Long Door Hangers Hooks with Rubber Prevent Scratches Heavy Duty Organizer Hooks for Hanging Clothes, Towels, Hats, Coats, Bags Pink",
      "imagesCSV": "51pdTdCP+vL.jpg,61KgsYJpptL.jpg,61osn3e+LYL.jpg,61ELHVlCFDL.jpg,716HoVs8CBL.jpg,71A8Cdwe2mL.jpg,61sX5b1SqFL.jpg",
      "manufacturer": "FYY",
      "asin": "B0CCRRDQ94",
      "brand": "FYY",
      "features": [
        "High Quality: Our over the door hooks are made of heavy duty metal, which is durable and rust-resistant, will not deform and ensure a long-lasting performance. Each hook can hold up to 30lb",
        "Upgraded Size: This over the door hanger hooks length 7.8 inch, groove width 1.7 inch, fit most of doors which widths range of 0.7-1.7 inches, which perfectly fit more doors and help you reach the over door. Please measure your door before purchasing",
        "Soft Rubber: The door organizer hooks are built with soft rubber, non-slip and smooth surface keep the hooks in place without swinging and protect the doors or clothing from scratch",
        "Wide Application: The over the door hooks can be applied to most door in your house, fit doors of living room, bathroom, shower room, bedroom, kitchen or closets. Prefect for hanging clothes, towels, hats, coats, bags, etc. The hooks convert your doors into a convenient storage space and keep your room organized without messy",
        "What You Will Receive: Package will come includes 4 pack over the door hooks. If you have any questions of our product, please feel free to contact us"
      ],
      "description": "N/A",
      "parentTitle": "FYY Over The Door Hooks",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Dealusy 50 Pack (100-Piece) 24 oz Meal Prep Containers Reusable with Lids, Sturdy Leakproof & Food Safe, Microwave, Freezer, Dishwasher Safe Prep Containers, To Go Take Out Plastic Food Storage",
      "imagesCSV": "71oB3+94jBL.jpg,71AoGACdQyL.jpg,71aFB3bH9BL.jpg,71-vblxEt9L.jpg,71CZ1hieTlL.jpg,71yLDF6vICL.jpg,716Ex+1zYtL.jpg",
      "manufacturer": "Dealusy",
      "asin": "B0D3HYC8H1",
      "brand": "Dealusy",
      "features": [
        "【Sturdy & Reusable】Made of premium thick plastic and strong construction, Dealusy meal prep containers with lids ensure no cracks for your take out meals. They can also be easily cleaned for reuse with hand wash or on the top rack of the dishwasher.",
        "【Leakproof & Stackable】: These food prep containers come with tight sealed lids, you can easily stack them and won’t worry that the food would leaks or spills.",
        "【Microware Safe & Freezer Safe】: Made of premium food grade plastic, these BPA-free disposable food containers can withstand a temperature from -40℉to 250℉, totally Microware Safe & Freezer Safe.",
        "【Convenient Use】: With the pre-set volume of these disposable food containers, you can easily pack your healthy meals, vegetables and fruits without measuring your portions. Great for taking your meals out for school, work, gym or a camping trip.",
        "【50 Value Package】: This value package includes 50 pack (100-Piece) 24 oz meal prep containers with lids. They are the perfect choice for your daily meal preparation."
      ],
      "description": "Dealusy 50 Pack (100-Piece) 24 oz Meal Prep Containers Reusable with Lids, Sturdy Leakproof & Food Safe, Microwave, Freezer, Dishwasher Safe Prep Containers, To Go Take Out Plastic Food Storage",
      "parentTitle": "Dealusy Meal Prep Containers with Lids 24 oz, 28 oz, 32 oz, 38 oz",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Uineko Plastic Spray Bottle (4 Pack, 16 Oz, All-Purpose) Heavy Duty Spraying Bottles Leak Proof Mist Empty Water Bottle for Cleaning Solution Planting Pet with Adjustable Nozzle and Measurements",
      "imagesCSV": "61ID9zOp1qL.jpg,615kHu7Ys5L.jpg,61K5sNuMXVL.jpg,61jmqTVi+YL.jpg,61CLkjGWN9L.jpg,71HegyIZWXL.jpg,715s3kkpjsL.jpg,61M0WUDZ0kL.jpg",
      "manufacturer": "Uineko",
      "asin": "B07MCBD77K",
      "brand": "Uineko",
      "features": [
        "ADJUSTABLE NOZZLE - From a fine mist to a solid stream, the sprayer can be easily adjusted to suit your needs. Be prepared to tackle any job with a simple twist of the nozzle! Avoid waste with our extra-long tube that'll spray every last drop out!",
        "CHEMICAL RESISTANT - The heavy-duty 16 oz (about 500 ml) sprayer bottle is chemically resistant to hold up against harsh chemicals and solvents. On the side of each bottle is a checklist to stay organized and remain informed as to what the bottle contains. (Also comes with labels to meet your need, please store the spray bottle with liquid in an upright position to prevent nozzle damage)",
        "UPGRADED SPRAY HEAD & LEAK PROOF - Our sprayer features a long lasting polypropylene spray head, tight and secure cap closure, internal cap gasket, 302 stainless steel spring and a precision valve and piston, for a no clog and no leak experience; A proven and reliable no leak venting system primes quickly and stays primed.",
        "HOUSEHOLD-COMMERCIAL-INDUSTRIAL USES - Our spray bottles for multi purpose uses. Use them for cleaning solutions around the house, pet, cat, lawn and garden, misting and watering plants, succulents, herbs, ironing, laundry, car detailing, janitorial. Make your own homemade diy cleaner mister or just use with water to cool yourself.",
        "BETTER TRIGGER DESIGN - The unique design 4-finger trigger makes your fingers rest easily on it and the bottle fit comfortably in your hand, eliminating hand fatigue; Adjustable red nozzle turns easily letting you switch from mist, stream or to off; Pull trigger has a short effortless squeeze reducing finger fatigue."
      ],
      "description": "N/A",
      "parentTitle": "Uineko Plastic Spray Bottle (4 Pack, 24 Oz, All-Purpose) Heavy Duty Spraying Bottles Leak Proof Mist Empty Water Bottle for Cleaning Solution Planting Pet with Adjustable Nozzle and Measurements",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Resolve Ultra Pet Odor and Stain Remover Spray – Carpet Cleaner for Cat and Dog Urine and Poop, 32oz",
      "imagesCSV": "71-jXBfgbcL.jpg,81pVQ-ypQnL.jpg,81wK2+iXCrL.jpg,81+Jsuf7Y3L.jpg,81WA-DKT-EL.jpg",
      "manufacturer": "Reckitt Benckiser",
      "asin": "B07FKKP72W",
      "brand": "Resolve",
      "features": [
        "DESTROYS STUBBORN STAINS THE FIRST TIME: Penetrates deep to lift and remove tough pet stains.",
        "SUITABLE FOR USE AROUND PETS: Suitable for use around pets when used as directed.",
        "MULTIPURPOSE USE: Effective of carpets, upholstery, and area rugs for versatile cleaning.",
        "OXI+ODOR STOP TECHNOLOGY: Removes odors and leaves your home smelling fresh.",
        "FROM THE #1 PET MESS CLEANING BRAND: Trusted by pet owners for superior cleaning performance."
      ],
      "description": "At Resolve, we love our furry friends as well and we understand that keeping your carpets clean can be challenging. Resolve Ultra Urine Stain and Odor Eliminator, for Pet Messes, which helps you take care of these accidents. Penetrates Deep, to break down, lifts & permanently removes tough urine stains Powerful Odor Stop Technology. Permanently Eliminate urine odors Discourages Pet Re-soiling.",
      "parentTitle": "Resolve Ultra Pet Stain & Odor Remover Spray",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "eureka NEU182A PowerSpeed Bagless Upright Vacuum Cleaner, Lite, Blue",
      "imagesCSV": "61hvIu2Qy+L.jpg,71ChxBn5pFL.jpg,71y+XOc07bL.jpg,81e2XZ5XiqL.jpg,81OARFdWwOL.jpg,71nRVFlGYuL.jpg,710B7Dy4vJL.jpg,61h9BM-cDhL.jpg,71EIU1gipVL.jpg",
      "manufacturer": "Midea Floorcare",
      "asin": "B07B2TNKL3",
      "brand": "Eureka",
      "features": [
        "Powerful vacuum cleaner; The dynamic motor and brush roll can lift stubborn and heavy debris; plus, the 12.6” wide nozzle cleans more with a quickness.",
        "Lightweight 10 lbs upright vacuum; The Eureka Power Speed is pretty lightweight and easy to maneuver; designed for whole home clean.",
        "With 5 height adjustment; It works well on carpets, shag rug, hard floors etc.; smooth wheels ensures hardwood floors won’t sustain scratches or gouges.",
        "Extra-large 2.6L capacity; The extra-large dust cup holds more dirt and requires less frequent emptying; clean more, empty less.",
        "Multiple accessories included; A quick-release handle connected to the stretch hose for above-floor cleaning; a crevice tool, dusting brush, and upholstery tool for hard-to-reach areas."
      ],
      "description": "We know you value a clean home and Eureka is proud to offer whole home cleaning solutions to make life a little easier.\nOur Eureka PowerSpeed upright vacuum cleaner is the ultimate cleaning companion! This lightweight yet powerful vacuum makes cleaning a breeze. The large-capacity dust cup and washable filter free you from stop and empty the vacuum or purchase new filters.\nThe five height adjustments function, wide nozzle and multiple accessories make this vacuum perfect for various surfaces. Use it to clean carpets, rugs, hardwood floors, cars, ceilings, lampshades, furniture, and more!\nWhether you're searching for a handheld vacuum or apartment essentials for your first apartment, this vacuum has got you covered. Don't settle for a vacuum that only cleans floors - order now and experience the difference!\nActual product may vary in handle material due to manufacture issue. It might be original plastic or metal.\nIf you have any questions, contact our customer service team at 1-800-282-2886.\nWarning: When using the vacuum cleaner, the floor brush may be clogged by hairs and dirt. We recommend cleaning the roller brush and the belt every 2 weeks.\nLong-term failure to clean may cause malfunction, or even risk of smoke and belt broken.",
      "parentTitle": "Eureka PowerSpeed Lightweight Upright Vacuum Cleaner for Carpet and Hard Floor, Powerful Bagless Upright Vacuum Cleaner for Home Pets",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Etekcity Infrared Thermometer 1025D (Not for Human) Dual Laser Temperature Gun-58℉~1022℉ (-50℃~550℃) with Adjustable Emissivity, Non-Contact Voltage Tester (NCV), Standard Size, Yellow & Gray",
      "imagesCSV": "71apR7HuAlL.jpg,81+Ids-cQZL.jpg,91XOOGNPDyL.jpg,81OtH4GFNxL.jpg,81HopcZvDRL.jpg,81l+DUvcV3L.jpg,811xgUr+S1L.jpg,81uIq8gFzTL.jpg,81iq+MeEJ9L.jpg",
      "manufacturer": "thermometer",
      "asin": "B0727WYCYF",
      "brand": "Etekcity",
      "features": [
        "NOT FOR HUMAN: Temperature readings from this device are inanimate objects. The measured temperature for humans or animals will not be correct, 9V battery included. Class 2 laser, optical power 0.3-0.49Mw",
        "BETTER ACCURACY : 12:1 distance to spot ratio allows you to measure temperatures ranging from -58°f to 1022 °F (-50°c to 550 °C) from a safe distance, For best accuracy, the distance between the thermometer and object of measurement should approximately be 14.17 inches (36 cm)",
        "ADJUSTABLE EMISSIVITY AND MULTIFUNCTION: Adjust emissivity from 0.1-1.0 to improve the accuracy of your measurements across different types of surfaces. Other key features include: ºF and ºC capable, max measurement hold, automatic data hold, low battery indicator, and auto-off to save battery",
        "DUAL LASER: Dual laser technology and a less than 500ms response time makes it easier and faster to read the surface temperature being measured, which is more accurate than a single laser. With large-screen LCD display you can read temperature ever in the dark area",
        "VERSATILE USE: Check barbecue grills and skillets to see if they are the perfect temperature to cook food, perform home auto maintenance with ease, or use for commercial heating, ventilation, and air conditioning (HVAC) installation"
      ],
      "description": "Handy Versatility From air vents to hot water pipes to even car engines, the Etekcity Laser grip 1025D Infrared Thermometer has got you covered for accurate temperature measurements. The 12:1 distance to spot ratio allows you to measure extreme temperatures ranging from -50°F to 1022°F without being in harm's way. Non-Contact Voltage Detection Simply press the NCV mode button and point the 1025D Laser grip Thermometer to a terminal strip, outlet, or cord. When the thermometer beeps, it indicates the presence of live voltage. Electricians, maintenance professionals, and safety personnel can use the 1025D Laser grip Thermometer to quickly test for energized circuits and defective grounds—it’s ideal for any electrical professional or to have at home. Measure Adaptively Improve the accuracy of your results with adjustable emissivity on the thermometer. The emissivity of a material is its efficiency in emitting thermal energy (most organic materials and painted or oxidized surfaces have an emissivity of 0. 95). Non-reflective surfaces have a higher emissivity (closer to 1) than reflective surfaces (closer to 0). Other materials, such as polished metal surfaces, have a different emissivity level, which should be taken into account for accurate readings. Note: For best accuracy, the distance between the thermometer and object of measurement should be approximately 14. 17 inches (36cm); this device should only be used on inanimate objects for surface temperature. Specifications Temperature Range: -58ºF 1022ºF (-50ºC 550ºC) Accuracy: ≥100°C2% ≤100°C2°CDistance Spot Ratio: 12: 1Emissivity Adjustable: Adjustable (0. 1 to 1. 0)Response Time: ≤500msResolution: 0. 1℃ or 0. 1℉Storage Temperature: -4℉～122℉(-20℃～50℃ )Package Included1x Etekcity Laser grip 1025D thermometer1x 9V DC battery1x User's manual.",
      "parentTitle": "Etekcity Infrared Thermometer",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Fuchsia Hot Pink Nitrile Disposable Gloves - 50 Count - 3 Mil Nitrile Gloves X Large - Powder and Latex Free Rubber Gloves - Surgical Medical Exam Gloves - Food Safe Cooking Gloves",
      "imagesCSV": "71UB2KJyw7L.jpg,71bc85d+nZL.jpg,81VflH4ocvL.jpg,71jY94sQZJL.jpg,71ocdZ5BO2L.jpg,71Ibt+k-nfL.jpg,81hmyMbavpL.jpg",
      "manufacturer": "FifthPulse",
      "asin": "B0BKH1L2FL",
      "brand": "FifthPulse",
      "features": [
        "Non-Latex Gloves - These gloves disposable are latex free, perfect for use with people with allergies. Ideal for use with patients and clients who may have latex allergies.",
        "Examination & Food Grade - Perfect for doctors, nurses, and all medical uses, meal prep, and cleaning gloves in a home or commercial kitchens; they meet all medical or cooking gloves standards.",
        "Multi-Purpose Nitrile Gloves - These can be used for beauty salons, tattoo gloves, janitorial & household cleaning, gardening, science labs, epoxy & resin making, and more!",
        "Comfort & Dexterity - Designed to be as comfy as a glove, they also have textured tips that can be used on smartphone screens.",
        "Multiple Colors and Sizes - FifthPulse medical gloves come in navy, burgandy,yellow, green, lavender, blue, and black gloves, in S, M, L, and XL, and quantities of 50, 100, and 200 packs. Thousands trust our rubber gloves disposable."
      ],
      "description": "N/A",
      "parentTitle": "Fuchsia Hot Pink Nitrile Disposable Gloves - 3 Mil Nitrile Gloves - Powder and Latex Free Rubber Gloves - Surgical Medical Exam Gloves - Food Safe Cooking Gloves",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Mini Extra Sticky Lint Rollers for Travel - 150 Sheets Small Sized Portable Lint Removers for Pet Hair and Debris Pickup150",
      "imagesCSV": "81SbLliBtSL.jpg,81Whk+oFjoL.jpg,71AbWr8Y+iL.jpg,81zosj7bePL.jpg,71RcyVF9EUL.jpg,81d8zjjN9DL.jpg",
      "manufacturer": "Albatross Health New England",
      "asin": "B0CNPFTFX4",
      "brand": "Albatross Health New England",
      "features": [
        "Our travel and mini-sized sticky rollers are perfect for on-the-go use.",
        "Our extra sticky adhesive effectively picks up pet hair, dust, dirt, and lint.",
        "Designed for effortless 360° rotation, our rollers are frustration-free to use.",
        "Our travel rollers are designed for easy tearing, providing convenience for users.",
        "Backed by our satisfaction guarantee, our Customer Service team is ready to assist with any order issues."
      ],
      "description": "Lint Roller for Pet Hair Extra Sticky, Lint Roller Travel Size for Cat and Dog Hair Removal, 150 Sheets On The Go Lint Removing Tool, Travel Essentials",
      "parentTitle": "Extra Sticky Lint Roller",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Puracy Stain Remover Spray –The TikTok Laundry Pretreater Spray for Fresh and Set-In Clothing Stains Enzyme-Based - Natural Spot Cleaner - Free & Clear 16oz",
      "imagesCSV": "61M0Iye+1xL.jpg,81VPN6Gm-vL.jpg,7105DFygudL.jpg,718gBC2sLWL.jpg,71F3mJGXHoL.jpg,51yJlz0UcJL.jpg,51toFnE28-L.jpg,51I-VTdW45L.jpg",
      "manufacturer": "Puracy",
      "asin": "B08Y62FDZG",
      "brand": "Puracy",
      "features": [
        "Conquer Stains Like a Pro - TikTok's favorite laundry stain remover for clothes is for those who hate stains, whether it was made minutes ago or years ago. See for yourself why it's the go-to spot remover for clothes for millions of satisfied customers!",
        "Eliminate Dirt & Odor, Embrace Confidence - Puracy Stain Remover washes away hundreds of stains and odors, from grass to berries, sweat, oil, red wine, cosmetics, bodily fluids, grease, pet accidents, and more. It's tough enough to handle it all.",
        "Clean Anything that Can Get Wet - Our laundry stain removers' advanced 6-enzyme plant-based formula removes even the toughest stains from linens, bedding, carpets, mattresses, couches, clothes, car seats, and diapers. Trust us, your fabrics will thank you.",
        "Save the Planet & Your Clothes - This 98.95% natural enzyme cleaner is vegan, cruelty-free, biodegradable, and bleach-free. Our hypoallergenic oil stain remover for clothes is as easy as spraying, waiting, and washing. With pure ingredients, feel good about caring for your clothes and the environment.",
        "Make a Pure Difference - With every bottle of Puracy Stain Remover sold, we donate to children and families in need. With every purchase, you not only get a powerful natural cleaner but also make a positive impact in the lives of others.",
        "For normal stains - Spray the affected area, wait 15 mins before laundering. For tough stains - Spray, massage with brush. Wait 8 hrs (or more), warmest water allowed, use \"Extra Rinse\" cycle. Some stains may need 2 treatments. For fabrics not for washing machine - Follow \"Normal Use\" instructions. To rinse, wet cloth with warm water, wring, press on stain. Repeat 'til remover is gone. Test colorfastness first. Don't exceed 1 hr on silk or wool."
      ],
      "description": "N/A",
      "parentTitle": "Puracy Stain Remover - Cleaning Spray for Clothes and Laundry",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Puracy Dishwasher Pods, Natural Dishwasher Detergent, Citrus Skies Dish tabs - Enzyme-Powered, Spot & Residue Free - TikTok Trend Items, Must Haves from TikTok (Citrus Skies, 50 Count - 2 Pack)",
      "imagesCSV": "71OiNMd4sOL.jpg,615Jf0osLiL.jpg,61P0tjoo5cL.jpg,61ZBwh8t8uL.jpg,710Sq+uSpaL.jpg,71BD-RjaaTL.jpg,61EDy2sHUtL.jpg",
      "manufacturer": "Puracy",
      "asin": "B0D9HS7RLK",
      "brand": "Puracy",
      "features": [
        "Simplify Dish Time - Discover the ease of dishwashing with Puracy natural dishwasher pods. Designed for both effectiveness and ease, our natural dishwasher detergent promise spotless dishes. Works just fine even in hard water conditions.",
        "Sparkling Clean Dishes - Powered by minerals and plant-derived enzymes with a subtle scent of zesty citrus notes with a clean, airy finish, our non toxic dishwasher detergent effortlessly lift away daily residues, leaving it sparkling, fresh, and ready for another day.",
        "Gentle Yet Effective Cleaning - No more stubborn food remnants. Our dishwasher pods natural gracefully clears all types of grease, oil, stain, food marks, and more, letting you focus on what truly matters. Perfect for those cherished family meals and effortless cleanups.",
        "Purity in a Pouch - Safe on all food prep surfaces, our dish washer pods ensures everything, from your ceramics to children utensils, come out clean. Simply put 1 dish pod into the dish pods dispenser, run the cycle, and take a moment for yourself—you've earned it.",
        "Expertly Crafted with Care - Behind every pack is a team of chemists and PhDs who prioritize your family's safety. Using only mineral and plant-based ingredients, our dishwashing pods ensures peace of mind for homes with little ones and furry friends."
      ],
      "description": "N/A",
      "parentTitle": "Puracy Dishwasher Pods, Natural Dishwasher Detergent, Citrus Skies Dish tabs - Enzyme-Powered, Spot & Residue Free - TikTok Trend Items, Must Haves from TikTok Made Me Buy It",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Misty Nebulizer, Portable Nebulizer with Intuitive LED Interface and Auto-Cleaning, Handheld Nebulizer for Adults Kids",
      "imagesCSV": "81c5SHw6i1L.jpg,81cxHmIjO8L.jpg,81maxjFDIeL.jpg,81fWaWqQysL.jpg,81NooJSNy4L.jpg,71CLbfY1TwL.jpg,71EIAOQ2CGL.jpg,71A5uMjp4OL.jpg,71Xt6EN1n7L.jpg",
      "manufacturer": "Mayluck",
      "asin": "B0DSP6LSW3",
      "brand": "Mayluck",
      "features": [
        "Rechargeable Battery - This upgraded nebulizer offers convenience by eliminating the need for batteries. Simply charge via usb cable, and once fully charged, unplug it and you're ready to go. This allows you to use the nebulizer anytime and anywhere, no battery plugs required.",
        "Efficient Delivery - This nebulizer delivers saline efficiently with smaller particles for deeper airway reach, providing faster relief and quicker nebulization. Ideal for busy individuals and young children.",
        "Intuitively LED Interface - Our user-friendly LED screen makes operation and monitoring effortless. Choose from 3 tailored timing options: 10 minutes for lightning-fast atomization at 0.25ml/min, 20 minutes for a gentle, controlled atomization rate at 0.15ml/min, and 5 minutes for an efficient self-cleaning mode with intermittent mist generation.",
        "Self-cleaning Function - This feature simplifies maintenance, ensuring cleanliness and hygiene between uses. Spend less time on upkeep and more on respiratory health.",
        "Quiet Operation - This nebulizer operates quietly (<25dB), ideal for nighttime use and those seeking a peaceful inhalation experience."
      ],
      "description": "N/A",
      "parentTitle": "N/A",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "MONSEK 4X Extra Sticky Lint Roller for Pet Hair, Lint Rollers 315 Sheets Mega Value Set, Pet Hair Remover with 3 Upgraded Handle 3 Rollers, Portable Lint Remover for Clothes, Furniture, Dog & Cat Hair",
      "imagesCSV": "71lH2RtRGwL.jpg,81oq8SBH1QL.jpg,713QjJvIB0L.jpg,71Dirwcf8eL.jpg,81pQu2p0+RL.jpg",
      "manufacturer": "MONSEK",
      "asin": "B0CCV9KR88",
      "brand": "MONSEK",
      "features": [
        "SAME COST, GET MORE! 315 SHEETS VALUE PACK! Get the most economical lint roller for pet hair in the market with 3 upgraded reusable handles and 3 roller refills now! Each MONSEK lint roller refill includes 105 sheets which are at least 25% more than other pet hair removers, greatly reducing the re-order frequency. SAVE YOUR MONEY!",
        "4X ULTRA STICKY! GET RID OF PESKY PET HAIR! Thanks to the upgraded US PATENTED glue with 4X sticky power, any lint, debris, and hair from your furry friends are no opponents for this lint remover. Just a light roll, witness the transformative power of the perfect clean! Don't worry about the residue! The diagonal cut design of the roller sticker ensures that you can remove the stickers cleanly in a second. Premium thickened stickers, NEVER broken in half, REFUSE paper waste.",
        "HANDLE INNOVATION! FIRM GRIP, ULTIMATE COMFORT! Featuring an auto-locking reel design, the top of the handle will securely lock the refill while rolling. It won't fall off no matter how you roll it. Need to change? Just pinch the reel and take the handle out! Designed in the shape of curve, the handle of this lint remover for clothes can fit your hand for maximum comfort and offers a non-slip grip. Elevate your lint removal experience now!",
        "ON-CALL ANYTIME, ANYWHERE! Our lint roller for clothes works great at removing lint, fur, fuzz, pet hair, and debris from carpets, cars, clothes, furniture, bedding, sofas, curtains, floors, upholstery, and more. Not only a perfect assistant for daily cleaning at home, our pet hair remover with 3 handles also serves as a little lifesaver in the office and travel for its lightweight and compact body, you can carry it in your bag and use it anytime, anywhere. Easy clean, easy life!",
        "HASSLE-FREE REPLACEMENT - NO NEED TO RETURN! We take tremendous pride in our expert workmanship and service on Amazon, and promise to treat you like family! MONSEK lint rollers for pet hair extra sticky are committed to providing a clean, tidy, and comfortable environment for you and your pet friends. Any problem with the product will get a response in 24hr from our professional team after your contact. If you aren't happy with your purchase, we will issue a refund! No questions asked!"
      ],
      "description": "N/A",
      "parentTitle": "4X Extra Sticky Lint Roller for Pet Hair, Lint Rollers 315 Sheets Mega Value Set, Pet Hair Remover with 3 Upgraded Handle 3 Rollers, Portable Lint Remover for Clothes, Furniture, Dog & Cat Hair",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Duck The Original Brand 394475 Duct Tape, 1.88 Inch x 60 Yard Silver (Pack of 24)",
      "imagesCSV": "61XGCcVXeVL.jpg,81L1TgnJFyL.jpg,81lfGetBdoL.jpg,81Jav9VHk-L.jpg,71lkGlPPBrL.jpg,71LwjIbk6JL.jpg,61lTnPV0I8L.jpg",
      "manufacturer": "Shurtape Technologies",
      "asin": "B0BNNCSQFV",
      "brand": "Duck",
      "features": [
        "Recommended for temporary household repairs including holding, seaming, sealing and bundling",
        "Works on a variety of surfaces, including wood, vinyl, plastic, leather, metal and laminate",
        "Tears easily by hand without curling for quick fixes",
        "Conforms to uneven surfaces for difficult DIY projects that involve corners, bends and curves",
        "Strong adhesion with waterproof backing for both indoor and outdoor use",
        "MADE IN THE USA: This Duck Brand duct tape is made in America."
      ],
      "description": "The Original Duck Tape Brand Duct Tape is the classic tool for temporary repairs and everyday fixes. Featuring strong adhesion, this hand tearable duct tape is a workbench favorite and is great for holding, seaming, sealing and bundling. Its strength and conformability makes this tape ideal for those difficult DIY projects that involve corners, bends and curves. With its wide variety of uses around the home or office, Original grade tape is the perfect tool to have on hand.",
      "parentTitle": "The Original Duck Tape Brand Duct Tape Silver",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Dimora Silicone Foam Dressing with Border Adhesive 6\"x6\" Waterproof Wound Dressing Bandage for Wound Care 5 Pack…",
      "imagesCSV": "61KlCz7V9cL.jpg,51mxM432AGL.jpg,61MtkSaDclL.jpg,61meR8IbOeL.jpg,71tDngymaRL.jpg,61iM2-AIPqL.jpg,71z9+1JGKgL.jpg,71XJKSN57eL.jpg",
      "manufacturer": "Winner Medical",
      "asin": "B094X58QWN",
      "brand": "Dimora",
      "features": [
        "PROMOTE HEALING LESS PAIN - Absorbs 15 times of wound fluid thanks to our 5 layers material self-adherent dressings. It maintains a healthy moisture environment, creates a barrier from the outside, promotes wound recovery",
        "GENTLE BUT SECURE ADHESION - We adopts an A+ medical-grade hypoallergenic silicone as a wound contact layer, it absorbs dead tissue cells, won't stick to the moist wound, while is sticky enough to stick to dry skin, minimize pain and trauma at dressings change",
        "PREVENT INFECTION - Semi-permeable PU film layer is waterproof and breathable, which provides a liquid barrier while allowing the passage of oxygen and water vapor, avoiding cross-infection",
        "MAKE LIFE EASIER - The foam pads with a unique thick foam core layer maximize the absorbent to 15 times, SAF layer to lock the fluids avoid maceration, nonwoven layer disperse exudate, more absorbent than traditional bandage gauze, no need to change frequently",
        "MULTI-USE WOUND CARE PRODUCTS- Border 6\"x6\" is fit for wounds within 4.3\"x4.3\"(foam pad size), useful for moderately to high exudating wounds, such as surgical incisions, bedsore wounds, pressure ulcers, venous leg ulcers, neuropathic ulcers, arterial ulcers, post-operative, Ⅰ-Ⅱdegree burns"
      ],
      "description": "N/A",
      "parentTitle": "Dimora Silicone Foam Dressing",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Gorilla Waterproof Caulk & Seal Silicone Sealant, 10oz Cartridge (Pack of 12) - Clear Caulking Sealant for Kitchen, Window, Bath, Marine, Door and More",
      "imagesCSV": "91Ik7w155IL.jpg,31gdoMW-i8L.jpg,21xtsXU3iNL.jpg,21HUIyaWvRL.jpg,81xMIw58acL.jpg,81oiNVnEO8L.jpg,71UTxEAlDUL.jpg,819uBPZ9eyL.jpg",
      "manufacturer": "Gorilla Glue",
      "asin": "B0B29DWKG1",
      "brand": "Gorilla",
      "features": [
        "Waterproof sealant: This clear caulk seals out air, water, and moisture with 100% silicone as cured",
        "All-purpose: Gorilla caulk works wherever the work is; Indoor and out, rain or shine after fully cured",
        "Speed meets strength: Caulk & Seal's silicone caulk is ready for water exposure in as little as 30 minutes",
        "Gorilla tough: This clear silicone caulk is not only mold & mildew resistant, it won't yellow, shrink or crack over time"
      ],
      "description": "Gorilla Waterproof Caulk & Seal 100% Silicone Sealant* seals out water, air and moisture and is great for kitchen, bath, window, doors, auto, marine plumbing, gutters and more! Ready for water exposure in just 30 minutes, this waterproof sealant is & resistant. This clear silicone sealant won't yellow, shrink or crack over time!\n**Note: Do not use on wet, damp, frozen or contaminated surfaces. Not paintable. Not for use in underwater applications, aquariums, on brick, masonry, cementitious materials or on metals sensitive to corrosion including brass & galvanized metals. For general auto/marine applications – not for under hood or direct gasoline exposure.\nTO OPEN:\nCut nozzle at 45° angle to desired bead size. Puncture inner foil seal.\nTO USE:\nAll surfaces should be clean and free of dirt, grease, oil and old sealant. For gaps larger than ½ inch use backer rod. Best if applied above 40°F (5°C).\n1) Insert into cartridge gun.\n2) Apply sealant, pushing bead ahead of nozzle.\n3) Smooth bead immediately after application, before skin forms.\n30 MINUTE RAIN/SHOWER READY: Can be exposed to water in as little as 30 minutes based on a 3/16” bead at 70°F (21°C) and 50% humidity. Otherwise, wait 24 hrs.\nSTORAGE: Replace cap tightly to prevent material from curing. Store in cool, dry location. To re-use nozzle, remove sealant from nozzle once cured.\nCLEAN-UP: Wipe wet sealant off project immediately with a dry cloth. Isopropyl alcohol may be used according to solvent manufacturer’s instructions.\nClick on the Gorilla link at the top of the page to see more Gorilla Tough products.",
      "parentTitle": "Gorilla Waterproof Caulk and Seal 100precent Silicone Sealant, 10oz Cartridge, White",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "2024 All-New 4 in 1 Tds Meter Digital Water Tester - Accurate and Reliable TDS EC & Temp(°C,°F) Meter - 0-9990ppm - Professional Testing for Drinking Water, RO/DI System, Aquariums etc",
      "imagesCSV": "71BDhjTamnL.jpg,719z0lKLlWL.jpg,717Et9+hA4L.jpg,61y9U0Km8IL.jpg,61fhgpM7pfL.jpg",
      "manufacturer": "MEXYBE",
      "asin": "B0DP4C8HP5",
      "brand": "MEXYBE",
      "features": [
        "Reliable Brand: MEXYBE was founded with a simple yet important mission: to provide everyone with a accurate and reliable way to test their water quality. We believe that access to clean and safe drinking water is a basic human right, and our tds meter digital water tester is one professional way that can help people achieve that. We are committed to providing high-quality products and excellent customer service. Join us in our mission to make clean and safe water accessible to everyone",
        "Accurate and Reliable Results: Tired of getting unreliable readings from other water testers? Look no further. The MEXYBE 2024 ALL-NEW water quality tester features a high-precision chip and a premium titanium alloy probe, ensuring accurate and reliable results every time. Equipped with cutting-edge technology and advanced features, it's the ultimate choice for precise water testing. So why wait? Experience dependable testing performance for you and your family today",
        "Multifunctional (4 in 1) and 5 Upgraded: Professional TDS (Total Dissolved Solids), EC (Electrical Conductivity), Temperature (Degree Centigrade) and Temperature (Fahrenheit) Meter 4 in 1. Upgraded with big backlit LCD for easier reading, auto-lock function for easier use, factory calibrated and hold function for direct use and auto-0ff in 2 minutes to conserve battery. These enhancements make it a user-friendly tds meter digital water tester for a variety of applications",
        "Two User-Friendly Features:1. 25% Larger Backlit LCD: The MEXYBE 2024 4-in-1 water quality tester has a screen that's 25% bigger than older 3 in 1 models the market, making it easier to read for everyone, including seniors and children. 2. Convenient TDS Chart: A colorful TDS chart is placed on the back of the tester and in the user guide, so you can quickly understand PPM values without searching online—saving you time with every test",
        "Multipurpose Tds Tester: Test the purity of drinking water to ensure it's safe and healthy, monitor if Reverse Osmosis (RO)/Deionization(DI) System works properly, whether filter need replaced, maintenance aquarium, hydroponics(test nutrients), well, pool, hot tub, spa and testing tap water, bottle water etc"
      ],
      "description": "N/A",
      "parentTitle": "2024 All-New 4 in 1 Tds Meter Digital Water Tester - Accurate and Reliable TDS EC & Temp(°C,°F) Meter - 0-9990ppm - Professional Testing for Drinking Water, RO/DI System, Aquariums etc",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "VEXUNGA CBB60 Capacitor 2.5uF 450V AC Run Capacitors 450VAC 2.5 µF 2.5MFD SH Start Motor Capacitor 50/60Hz ±5% 30x51MM with Wire for Air Compressor",
      "imagesCSV": "41SSv67xkGL.jpg,51kbehElPJL.jpg,518e3GmVS7L.jpg,51R69xOvrkL.jpg,4116f-E7g2L.jpg,31Ye3bgMywL.jpg,21tbOdrbpbL.jpg,31xjHoiruJL.jpg,21vrlRaxYmL.jpg",
      "manufacturer": "VEXUNGA",
      "asin": "B0CDH8CCPM",
      "brand": "VEXUNGA",
      "features": [
        "VEXUNGA CBB60 2.5uF Capacitor Motor Starting Run Capacitors for Electrical Household Appliances",
        "Nominal Capacity: 2.5uF; Nominal Voltage: 450V AC; The equivalent series resistance (ESR) is 0.2; Operating Temperature: -25 ℃ to +70 ℃/ -13℉ to +158℉. Frequency: 50/60 Hertz",
        "Advantages: CBB60 motor run SH capacitor low losses, excellent self-healing properties and high insulation resistance. Performance is stable, long service life",
        "Easy Installation: Capacitors are supplied with cables so they can be easily installed in a wide range of applications including compressors, fans, water pump motors, air conditioners and washing machines",
        "Package Content: 1 pcs x 2.5uF CBB60 Run Capacitor"
      ],
      "description": "N/A",
      "parentTitle": "VEXUNGA AC Capacitor",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Tub O Towels TW90 Heavy-Duty 10\" x 12\" Size Multi-Surface Cleaning Wipes, 90 Count Per Canister",
      "imagesCSV": "61u6bZ5I8HL.jpg,71Iwk7ZoiFL.jpg,71fr7ePPD5L.jpg,71Xv9xfIajL.jpg,71SEE48mrOL.jpg,71R49RO7-4L.jpg,81ODvAJJyRL.jpg",
      "manufacturer": "Federal Process",
      "asin": "B00022W4ZU",
      "brand": "Tub O' Towels",
      "features": [
        "10\" x 12\" heavy duty wet cleaning wipes. The strongest and largest wet paper towel cleaning wipe. No water required",
        "Removes heavy stains others won't including: grease, tar, ink, paint, permanent marker, wax, scuffs, lip stick, nail polish, food and drinks, pet stains and more",
        "These moist towels are gentle on hands and skin. Wipes contain aloe, Vitamin E and lanolin to protect your hands and leave them clean and soft. Our heavy duty cleaning wipes do not contain disinfecting or antibacterial properties",
        "Tub O' Towels can be used as automotive and car cleaning wipes, for the office, boating, and RV's, and around the home",
        "Use these tough cleaning wipes on Fabric and Carpet, Leather, Vinyl, Metal, Counter Tops, Walls, For Cleaning Appliances, Tile, Cabinets, Toilets, Tubs and more"
      ],
      "description": "TUB O TOWELS 90 COUNT HEAVY DUTY CLEANING WIPES",
      "parentTitle": "Tub O Towels Multi-Surface Cleaning Wipes",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Fygrip 10 Pack Jumbo Vacuum Storage Bags with Hand Pump, Plastic Packaging Bags, 80% Space Saver Vacuum Seal Bags for Clothing, Travel Lugggage, Blankets, Comforters",
      "imagesCSV": "71xxDO99YjL.jpg,71lAvwpUYlL.jpg,715GsvN7mBL.jpg,81jnrgAO5aL.jpg,71DH4YK053L.jpg,81QsLLAThrL.jpg,71i5deNmS4L.jpg",
      "manufacturer": "FYGRIP",
      "asin": "B0D3Y1YZ59",
      "brand": "FYGRIP",
      "features": [
        "【80% Space Save】: Pack-Seal-Vacuum, with these 3 easy steps, Fygrip vacuum storage bags help you save 80% storage space. They are the game changer for storing your beddin, blankets, clothing and more.",
        "【Long Lasting Protection】: Made of premium thick plastic, these sturdy plastic packaging bags features a double-zipper design and tripple seal one-way valve, which ensures that the bags stay compressed. Providing long lasting protection for your belongings.",
        "【Easy Compression】: The one-way valve can adapt the vacuum cleaner, you can easily suck the air out and get the compression done fast and easy. Also, the package comes with a hand pump which is portable for travel.",
        "【Multi-purpose】These sturdy space saver vaccum bags efficiently reduce the space of storage and transport, which is great for household storage, travel, packaging & moving.",
        "【10 Value pack】Package inclued 10 Jumbo vacuum storage bags, these variety size combo are great for keep your beddings, pillows, sweaters and clothings neat and clean"
      ],
      "description": "N/A",
      "parentTitle": "Fygrip Vacuum Storage Bags, Plastic Packaging Bags",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "eSUN Matte PLA Filament 1.75mm, Matte 3D Printer PLA Filament, 1KG Spool 3D Printing Filament for 3D Printers, Paper Reel, Peach Pink",
      "imagesCSV": "6154xDRmqsL.jpg,71J-CB5avnL.jpg,71njkG-FueL.jpg,7192ObgU82L.jpg,610PDpToXYL.jpg,614Q0S3PFXL.jpg",
      "manufacturer": "eSUN",
      "asin": "B0B9MJZV8D",
      "brand": "eSUN",
      "features": [
        "【Delicate Matte PLA】With excellent matte printed surface, eSUN Matte PLA has better printing effect and doesn't have obvious layer lines than normal PLA. Not easy to break. Supporting structure of it is easy to peel off. Compatible with Most of FDM 3D Printers, such as: Bambu Lab P1P / X1 / X1C / P1P / A1 / A1 Mini, Voron 2.4, Raise3D, Prusa, Creality Ender 3 and Ender 7.",
        "【High Toughness & Better Adhesion】Compared to normal PLA filament, eSUN Matte PLA has higher toughness.Printed models are not easy to break or crack, which can be widly used in accessory, home decoration, toy, sculpture, shell and COSPLAY. With upgraded paper reel, eSUN Matte PLA has better adhesion and printibility which improves the problem of bottom adhesion on the plate.",
        "【Stable Dimensional Tolerance】Minimum tolerance and low warping to ensure consistent feeding and stable prints, good layer bonding, less stringing, no bubbles, easy handling, resulting in an outstanding surface finish and are highly precise.",
        "【Tangle Free & No Plugging】Full 1KG 3D printer filament reel, perfect roundness and very tight diameter tolerance, good winding, does not overlap or tangle. Melt well, feed smoothly and constantly without clogging the nozzle or extruder, high successful printing rate.",
        "【Environmental Friendly Package & Reel】Scrap is reused to produce recyclable spool and packaging box. eSUN filament comes in a sealed vacuum bag with a desiccant bag, easily keep your 3D printer filaments at an optimal storage condition and free from dust or dirt before opening the vacuumed sealed packaging."
      ],
      "description": "N/A",
      "parentTitle": "eSUN PLA Filament 1.75mm, 3D Printer Filament Upgraded PLA Filament, Dimensional Accuracy +/- 0.03mm, 1KG Spool (2.2 LBS) 3D Printing Filament for 3D Printers",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "MedPride Powder-Free Nitrile Exam Gloves, Large, Large (Pack of 100)",
      "imagesCSV": "51X6FbyYCKL.jpg,81Nn3Qwv3JL.jpg,81KmaDKHBxL.jpg,815jYa9kVnL.jpg,81cFsxctKRL.jpg,81nUM1iBy1L.jpg,81dw1JzU6oL.jpg",
      "manufacturer": "MED PRIDE",
      "asin": "B00GS8VGP6",
      "brand": "MED PRIDE",
      "features": [
        "MEDICAL-GRADE, PUNCTURE-RESISTANT NITRILE GLOVES: These premium medical examination gloves are made of great quality nitrile that is proven to be more resistant and durable than latex or any other type of gloves. Waterproof and puncture-resistant, they can fully shield your hands from needles, drugs, blood or any other potential threat so you can examine your patients with peace of mind.",
        "THE MOST PROTECTIVE EXAM GLOVES FOR ANY MEDICAL USE: Our single-use, heavy-duty disposable nitrile gloves feature textured fingerprints for excellent tactile sensitivity. Ideal for anyone working in the healthcare field including: doctors, nurses, paramedics, first-aiders, dentists, at-home caregivers and even aestheticians and tattoo artists. Great for food prep, professional food services, labs, factories, cleaning and so much more.",
        "LATEX & POWDER-FREE FOR IRRITATION-FREE WEAR: These non-sterile safety gloves feature a latex and powder free synthesis to provide unparalleled comfort even after many hours of use. While most people are easily irritated by latex and powder, our skin-friendly hospital gloves get the job done without causing any discomfort. Suitable even for people prone to skin sensitivities.",
        "MANY SIZES TO CHOOSE FROM | YOUR SATISFACTION IS GUARANTEED: Available in 4 different sizes [Small, Medium, Large and Extra Large], and a great value pack [Box of 100 disposable, latex-free gloves], you can definitely find the perfect match for all your needs. Backed up by an Unconditional Money Back Satisfaction Guarantee, you can order your protective gloves today completely risk-free!",
        "ORDER WITH PEACE OF MIND: Medpride is your trusted supplier of effective, top quality medical products that you can count on to equip your personal or professional medical kit. Backed by a 30-Day Money Back Guarantee, you have every good reason to choose Medpride for all your personal care supplies!"
      ],
      "description": "N/A",
      "parentTitle": "MedPride Powder-Free Nitrile Exam Gloves, Case/1000, 100 Count (Pack of 10)",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    },
    {
      "title": "Supmedic Medical Nitrile Exam Gloves, Latex-Free, Powder-Free, Food Safe, Cooking Food Prep, Disposable Gloves, Blue, 100 Pcs (Medium)",
      "imagesCSV": "81FCZUMe5vL.jpg,71E7SlvqgRL.jpg,71fe77GH3zL.jpg,71ELnIxal8L.jpg,71gb53s1k2L.jpg,81zz5xB2iIL.jpg,71SbUj0r58L.jpg,81+A8BupgtL.jpg,71g189bUoPL.jpg",
      "manufacturer": "Supmedic",
      "asin": "B0C9SBFGZR",
      "brand": "Supmedic",
      "features": [
        "MEDICAL-GRADE 3.5 MIL - Supmedic nitrile gloves deliver hospital-level barrier & tactile feel - 40 % thicker than typical food gloves.",
        "ALLERGY SAFE – 100% Powder-free & Latex-free gloves eliminates common allergies; skin-friendly material passes EN455 irritation testing for worry-free wear on sensitive hands.",
        "TEXTURED GRIP – Micro-roughened fingertips plus smooth palms keep a confident hold on instruments, wet dishes or oily parts without sacrificing dexterity.",
        "VERSATILE PACK – 100 ambidextrous gloves dispense one-handed from the top-load box; perfect for clinics, dentistry, food prep, cleaning, auto repair, beauty salons, pet care and more.",
        "SUPPLIER-DIRECT VALUE - Produced in Supmedic's facility and Prime-fulfilled for fastdelivery; upgrade to 100 or 1000 count cases and save up to 40 % per glove."
      ],
      "description": "N/A",
      "parentTitle": "Supmedic 3.5 Mil Nitrile Exam Gloves, 100 Count - Powder-Free Latex-Free Disposable Glove for Medical Cooking Food Prep, Blue",
      "starRating": "N/A",
      "category": "Industrial & Scientific",
      "categoryId": 16310091
    }
  ]
}